TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE    1

    9200              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:37 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    5805                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    5806                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    5807              
    5808              $C$DW$T$97      .dwtag  DW_TAG_enumeration_type
    5809                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
    5810              $C$DW$397       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
    5811              $C$DW$398       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
    5812              $C$DW$399       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
    5813              $C$DW$400       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
    5814                      .dwendtag $C$DW$T$97
    5815              
    5816              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
    5817                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    5818                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  144

    5819              
    5820              $C$DW$T$99      .dwtag  DW_TAG_enumeration_type
    5821                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
    5822              $C$DW$401       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    5823              $C$DW$402       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    5824                      .dwendtag $C$DW$T$99
    5825              
    5826              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    5827                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    5828                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    5829              
    5830              $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    5831                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    5832              $C$DW$403       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    5833              $C$DW$404       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    5834              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    5835              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    5836              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    5837              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    5838              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    5839              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    5840              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    5841              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    5842              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    5843              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    5844              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    5845              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    5846              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    5847              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    5848                      .dwendtag $C$DW$T$111
    5849              
    5850              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    5851                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    5852                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    5853              
    5854              $C$DW$T$113     .dwtag  DW_TAG_enumeration_type
    5855                      .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
    5856              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    5857              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    5858              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    5859              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    5860              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    5861                      .dwendtag $C$DW$T$113
    5862              
    5863              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    5864                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    5865                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    5866              
    5867              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5868                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    5869              $C$DW$424       .dwtag  DW_TAG_member
    5870                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    5871                      .dwattr $C$DW$424, DW_AT_name("TXFUNCADDR")
    5872                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_TXFUNCADDR")
    5873                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  145

    5874                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5875              $C$DW$425       .dwtag  DW_TAG_member
    5876                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    5877                      .dwattr $C$DW$425, DW_AT_name("TXHUBADDR_TXHUBPORT")
    5878                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    5879                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5880                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5881              $C$DW$426       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$21)
    5883                      .dwattr $C$DW$426, DW_AT_name("RSVD0")
    5884                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_RSVD0")
    5885                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5886                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5887              $C$DW$427       .dwtag  DW_TAG_member
    5888                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    5889                      .dwattr $C$DW$427, DW_AT_name("RXFUNCADDR")
    5890                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_RXFUNCADDR")
    5891                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5892                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5893              $C$DW$428       .dwtag  DW_TAG_member
    5894                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    5895                      .dwattr $C$DW$428, DW_AT_name("RXHUBADDR_RXHUBPORT")
    5896                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    5897                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5898                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5899              $C$DW$429       .dwtag  DW_TAG_member
    5900                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$21)
    5901                      .dwattr $C$DW$429, DW_AT_name("RSVD36")
    5902                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_RSVD36")
    5903                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5904                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5905                      .dwendtag $C$DW$T$22
    5906              
    5907              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    5908                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    5909                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    5910              
    5911              $C$DW$T$40      .dwtag  DW_TAG_array_type
    5912                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    5913                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    5914                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    5915              $C$DW$430       .dwtag  DW_TAG_subrange_type
    5916                      .dwattr $C$DW$430, DW_AT_upper_bound(0x04)
    5917                      .dwendtag $C$DW$T$40
    5918              
    5919              
    5920              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5921                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    5922              $C$DW$431       .dwtag  DW_TAG_member
    5923                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    5924                      .dwattr $C$DW$431, DW_AT_name("TXMAXP")
    5925                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_TXMAXP")
    5926                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5927                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5928              $C$DW$432       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  146

    5929                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    5930                      .dwattr $C$DW$432, DW_AT_name("PERI_TXCSR")
    5931                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_PERI_TXCSR")
    5932                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5933                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5934              $C$DW$433       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
    5936                      .dwattr $C$DW$433, DW_AT_name("RSVD0")
    5937                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD0")
    5938                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5939                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5940              $C$DW$434       .dwtag  DW_TAG_member
    5941                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    5942                      .dwattr $C$DW$434, DW_AT_name("RXMAXP")
    5943                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RXMAXP")
    5944                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5945                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5946              $C$DW$435       .dwtag  DW_TAG_member
    5947                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    5948                      .dwattr $C$DW$435, DW_AT_name("PERI_RXCSR")
    5949                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_PERI_RXCSR")
    5950                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5951                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5952              $C$DW$436       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    5954                      .dwattr $C$DW$436, DW_AT_name("RSVD1")
    5955                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_RSVD1")
    5956                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5957                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5958              $C$DW$437       .dwtag  DW_TAG_member
    5959                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    5960                      .dwattr $C$DW$437, DW_AT_name("RXCOUNT")
    5961                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RXCOUNT")
    5962                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5963                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5964              $C$DW$438       .dwtag  DW_TAG_member
    5965                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
    5966                      .dwattr $C$DW$438, DW_AT_name("RSVD41")
    5967                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_RSVD41")
    5968                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5969                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5970                      .dwendtag $C$DW$T$24
    5971              
    5972              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    5973                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    5974                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5975              
    5976              $C$DW$T$43      .dwtag  DW_TAG_array_type
    5977                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5978                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5979                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    5980              $C$DW$439       .dwtag  DW_TAG_subrange_type
    5981                      .dwattr $C$DW$439, DW_AT_upper_bound(0x03)
    5982                      .dwendtag $C$DW$T$43
    5983              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  147

    5984              
    5985              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5986                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    5987              $C$DW$440       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    5989                      .dwattr $C$DW$440, DW_AT_name("TXGCR1")
    5990                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_TXGCR1")
    5991                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5992                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5993              $C$DW$441       .dwtag  DW_TAG_member
    5994                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    5995                      .dwattr $C$DW$441, DW_AT_name("TXGCR2")
    5996                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_TXGCR2")
    5997                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5998                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5999              $C$DW$442       .dwtag  DW_TAG_member
    6000                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$25)
    6001                      .dwattr $C$DW$442, DW_AT_name("RSVD0")
    6002                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_RSVD0")
    6003                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6004                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6005              $C$DW$443       .dwtag  DW_TAG_member
    6006                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    6007                      .dwattr $C$DW$443, DW_AT_name("RXGCR1")
    6008                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_RXGCR1")
    6009                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6010                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6011              $C$DW$444       .dwtag  DW_TAG_member
    6012                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    6013                      .dwattr $C$DW$444, DW_AT_name("RXGCR2")
    6014                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RXGCR2")
    6015                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6016                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6017              $C$DW$445       .dwtag  DW_TAG_member
    6018                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$21)
    6019                      .dwattr $C$DW$445, DW_AT_name("RSVD1")
    6020                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RSVD1")
    6021                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6022                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6023              $C$DW$446       .dwtag  DW_TAG_member
    6024                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    6025                      .dwattr $C$DW$446, DW_AT_name("RXHPCR1A")
    6026                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RXHPCR1A")
    6027                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6028                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6029              $C$DW$447       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    6031                      .dwattr $C$DW$447, DW_AT_name("RXHPCR2A")
    6032                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_RXHPCR2A")
    6033                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6034                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6035              $C$DW$448       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$21)
    6037                      .dwattr $C$DW$448, DW_AT_name("RSVD2")
    6038                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_RSVD2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  148

    6039                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6040                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6041              $C$DW$449       .dwtag  DW_TAG_member
    6042                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    6043                      .dwattr $C$DW$449, DW_AT_name("RXHPCR1B")
    6044                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_RXHPCR1B")
    6045                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6046                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6047              $C$DW$450       .dwtag  DW_TAG_member
    6048                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    6049                      .dwattr $C$DW$450, DW_AT_name("RXHPCR2B")
    6050                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RXHPCR2B")
    6051                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6052                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6053              $C$DW$451       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$26)
    6055                      .dwattr $C$DW$451, DW_AT_name("RSVD46")
    6056                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD46")
    6057                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6058                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6059                      .dwendtag $C$DW$T$27
    6060              
    6061              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    6062                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    6063                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6064              
    6065              $C$DW$T$47      .dwtag  DW_TAG_array_type
    6066                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6067                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6068                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    6069              $C$DW$452       .dwtag  DW_TAG_subrange_type
    6070                      .dwattr $C$DW$452, DW_AT_upper_bound(0x03)
    6071                      .dwendtag $C$DW$T$47
    6072              
    6073              
    6074              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6075                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    6076              $C$DW$453       .dwtag  DW_TAG_member
    6077                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    6078                      .dwattr $C$DW$453, DW_AT_name("ENTRYLSW")
    6079                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_ENTRYLSW")
    6080                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6081                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6082              $C$DW$454       .dwtag  DW_TAG_member
    6083                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    6084                      .dwattr $C$DW$454, DW_AT_name("ENTRYMSW")
    6085                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ENTRYMSW")
    6086                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6087                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6088              $C$DW$455       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$21)
    6090                      .dwattr $C$DW$455, DW_AT_name("RSVD49")
    6091                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_RSVD49")
    6092                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6093                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  149

    6094                      .dwendtag $C$DW$T$28
    6095              
    6096              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    6097                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    6098                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6099              
    6100              $C$DW$T$51      .dwtag  DW_TAG_array_type
    6101                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    6102                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6103                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    6104              $C$DW$456       .dwtag  DW_TAG_subrange_type
    6105                      .dwattr $C$DW$456, DW_AT_upper_bound(0x3f)
    6106                      .dwendtag $C$DW$T$51
    6107              
    6108              
    6109              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6110                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    6111              $C$DW$457       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    6113                      .dwattr $C$DW$457, DW_AT_name("QMEMRBASE1")
    6114                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_QMEMRBASE1")
    6115                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6116                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6117              $C$DW$458       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    6119                      .dwattr $C$DW$458, DW_AT_name("QMEMRBASE2")
    6120                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_QMEMRBASE2")
    6121                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6122                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6123              $C$DW$459       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    6125                      .dwattr $C$DW$459, DW_AT_name("RSVD0")
    6126                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD0")
    6127                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6128                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6129              $C$DW$460       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    6131                      .dwattr $C$DW$460, DW_AT_name("QMEMRCTRL1")
    6132                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    6133                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6134                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    6135              $C$DW$461       .dwtag  DW_TAG_member
    6136                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    6137                      .dwattr $C$DW$461, DW_AT_name("QMEMRCTRL2")
    6138                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    6139                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6140                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    6141              $C$DW$462       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$29)
    6143                      .dwattr $C$DW$462, DW_AT_name("RSVD63")
    6144                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_RSVD63")
    6145                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6146                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    6147                      .dwendtag $C$DW$T$30
    6148              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  150

    6149              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    6150                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
    6151                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6152              
    6153              $C$DW$T$57      .dwtag  DW_TAG_array_type
    6154                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    6155                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6156                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
    6157              $C$DW$463       .dwtag  DW_TAG_subrange_type
    6158                      .dwattr $C$DW$463, DW_AT_upper_bound(0x0f)
    6159                      .dwendtag $C$DW$T$57
    6160              
    6161              
    6162              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6163                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    6164              $C$DW$464       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$31)
    6166                      .dwattr $C$DW$464, DW_AT_name("RSVD0")
    6167                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_RSVD0")
    6168                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6169                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    6170              $C$DW$465       .dwtag  DW_TAG_member
    6171                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    6172                      .dwattr $C$DW$465, DW_AT_name("CTRL1D")
    6173                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_CTRL1D")
    6174                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6175                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    6176              $C$DW$466       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    6178                      .dwattr $C$DW$466, DW_AT_name("CTRL2D")
    6179                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_CTRL2D")
    6180                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6181                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    6182              $C$DW$467       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
    6184                      .dwattr $C$DW$467, DW_AT_name("RSVD65")
    6185                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD65")
    6186                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6187                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    6188                      .dwendtag $C$DW$T$32
    6189              
    6190              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    6191                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    6192                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6193              
    6194              $C$DW$T$60      .dwtag  DW_TAG_array_type
    6195                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    6196                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6197                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
    6198              $C$DW$468       .dwtag  DW_TAG_subrange_type
    6199                      .dwattr $C$DW$468, DW_AT_upper_bound(0x3f)
    6200                      .dwendtag $C$DW$T$60
    6201              
    6202              
    6203              $C$DW$T$34      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  151

    6204                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    6205              $C$DW$469       .dwtag  DW_TAG_member
    6206                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    6207                      .dwattr $C$DW$469, DW_AT_name("QSTATA")
    6208                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_QSTATA")
    6209                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6210                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    6211              $C$DW$470       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$33)
    6213                      .dwattr $C$DW$470, DW_AT_name("RSVD0")
    6214                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD0")
    6215                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6216                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    6217              $C$DW$471       .dwtag  DW_TAG_member
    6218                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    6219                      .dwattr $C$DW$471, DW_AT_name("QSTAT1B")
    6220                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_QSTAT1B")
    6221                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6222                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    6223              $C$DW$472       .dwtag  DW_TAG_member
    6224                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    6225                      .dwattr $C$DW$472, DW_AT_name("QSTAT2B")
    6226                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_QSTAT2B")
    6227                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6228                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    6229              $C$DW$473       .dwtag  DW_TAG_member
    6230                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$21)
    6231                      .dwattr $C$DW$473, DW_AT_name("RSVD1")
    6232                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_RSVD1")
    6233                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6234                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    6235              $C$DW$474       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    6237                      .dwattr $C$DW$474, DW_AT_name("QSTAT1C")
    6238                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_QSTAT1C")
    6239                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6240                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    6241              $C$DW$475       .dwtag  DW_TAG_member
    6242                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$23)
    6243                      .dwattr $C$DW$475, DW_AT_name("RSVD67")
    6244                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD67")
    6245                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6246                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    6247                      .dwendtag $C$DW$T$34
    6248              
    6249              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    6250                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    6251                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6252              
    6253              $C$DW$T$63      .dwtag  DW_TAG_array_type
    6254                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    6255                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    6256                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
    6257              $C$DW$476       .dwtag  DW_TAG_subrange_type
    6258                      .dwattr $C$DW$476, DW_AT_upper_bound(0x3f)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  152

    6259                      .dwendtag $C$DW$T$63
    6260              
    6261              
    6262              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    6263                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
    6264              $C$DW$477       .dwtag  DW_TAG_member
    6265                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    6266                      .dwattr $C$DW$477, DW_AT_name("REVID1")
    6267                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_REVID1")
    6268                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6269                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    6270              $C$DW$478       .dwtag  DW_TAG_member
    6271                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    6272                      .dwattr $C$DW$478, DW_AT_name("REVID2")
    6273                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_REVID2")
    6274                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6275                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    6276              $C$DW$479       .dwtag  DW_TAG_member
    6277                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
    6278                      .dwattr $C$DW$479, DW_AT_name("RSVD0")
    6279                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSVD0")
    6280                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6281                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    6282              $C$DW$480       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    6284                      .dwattr $C$DW$480, DW_AT_name("CTRLR")
    6285                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_CTRLR")
    6286                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6287                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    6288              $C$DW$481       .dwtag  DW_TAG_member
    6289                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$33)
    6290                      .dwattr $C$DW$481, DW_AT_name("RSVD1")
    6291                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RSVD1")
    6292                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6293                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    6294              $C$DW$482       .dwtag  DW_TAG_member
    6295                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    6296                      .dwattr $C$DW$482, DW_AT_name("STATR")
    6297                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_STATR")
    6298                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6299                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    6300              $C$DW$483       .dwtag  DW_TAG_member
    6301                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$33)
    6302                      .dwattr $C$DW$483, DW_AT_name("RSVD2")
    6303                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD2")
    6304                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6305                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    6306              $C$DW$484       .dwtag  DW_TAG_member
    6307                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    6308                      .dwattr $C$DW$484, DW_AT_name("EMUR")
    6309                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_EMUR")
    6310                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6311                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    6312              $C$DW$485       .dwtag  DW_TAG_member
    6313                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$33)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  153

    6314                      .dwattr $C$DW$485, DW_AT_name("RSVD3")
    6315                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_RSVD3")
    6316                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6317                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    6318              $C$DW$486       .dwtag  DW_TAG_member
    6319                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    6320                      .dwattr $C$DW$486, DW_AT_name("MODE1")
    6321                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_MODE1")
    6322                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6323                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    6324              $C$DW$487       .dwtag  DW_TAG_member
    6325                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    6326                      .dwattr $C$DW$487, DW_AT_name("MODE2")
    6327                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_MODE2")
    6328                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6329                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    6330              $C$DW$488       .dwtag  DW_TAG_member
    6331                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$21)
    6332                      .dwattr $C$DW$488, DW_AT_name("RSVD4")
    6333                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD4")
    6334                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6335                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    6336              $C$DW$489       .dwtag  DW_TAG_member
    6337                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
    6338                      .dwattr $C$DW$489, DW_AT_name("AUTOREQ")
    6339                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_AUTOREQ")
    6340                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6341                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    6342              $C$DW$490       .dwtag  DW_TAG_member
    6343                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$33)
    6344                      .dwattr $C$DW$490, DW_AT_name("RSVD5")
    6345                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_RSVD5")
    6346                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6347                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    6348              $C$DW$491       .dwtag  DW_TAG_member
    6349                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
    6350                      .dwattr $C$DW$491, DW_AT_name("SPRFIXTIME1")
    6351                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    6352                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6353                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    6354              $C$DW$492       .dwtag  DW_TAG_member
    6355                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    6356                      .dwattr $C$DW$492, DW_AT_name("SPRFIXTIME2")
    6357                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    6358                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6359                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    6360              $C$DW$493       .dwtag  DW_TAG_member
    6361                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$21)
    6362                      .dwattr $C$DW$493, DW_AT_name("RSVD6")
    6363                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD6")
    6364                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6365                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    6366              $C$DW$494       .dwtag  DW_TAG_member
    6367                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    6368                      .dwattr $C$DW$494, DW_AT_name("TEARDOWN1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  154

    6369                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_TEARDOWN1")
    6370                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6371                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    6372              $C$DW$495       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    6374                      .dwattr $C$DW$495, DW_AT_name("TEARDOWN2")
    6375                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_TEARDOWN2")
    6376                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6377                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    6378              $C$DW$496       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
    6380                      .dwattr $C$DW$496, DW_AT_name("RSVD7")
    6381                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD7")
    6382                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6383                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    6384              $C$DW$497       .dwtag  DW_TAG_member
    6385                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    6386                      .dwattr $C$DW$497, DW_AT_name("INTSRCR1")
    6387                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_INTSRCR1")
    6388                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6389                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    6390              $C$DW$498       .dwtag  DW_TAG_member
    6391                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    6392                      .dwattr $C$DW$498, DW_AT_name("INTSRCR2")
    6393                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_INTSRCR2")
    6394                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6395                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    6396              $C$DW$499       .dwtag  DW_TAG_member
    6397                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$21)
    6398                      .dwattr $C$DW$499, DW_AT_name("RSVD8")
    6399                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_RSVD8")
    6400                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6401                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    6402              $C$DW$500       .dwtag  DW_TAG_member
    6403                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    6404                      .dwattr $C$DW$500, DW_AT_name("INTSETR1")
    6405                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_INTSETR1")
    6406                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6407                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    6408              $C$DW$501       .dwtag  DW_TAG_member
    6409                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
    6410                      .dwattr $C$DW$501, DW_AT_name("INTSETR2")
    6411                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_INTSETR2")
    6412                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6413                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    6414              $C$DW$502       .dwtag  DW_TAG_member
    6415                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$21)
    6416                      .dwattr $C$DW$502, DW_AT_name("RSVD9")
    6417                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_RSVD9")
    6418                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6419                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6420              $C$DW$503       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    6422                      .dwattr $C$DW$503, DW_AT_name("INTCLRR1")
    6423                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_INTCLRR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  155

    6424                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6425                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6426              $C$DW$504       .dwtag  DW_TAG_member
    6427                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
    6428                      .dwattr $C$DW$504, DW_AT_name("INTCLRR2")
    6429                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_INTCLRR2")
    6430                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6431                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6432              $C$DW$505       .dwtag  DW_TAG_member
    6433                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$21)
    6434                      .dwattr $C$DW$505, DW_AT_name("RSVD10")
    6435                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_RSVD10")
    6436                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6437                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6438              $C$DW$506       .dwtag  DW_TAG_member
    6439                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    6440                      .dwattr $C$DW$506, DW_AT_name("INTMSKR1")
    6441                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_INTMSKR1")
    6442                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6443                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6444              $C$DW$507       .dwtag  DW_TAG_member
    6445                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
    6446                      .dwattr $C$DW$507, DW_AT_name("INTMSKR2")
    6447                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_INTMSKR2")
    6448                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6449                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6450              $C$DW$508       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$21)
    6452                      .dwattr $C$DW$508, DW_AT_name("RSVD11")
    6453                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_RSVD11")
    6454                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6455                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6456              $C$DW$509       .dwtag  DW_TAG_member
    6457                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
    6458                      .dwattr $C$DW$509, DW_AT_name("INTMSKSETR1")
    6459                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_INTMSKSETR1")
    6460                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6461                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6462              $C$DW$510       .dwtag  DW_TAG_member
    6463                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$20)
    6464                      .dwattr $C$DW$510, DW_AT_name("INTMSKSETR2")
    6465                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_INTMSKSETR2")
    6466                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    6467                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6468              $C$DW$511       .dwtag  DW_TAG_member
    6469                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$21)
    6470                      .dwattr $C$DW$511, DW_AT_name("RSVD12")
    6471                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_RSVD12")
    6472                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6473                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6474              $C$DW$512       .dwtag  DW_TAG_member
    6475                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
    6476                      .dwattr $C$DW$512, DW_AT_name("INTMSKCLRR1")
    6477                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    6478                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  156

    6479                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6480              $C$DW$513       .dwtag  DW_TAG_member
    6481                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
    6482                      .dwattr $C$DW$513, DW_AT_name("INTMSKCLRR2")
    6483                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    6484                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    6485                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6486              $C$DW$514       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$21)
    6488                      .dwattr $C$DW$514, DW_AT_name("RSVD13")
    6489                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_RSVD13")
    6490                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6491                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6492              $C$DW$515       .dwtag  DW_TAG_member
    6493                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
    6494                      .dwattr $C$DW$515, DW_AT_name("INTMASKEDR1")
    6495                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_INTMASKEDR1")
    6496                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6497                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6498              $C$DW$516       .dwtag  DW_TAG_member
    6499                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
    6500                      .dwattr $C$DW$516, DW_AT_name("INTMASKEDR2")
    6501                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_INTMASKEDR2")
    6502                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6503                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6504              $C$DW$517       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$21)
    6506                      .dwattr $C$DW$517, DW_AT_name("RSVD14")
    6507                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_RSVD14")
    6508                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6509                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6510              $C$DW$518       .dwtag  DW_TAG_member
    6511                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
    6512                      .dwattr $C$DW$518, DW_AT_name("EOIR")
    6513                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_EOIR")
    6514                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6515                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6516              $C$DW$519       .dwtag  DW_TAG_member
    6517                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$33)
    6518                      .dwattr $C$DW$519, DW_AT_name("RSVD15")
    6519                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_RSVD15")
    6520                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    6521                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6522              $C$DW$520       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    6524                      .dwattr $C$DW$520, DW_AT_name("INTVECTR1")
    6525                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_INTVECTR1")
    6526                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6527                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6528              $C$DW$521       .dwtag  DW_TAG_member
    6529                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$20)
    6530                      .dwattr $C$DW$521, DW_AT_name("INTVECTR2")
    6531                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_INTVECTR2")
    6532                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6533                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  157

    6534              $C$DW$522       .dwtag  DW_TAG_member
    6535                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$26)
    6536                      .dwattr $C$DW$522, DW_AT_name("RSVD16")
    6537                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD16")
    6538                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6539                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6540              $C$DW$523       .dwtag  DW_TAG_member
    6541                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    6542                      .dwattr $C$DW$523, DW_AT_name("GREP1SZR1")
    6543                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_GREP1SZR1")
    6544                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6545                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6546              $C$DW$524       .dwtag  DW_TAG_member
    6547                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$20)
    6548                      .dwattr $C$DW$524, DW_AT_name("GREP1SZR2")
    6549                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_GREP1SZR2")
    6550                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    6551                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6552              $C$DW$525       .dwtag  DW_TAG_member
    6553                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$21)
    6554                      .dwattr $C$DW$525, DW_AT_name("RSVD17")
    6555                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_RSVD17")
    6556                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    6557                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6558              $C$DW$526       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
    6560                      .dwattr $C$DW$526, DW_AT_name("GREP2SZR1")
    6561                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_GREP2SZR1")
    6562                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6563                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6564              $C$DW$527       .dwtag  DW_TAG_member
    6565                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$20)
    6566                      .dwattr $C$DW$527, DW_AT_name("GREP2SZR2")
    6567                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_GREP2SZR2")
    6568                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    6569                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6570              $C$DW$528       .dwtag  DW_TAG_member
    6571                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$21)
    6572                      .dwattr $C$DW$528, DW_AT_name("RSVD18")
    6573                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_RSVD18")
    6574                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6575                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6576              $C$DW$529       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    6578                      .dwattr $C$DW$529, DW_AT_name("GREP3SZR1")
    6579                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_GREP3SZR1")
    6580                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6581                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6582              $C$DW$530       .dwtag  DW_TAG_member
    6583                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$20)
    6584                      .dwattr $C$DW$530, DW_AT_name("GREP3SZR2")
    6585                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_GREP3SZR2")
    6586                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    6587                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6588              $C$DW$531       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  158

    6589                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$21)
    6590                      .dwattr $C$DW$531, DW_AT_name("RSVD19")
    6591                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_RSVD19")
    6592                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6593                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6594              $C$DW$532       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
    6596                      .dwattr $C$DW$532, DW_AT_name("GREP4SZR1")
    6597                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_GREP4SZR1")
    6598                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6599                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6600              $C$DW$533       .dwtag  DW_TAG_member
    6601                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$20)
    6602                      .dwattr $C$DW$533, DW_AT_name("GREP4SZR2")
    6603                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_GREP4SZR2")
    6604                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6605                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6606              $C$DW$534       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$35)
    6608                      .dwattr $C$DW$534, DW_AT_name("RSVD20")
    6609                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_RSVD20")
    6610                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6611                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6612              $C$DW$535       .dwtag  DW_TAG_member
    6613                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
    6614                      .dwattr $C$DW$535, DW_AT_name("FADDR_POWER")
    6615                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_FADDR_POWER")
    6616                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    6617                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6618              $C$DW$536       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$20)
    6620                      .dwattr $C$DW$536, DW_AT_name("INTRTX")
    6621                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_INTRTX")
    6622                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    6623                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6624              $C$DW$537       .dwtag  DW_TAG_member
    6625                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$21)
    6626                      .dwattr $C$DW$537, DW_AT_name("RSVD21")
    6627                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_RSVD21")
    6628                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    6629                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6630              $C$DW$538       .dwtag  DW_TAG_member
    6631                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
    6632                      .dwattr $C$DW$538, DW_AT_name("INTRRX")
    6633                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_INTRRX")
    6634                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    6635                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6636              $C$DW$539       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$20)
    6638                      .dwattr $C$DW$539, DW_AT_name("INTRTXE")
    6639                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_INTRTXE")
    6640                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    6641                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6642              $C$DW$540       .dwtag  DW_TAG_member
    6643                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  159

    6644                      .dwattr $C$DW$540, DW_AT_name("RSVD22")
    6645                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_RSVD22")
    6646                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    6647                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6648              $C$DW$541       .dwtag  DW_TAG_member
    6649                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
    6650                      .dwattr $C$DW$541, DW_AT_name("INTRRXE")
    6651                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_INTRRXE")
    6652                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    6653                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6654              $C$DW$542       .dwtag  DW_TAG_member
    6655                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$20)
    6656                      .dwattr $C$DW$542, DW_AT_name("INTRUSB_INTRUSBE")
    6657                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    6658                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    6659                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6660              $C$DW$543       .dwtag  DW_TAG_member
    6661                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$21)
    6662                      .dwattr $C$DW$543, DW_AT_name("RSVD23")
    6663                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_RSVD23")
    6664                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    6665                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6666              $C$DW$544       .dwtag  DW_TAG_member
    6667                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
    6668                      .dwattr $C$DW$544, DW_AT_name("FRAME")
    6669                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_FRAME")
    6670                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    6671                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6672              $C$DW$545       .dwtag  DW_TAG_member
    6673                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
    6674                      .dwattr $C$DW$545, DW_AT_name("INDEX_TESTMODE")
    6675                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    6676                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    6677                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6678              $C$DW$546       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$21)
    6680                      .dwattr $C$DW$546, DW_AT_name("RSVD24")
    6681                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_RSVD24")
    6682                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    6683                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6684              $C$DW$547       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
    6686                      .dwattr $C$DW$547, DW_AT_name("TXMAXP_INDX")
    6687                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    6688                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    6689                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6690              $C$DW$548       .dwtag  DW_TAG_member
    6691                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$20)
    6692                      .dwattr $C$DW$548, DW_AT_name("PERI_CSR0_INDX")
    6693                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    6694                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    6695                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6696              $C$DW$549       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$21)
    6698                      .dwattr $C$DW$549, DW_AT_name("RSVD25")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  160

    6699                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_RSVD25")
    6700                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    6701                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6702              $C$DW$550       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$20)
    6704                      .dwattr $C$DW$550, DW_AT_name("RXMAXP_INDX")
    6705                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    6706                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    6707                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6708              $C$DW$551       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$20)
    6710                      .dwattr $C$DW$551, DW_AT_name("PERI_RXCSR_INDX")
    6711                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    6712                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    6713                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6714              $C$DW$552       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$21)
    6716                      .dwattr $C$DW$552, DW_AT_name("RSVD26")
    6717                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_RSVD26")
    6718                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    6719                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6720              $C$DW$553       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$20)
    6722                      .dwattr $C$DW$553, DW_AT_name("COUNT0_INDX")
    6723                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_COUNT0_INDX")
    6724                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    6725                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6726              $C$DW$554       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$36)
    6728                      .dwattr $C$DW$554, DW_AT_name("RSVD27")
    6729                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_RSVD27")
    6730                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    6731                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6732              $C$DW$555       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$20)
    6734                      .dwattr $C$DW$555, DW_AT_name("CONFIGDATA_INDX")
    6735                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    6736                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    6737                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6738              $C$DW$556       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$21)
    6740                      .dwattr $C$DW$556, DW_AT_name("RSVD28")
    6741                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_RSVD28")
    6742                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    6743                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6744              $C$DW$557       .dwtag  DW_TAG_member
    6745                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$20)
    6746                      .dwattr $C$DW$557, DW_AT_name("FIFO0R1")
    6747                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_FIFO0R1")
    6748                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    6749                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6750              $C$DW$558       .dwtag  DW_TAG_member
    6751                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$20)
    6752                      .dwattr $C$DW$558, DW_AT_name("FIFO0R2")
    6753                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_FIFO0R2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  161

    6754                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    6755                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6756              $C$DW$559       .dwtag  DW_TAG_member
    6757                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$21)
    6758                      .dwattr $C$DW$559, DW_AT_name("RSVD29")
    6759                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_RSVD29")
    6760                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    6761                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6762              $C$DW$560       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$20)
    6764                      .dwattr $C$DW$560, DW_AT_name("FIFO1R1")
    6765                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_FIFO1R1")
    6766                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    6767                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6768              $C$DW$561       .dwtag  DW_TAG_member
    6769                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
    6770                      .dwattr $C$DW$561, DW_AT_name("FIFO1R2")
    6771                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_FIFO1R2")
    6772                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    6773                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6774              $C$DW$562       .dwtag  DW_TAG_member
    6775                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
    6776                      .dwattr $C$DW$562, DW_AT_name("RSVD30")
    6777                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_RSVD30")
    6778                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    6779                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6780              $C$DW$563       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$20)
    6782                      .dwattr $C$DW$563, DW_AT_name("FIFO2R1")
    6783                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_FIFO2R1")
    6784                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    6785                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6786              $C$DW$564       .dwtag  DW_TAG_member
    6787                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$20)
    6788                      .dwattr $C$DW$564, DW_AT_name("FIFO2R2")
    6789                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_FIFO2R2")
    6790                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    6791                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6792              $C$DW$565       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$21)
    6794                      .dwattr $C$DW$565, DW_AT_name("RSVD31")
    6795                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_RSVD31")
    6796                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    6797                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6798              $C$DW$566       .dwtag  DW_TAG_member
    6799                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    6800                      .dwattr $C$DW$566, DW_AT_name("FIFO3R1")
    6801                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_FIFO3R1")
    6802                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    6803                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6804              $C$DW$567       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$20)
    6806                      .dwattr $C$DW$567, DW_AT_name("FIFO3R2")
    6807                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_FIFO3R2")
    6808                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  162

    6809                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6810              $C$DW$568       .dwtag  DW_TAG_member
    6811                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$21)
    6812                      .dwattr $C$DW$568, DW_AT_name("RSVD32")
    6813                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_RSVD32")
    6814                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    6815                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6816              $C$DW$569       .dwtag  DW_TAG_member
    6817                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
    6818                      .dwattr $C$DW$569, DW_AT_name("FIFO4R1")
    6819                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_FIFO4R1")
    6820                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    6821                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6822              $C$DW$570       .dwtag  DW_TAG_member
    6823                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$20)
    6824                      .dwattr $C$DW$570, DW_AT_name("FIFO4R2")
    6825                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_FIFO4R2")
    6826                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    6827                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6828              $C$DW$571       .dwtag  DW_TAG_member
    6829                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$37)
    6830                      .dwattr $C$DW$571, DW_AT_name("RSVD33")
    6831                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_RSVD33")
    6832                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    6833                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6834              $C$DW$572       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$20)
    6836                      .dwattr $C$DW$572, DW_AT_name("DEVCTL")
    6837                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_DEVCTL")
    6838                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    6839                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6840              $C$DW$573       .dwtag  DW_TAG_member
    6841                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$20)
    6842                      .dwattr $C$DW$573, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    6843                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    6844                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    6845                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6846              $C$DW$574       .dwtag  DW_TAG_member
    6847                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$21)
    6848                      .dwattr $C$DW$574, DW_AT_name("RSVD34")
    6849                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_RSVD34")
    6850                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    6851                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6852              $C$DW$575       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    6854                      .dwattr $C$DW$575, DW_AT_name("TXFIFOADDR")
    6855                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_TXFIFOADDR")
    6856                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    6857                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$576       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$20)
    6860                      .dwattr $C$DW$576, DW_AT_name("RXFIFOADDR")
    6861                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RXFIFOADDR")
    6862                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    6863                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  163

    6864              $C$DW$577       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$25)
    6866                      .dwattr $C$DW$577, DW_AT_name("RSVD35")
    6867                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_RSVD35")
    6868                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    6869                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6870              $C$DW$578       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    6872                      .dwattr $C$DW$578, DW_AT_name("HWVERS")
    6873                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_HWVERS")
    6874                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    6875                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$579       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$38)
    6878                      .dwattr $C$DW$579, DW_AT_name("RSVD37")
    6879                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD37")
    6880                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    6881                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$580       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$40)
    6884                      .dwattr $C$DW$580, DW_AT_name("EPTRG")
    6885                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_EPTRG")
    6886                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    6887                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$581       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$41)
    6890                      .dwattr $C$DW$581, DW_AT_name("RSVD38")
    6891                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_RSVD38")
    6892                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    6893                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6894              $C$DW$582       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$20)
    6896                      .dwattr $C$DW$582, DW_AT_name("PERI_CSR0")
    6897                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_PERI_CSR0")
    6898                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    6899                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6900              $C$DW$583       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$25)
    6902                      .dwattr $C$DW$583, DW_AT_name("RSVD39")
    6903                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_RSVD39")
    6904                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    6905                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6906              $C$DW$584       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    6908                      .dwattr $C$DW$584, DW_AT_name("COUNT0")
    6909                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_COUNT0")
    6910                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    6911                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6912              $C$DW$585       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$36)
    6914                      .dwattr $C$DW$585, DW_AT_name("RSVD40")
    6915                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD40")
    6916                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    6917                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6918              $C$DW$586       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  164

    6919                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    6920                      .dwattr $C$DW$586, DW_AT_name("CONFIGDATA")
    6921                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_CONFIGDATA")
    6922                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    6923                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$587       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    6926                      .dwattr $C$DW$587, DW_AT_name("RSVD42")
    6927                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_RSVD42")
    6928                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    6929                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6930              $C$DW$588       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$43)
    6932                      .dwattr $C$DW$588, DW_AT_name("EPCSR")
    6933                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_EPCSR")
    6934                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    6935                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6936              $C$DW$589       .dwtag  DW_TAG_member
    6937                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$44)
    6938                      .dwattr $C$DW$589, DW_AT_name("RSVD43")
    6939                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_RSVD43")
    6940                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    6941                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6942              $C$DW$590       .dwtag  DW_TAG_member
    6943                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    6944                      .dwattr $C$DW$590, DW_AT_name("DMAREVID1")
    6945                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_DMAREVID1")
    6946                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    6947                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6948              $C$DW$591       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$20)
    6950                      .dwattr $C$DW$591, DW_AT_name("DMAREVID2")
    6951                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_DMAREVID2")
    6952                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    6953                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6954              $C$DW$592       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$21)
    6956                      .dwattr $C$DW$592, DW_AT_name("RSVD44")
    6957                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_RSVD44")
    6958                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    6959                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6960              $C$DW$593       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$20)
    6962                      .dwattr $C$DW$593, DW_AT_name("TDFDQ")
    6963                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_TDFDQ")
    6964                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    6965                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$594       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$33)
    6968                      .dwattr $C$DW$594, DW_AT_name("RSVD45")
    6969                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_RSVD45")
    6970                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    6971                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6972              $C$DW$595       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_dma_example.asm                                              PAGE  165

    6974                      .dwattr $C$DW$595, DW_AT_name("DMAEMU")
    6975                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_DMAEMU")
    6976                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    6977                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6978              $C$DW$596       .dwtag  DW_TAG_member
    6979                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$45)
    6980                      .dwattr $C$DW$596, DW_AT_name("RSVD47")
    6981                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_RSVD47")
    6982                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    6983                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6984              $C$DW$597       .dwtag  DW_TAG_member
    6985                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$47)
    6986                      .dwattr $C$DW$597, DW_AT_name("CHANNEL")
    6987                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_CHANNEL")
    6988                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    6989                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6990              $C$DW$598       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$48)
    6992                      .dwattr $C$DW$598, DW_AT_name("RSVD48")
    6993                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_RSVD48")
    6994                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
    6995                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6996              $C$DW$599       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    6998                      .dwattr $C$DW$599, DW_AT_name("DMA_SCHED_CTRL1")
    6999                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
    7000                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
    7001                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    7002              $C$DW$600       .dwtag  DW_TAG_member
    7003                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$20)
    7004                      .dwattr $C$DW$600, DW_AT_name("DMA_SCHED_CTRL2")
    7005                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
    7006                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
    7007                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    7008              $C$DW$601       .dwtag  DW_TAG_member
    7009                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$49)
    7010                      .dwattr $C$DW$601, DW_AT_name("RSVD50")
    7011                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_RSVD50")
    7012                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
    7013                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    7014              $C$DW$602       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$51)
    7016                      .dwattr $C$DW$602, DW_AT_name("CDMASCHETBLWORD")
    7017                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
    7018                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
    7019                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
