TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE    1

    3936              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:36 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2303              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAPingPongMode")
    2304                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2305                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2306              
    2307              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    2308                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2309              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
    2310              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
    2311                      .dwendtag $C$DW$T$43
    2312              
    2313              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
    2314                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2315                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2316              
    2317              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    2318                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2319              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   68

    2320              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
    2321              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
    2322              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
    2323              $C$DW$206       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    2324                      .dwendtag $C$DW$T$45
    2325              
    2326              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    2327                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2328                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2329              
    2330              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    2331                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2332              $C$DW$207       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    2333              $C$DW$208       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    2334              $C$DW$209       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    2335              $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    2336              $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    2337              $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    2338              $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    2339              $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    2340              $C$DW$215       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    2341              $C$DW$216       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    2342              $C$DW$217       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    2343              $C$DW$218       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    2344              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    2345              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    2346              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    2347              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    2348              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    2349              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    2350              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    2351              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    2352              $C$DW$227       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    2353              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    2354                      .dwendtag $C$DW$T$47
    2355              
    2356              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    2357                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2358                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2359              
    2360              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2361                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    2362              $C$DW$229       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2364                      .dwattr $C$DW$229, DW_AT_name("DMACH0SSAL")
    2365                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2366                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2367                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2368              $C$DW$230       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2370                      .dwattr $C$DW$230, DW_AT_name("DMACH0SSAU")
    2371                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2372                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2373                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2374              $C$DW$231       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   69

    2375                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2376                      .dwattr $C$DW$231, DW_AT_name("DMACH0DSAL")
    2377                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2378                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2379                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$232       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2382                      .dwattr $C$DW$232, DW_AT_name("DMACH0DSAU")
    2383                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DMACH0DSAU")
    2384                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2385                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$233       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2388                      .dwattr $C$DW$233, DW_AT_name("DMACH0TCR1")
    2389                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2390                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2391                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2392              $C$DW$234       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2394                      .dwattr $C$DW$234, DW_AT_name("DMACH0TCR2")
    2395                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2396                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2397                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2398              $C$DW$235       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$21)
    2400                      .dwattr $C$DW$235, DW_AT_name("RSVD0")
    2401                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_RSVD0")
    2402                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2403                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2404              $C$DW$236       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2406                      .dwattr $C$DW$236, DW_AT_name("DMACH1SSAL")
    2407                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2408                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2409                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2410              $C$DW$237       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    2412                      .dwattr $C$DW$237, DW_AT_name("DMACH1SSAU")
    2413                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2414                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2415                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2416              $C$DW$238       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2418                      .dwattr $C$DW$238, DW_AT_name("DMACH1DSAL")
    2419                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DMACH1DSAL")
    2420                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2421                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2422              $C$DW$239       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2424                      .dwattr $C$DW$239, DW_AT_name("DMACH1DSAU")
    2425                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DMACH1DSAU")
    2426                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2427                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$240       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   70

    2430                      .dwattr $C$DW$240, DW_AT_name("DMACH1TCR1")
    2431                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DMACH1TCR1")
    2432                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2433                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2434              $C$DW$241       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2436                      .dwattr $C$DW$241, DW_AT_name("DMACH1TCR2")
    2437                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMACH1TCR2")
    2438                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2439                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$242       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
    2442                      .dwattr $C$DW$242, DW_AT_name("RSVD1")
    2443                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD1")
    2444                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2445                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2446              $C$DW$243       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2448                      .dwattr $C$DW$243, DW_AT_name("DMACH2SSAL")
    2449                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2450                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2451                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2452              $C$DW$244       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2454                      .dwattr $C$DW$244, DW_AT_name("DMACH2SSAU")
    2455                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DMACH2SSAU")
    2456                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2457                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$245       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2460                      .dwattr $C$DW$245, DW_AT_name("DMACH2DSAL")
    2461                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2462                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2463                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$246       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2466                      .dwattr $C$DW$246, DW_AT_name("DMACH2DSAU")
    2467                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2468                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2469                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$247       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2472                      .dwattr $C$DW$247, DW_AT_name("DMACH2TCR1")
    2473                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2474                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2475                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2476              $C$DW$248       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2478                      .dwattr $C$DW$248, DW_AT_name("DMACH2TCR2")
    2479                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2480                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2481                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$249       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$21)
    2484                      .dwattr $C$DW$249, DW_AT_name("RSVD2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   71

    2485                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_RSVD2")
    2486                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2487                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$250       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2490                      .dwattr $C$DW$250, DW_AT_name("DMACH3SSAL")
    2491                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2492                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2493                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$251       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2496                      .dwattr $C$DW$251, DW_AT_name("DMACH3SSAU")
    2497                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2498                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2499                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2500              $C$DW$252       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2502                      .dwattr $C$DW$252, DW_AT_name("DMACH3DSAL")
    2503                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2504                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2505                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$253       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2508                      .dwattr $C$DW$253, DW_AT_name("DMACH3DSAU")
    2509                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2510                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2511                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$254       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2514                      .dwattr $C$DW$254, DW_AT_name("DMACH3TCR1")
    2515                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2516                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2517                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$255       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2520                      .dwattr $C$DW$255, DW_AT_name("DMACH3TCR2")
    2521                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2522                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2523                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2524                      .dwendtag $C$DW$T$22
    2525              
    2526              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2527                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    2528                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2529              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2530                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$23)
    2531              $C$DW$257       .dwtag  DW_TAG_TI_ioport_type
    2532                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$256)
    2533              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2534                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$257)
    2535              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2536                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2537                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    2538              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2539                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   72

    2540                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2541              
    2542              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2543                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    2544              $C$DW$258       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$26)
    2546                      .dwattr $C$DW$258, DW_AT_name("dmaRegs")
    2547                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_dmaRegs")
    2548                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$259       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$28)
    2552                      .dwattr $C$DW$259, DW_AT_name("chanNum")
    2553                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_chanNum")
    2554                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2555                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$260       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$30)
    2558                      .dwattr $C$DW$260, DW_AT_name("dmaInstNum")
    2559                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_dmaInstNum")
    2560                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2561                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$261       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
    2564                      .dwattr $C$DW$261, DW_AT_name("isChanFree")
    2565                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_isChanFree")
    2566                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2567                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$262       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$33)
    2570                      .dwattr $C$DW$262, DW_AT_name("chanDir")
    2571                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_chanDir")
    2572                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2573                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$263       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$35)
    2576                      .dwattr $C$DW$263, DW_AT_name("trigger")
    2577                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_trigger")
    2578                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2579                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$264       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$37)
    2582                      .dwattr $C$DW$264, DW_AT_name("trfType")
    2583                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_trfType")
    2584                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2585                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$265       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$39)
    2588                      .dwattr $C$DW$265, DW_AT_name("dmaInt")
    2589                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_dmaInt")
    2590                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2591                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$266       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$31)
    2594                      .dwattr $C$DW$266, DW_AT_name("pingPongEnabled")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   73

    2595                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_pingPongEnabled")
    2596                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2597                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2598                      .dwendtag $C$DW$T$40
    2599              
    2600              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    2601                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    2602                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2603              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2604                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2605                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    2606              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    2607                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2608                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2609              
    2610              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2611                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
    2612              $C$DW$267       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$42)
    2614                      .dwattr $C$DW$267, DW_AT_name("pingPongMode")
    2615                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_pingPongMode")
    2616                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$268       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$44)
    2620                      .dwattr $C$DW$268, DW_AT_name("autoMode")
    2621                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_autoMode")
    2622                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2623                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$269       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$46)
    2626                      .dwattr $C$DW$269, DW_AT_name("burstLen")
    2627                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_burstLen")
    2628                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2629                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$270       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$35)
    2632                      .dwattr $C$DW$270, DW_AT_name("trigger")
    2633                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_trigger")
    2634                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2635                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$271       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$48)
    2638                      .dwattr $C$DW$271, DW_AT_name("dmaEvt")
    2639                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_dmaEvt")
    2640                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2641                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$272       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$39)
    2644                      .dwattr $C$DW$272, DW_AT_name("dmaInt")
    2645                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_dmaInt")
    2646                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2647                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$273       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$33)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   74

    2650                      .dwattr $C$DW$273, DW_AT_name("chanDir")
    2651                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_chanDir")
    2652                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2653                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$274       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$37)
    2656                      .dwattr $C$DW$274, DW_AT_name("trfType")
    2657                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_trfType")
    2658                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2659                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$275       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$275, DW_AT_name("dataLen")
    2663                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_dataLen")
    2664                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2665                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$276       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$49)
    2668                      .dwattr $C$DW$276, DW_AT_name("srcAddr")
    2669                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_srcAddr")
    2670                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2671                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$277       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$49)
    2674                      .dwattr $C$DW$277, DW_AT_name("destAddr")
    2675                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_destAddr")
    2676                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2677                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2678                      .dwendtag $C$DW$T$50
    2679              
    2680              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2681                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    2682                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2683              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    2684                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2685                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    2686              
    2687              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2688                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x39)
    2689              $C$DW$278       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2691                      .dwattr $C$DW$278, DW_AT_name("ICOAR")
    2692                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_ICOAR")
    2693                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$279       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$51)
    2697                      .dwattr $C$DW$279, DW_AT_name("RSVD0")
    2698                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD0")
    2699                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2700                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2701              $C$DW$280       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2703                      .dwattr $C$DW$280, DW_AT_name("ICIMR")
    2704                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ICIMR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   75

    2705                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2706                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2707              $C$DW$281       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$51)
    2709                      .dwattr $C$DW$281, DW_AT_name("RSVD1")
    2710                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_RSVD1")
    2711                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2712                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2713              $C$DW$282       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2715                      .dwattr $C$DW$282, DW_AT_name("ICSTR")
    2716                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_ICSTR")
    2717                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2718                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2719              $C$DW$283       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$51)
    2721                      .dwattr $C$DW$283, DW_AT_name("RSVD2")
    2722                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_RSVD2")
    2723                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2724                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2725              $C$DW$284       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2727                      .dwattr $C$DW$284, DW_AT_name("ICCLKL")
    2728                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_ICCLKL")
    2729                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2730                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2731              $C$DW$285       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$51)
    2733                      .dwattr $C$DW$285, DW_AT_name("RSVD3")
    2734                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RSVD3")
    2735                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2736                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2737              $C$DW$286       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2739                      .dwattr $C$DW$286, DW_AT_name("ICCLKH")
    2740                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_ICCLKH")
    2741                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2742                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2743              $C$DW$287       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$51)
    2745                      .dwattr $C$DW$287, DW_AT_name("RSVD4")
    2746                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD4")
    2747                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2748                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2749              $C$DW$288       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2751                      .dwattr $C$DW$288, DW_AT_name("ICCNT")
    2752                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ICCNT")
    2753                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2754                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2755              $C$DW$289       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$51)
    2757                      .dwattr $C$DW$289, DW_AT_name("RSVD5")
    2758                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_RSVD5")
    2759                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   76

    2760                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2761              $C$DW$290       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2763                      .dwattr $C$DW$290, DW_AT_name("ICDRR")
    2764                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_ICDRR")
    2765                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2766                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2767              $C$DW$291       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$51)
    2769                      .dwattr $C$DW$291, DW_AT_name("RSVD6")
    2770                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD6")
    2771                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2772                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2773              $C$DW$292       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2775                      .dwattr $C$DW$292, DW_AT_name("ICSAR")
    2776                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_ICSAR")
    2777                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2778                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2779              $C$DW$293       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$51)
    2781                      .dwattr $C$DW$293, DW_AT_name("RSVD7")
    2782                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD7")
    2783                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2784                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2785              $C$DW$294       .dwtag  DW_TAG_member
    2786                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2787                      .dwattr $C$DW$294, DW_AT_name("ICDXR")
    2788                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_ICDXR")
    2789                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2790                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2791              $C$DW$295       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$51)
    2793                      .dwattr $C$DW$295, DW_AT_name("RSVD8")
    2794                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD8")
    2795                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2796                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2797              $C$DW$296       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2799                      .dwattr $C$DW$296, DW_AT_name("ICMDR")
    2800                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_ICMDR")
    2801                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2802                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2803              $C$DW$297       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$51)
    2805                      .dwattr $C$DW$297, DW_AT_name("RSVD9")
    2806                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD9")
    2807                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2808                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2809              $C$DW$298       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2811                      .dwattr $C$DW$298, DW_AT_name("ICIVR")
    2812                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_ICIVR")
    2813                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2814                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   77

    2815              $C$DW$299       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$51)
    2817                      .dwattr $C$DW$299, DW_AT_name("RSVD10")
    2818                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD10")
    2819                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2820                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2821              $C$DW$300       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2823                      .dwattr $C$DW$300, DW_AT_name("ICEMDR")
    2824                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_ICEMDR")
    2825                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2826                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2827              $C$DW$301       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$51)
    2829                      .dwattr $C$DW$301, DW_AT_name("RSVD11")
    2830                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD11")
    2831                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2832                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2833              $C$DW$302       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    2835                      .dwattr $C$DW$302, DW_AT_name("ICPSC")
    2836                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_ICPSC")
    2837                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2838                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2839              $C$DW$303       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$51)
    2841                      .dwattr $C$DW$303, DW_AT_name("RSVD12")
    2842                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_RSVD12")
    2843                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2844                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2845              $C$DW$304       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2847                      .dwattr $C$DW$304, DW_AT_name("ICPID1")
    2848                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ICPID1")
    2849                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2850                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2851              $C$DW$305       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$51)
    2853                      .dwattr $C$DW$305, DW_AT_name("RSVD13")
    2854                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD13")
    2855                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2856                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2857              $C$DW$306       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2859                      .dwattr $C$DW$306, DW_AT_name("ICPID2")
    2860                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_ICPID2")
    2861                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2862                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2863                      .dwendtag $C$DW$T$52
    2864              
    2865              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
    2866                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$52)
    2867                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2868              $C$DW$307       .dwtag  DW_TAG_TI_far_type
    2869                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$58)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   78

    2870              $C$DW$308       .dwtag  DW_TAG_TI_ioport_type
    2871                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$307)
    2872              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    2873                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$308)
    2874              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2875                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2876                      .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    2877              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
    2878                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2879                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2880              
    2881              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2882                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x48)
    2883              $C$DW$309       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    2885                      .dwattr $C$DW$309, DW_AT_name("EBSR")
    2886                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_EBSR")
    2887                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2888                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2889              $C$DW$310       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2891                      .dwattr $C$DW$310, DW_AT_name("RSVD0")
    2892                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_RSVD0")
    2893                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2894                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2895              $C$DW$311       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2897                      .dwattr $C$DW$311, DW_AT_name("PCGCR1")
    2898                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_PCGCR1")
    2899                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2900                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2901              $C$DW$312       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    2903                      .dwattr $C$DW$312, DW_AT_name("PCGCR2")
    2904                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_PCGCR2")
    2905                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2906                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$313       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    2909                      .dwattr $C$DW$313, DW_AT_name("PSRCR")
    2910                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_PSRCR")
    2911                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2912                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2913              $C$DW$314       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    2915                      .dwattr $C$DW$314, DW_AT_name("PRCR")
    2916                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_PRCR")
    2917                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2918                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2919              $C$DW$315       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$53)
    2921                      .dwattr $C$DW$315, DW_AT_name("RSVD1")
    2922                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD1")
    2923                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2924                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   79

    2925              $C$DW$316       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2927                      .dwattr $C$DW$316, DW_AT_name("TIAFR")
    2928                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_TIAFR")
    2929                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2930                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2931              $C$DW$317       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    2933                      .dwattr $C$DW$317, DW_AT_name("RSVD2")
    2934                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD2")
    2935                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2936                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2937              $C$DW$318       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    2939                      .dwattr $C$DW$318, DW_AT_name("ODSCR")
    2940                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_ODSCR")
    2941                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2942                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2943              $C$DW$319       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    2945                      .dwattr $C$DW$319, DW_AT_name("PDINHIBR1")
    2946                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_PDINHIBR1")
    2947                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2948                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$320       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    2951                      .dwattr $C$DW$320, DW_AT_name("PDINHIBR2")
    2952                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_PDINHIBR2")
    2953                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2954                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2955              $C$DW$321       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    2957                      .dwattr $C$DW$321, DW_AT_name("PDINHIBR3")
    2958                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_PDINHIBR3")
    2959                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2960                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2961              $C$DW$322       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    2963                      .dwattr $C$DW$322, DW_AT_name("DMA0CESR1")
    2964                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_DMA0CESR1")
    2965                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2966                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$323       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    2969                      .dwattr $C$DW$323, DW_AT_name("DMA0CESR2")
    2970                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_DMA0CESR2")
    2971                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2972                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$324       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    2975                      .dwattr $C$DW$324, DW_AT_name("DMA1CESR1")
    2976                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_DMA1CESR1")
    2977                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2978                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2979              $C$DW$325       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   80

    2980                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    2981                      .dwattr $C$DW$325, DW_AT_name("DMA1CESR2")
    2982                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_DMA1CESR2")
    2983                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2984                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2985              $C$DW$326       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    2987                      .dwattr $C$DW$326, DW_AT_name("SDRAMCCR")
    2988                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_SDRAMCCR")
    2989                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2990                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2991              $C$DW$327       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    2993                      .dwattr $C$DW$327, DW_AT_name("CCR2")
    2994                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_CCR2")
    2995                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2996                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2997              $C$DW$328       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    2999                      .dwattr $C$DW$328, DW_AT_name("CGCR1")
    3000                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_CGCR1")
    3001                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3002                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3003              $C$DW$329       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    3005                      .dwattr $C$DW$329, DW_AT_name("CGICR")
    3006                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_CGICR")
    3007                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3008                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3009              $C$DW$330       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    3011                      .dwattr $C$DW$330, DW_AT_name("CGCR2")
    3012                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_CGCR2")
    3013                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3014                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$331       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    3017                      .dwattr $C$DW$331, DW_AT_name("CGOCR")
    3018                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_CGOCR")
    3019                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3020                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3021              $C$DW$332       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    3023                      .dwattr $C$DW$332, DW_AT_name("CCSSR")
    3024                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_CCSSR")
    3025                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3026                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3027              $C$DW$333       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    3029                      .dwattr $C$DW$333, DW_AT_name("RSVD3")
    3030                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD3")
    3031                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3032                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$334       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   81

    3035                      .dwattr $C$DW$334, DW_AT_name("ECDR")
    3036                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_ECDR")
    3037                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3038                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3039              $C$DW$335       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    3041                      .dwattr $C$DW$335, DW_AT_name("RSVD4")
    3042                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD4")
    3043                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3044                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3045              $C$DW$336       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    3047                      .dwattr $C$DW$336, DW_AT_name("RAMSLPMDCNTLR1")
    3048                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    3049                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3050                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3051              $C$DW$337       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$20)
    3053                      .dwattr $C$DW$337, DW_AT_name("RSVD5")
    3054                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD5")
    3055                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3056                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$338       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    3059                      .dwattr $C$DW$338, DW_AT_name("RAMSLPMDCNTLR2")
    3060                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    3061                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3062                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3063              $C$DW$339       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    3065                      .dwattr $C$DW$339, DW_AT_name("RAMSLPMDCNTLR3")
    3066                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    3067                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3068                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$340       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
    3071                      .dwattr $C$DW$340, DW_AT_name("RAMSLPMDCNTLR4")
    3072                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    3073                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3074                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3075              $C$DW$341       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    3077                      .dwattr $C$DW$341, DW_AT_name("RAMSLPMDCNTLR5")
    3078                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    3079                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3080                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3081              $C$DW$342       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$54)
    3083                      .dwattr $C$DW$342, DW_AT_name("RSVD6")
    3084                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_RSVD6")
    3085                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3086                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$343       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    3089                      .dwattr $C$DW$343, DW_AT_name("DMAIFR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   82

    3090                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_DMAIFR")
    3091                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3092                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$344       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    3095                      .dwattr $C$DW$344, DW_AT_name("DMAIER")
    3096                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_DMAIER")
    3097                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3098                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$345       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3101                      .dwattr $C$DW$345, DW_AT_name("USBSCR")
    3102                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_USBSCR")
    3103                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3104                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$346       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    3107                      .dwattr $C$DW$346, DW_AT_name("ESCR")
    3108                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ESCR")
    3109                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    3110                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3111              $C$DW$347       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$54)
    3113                      .dwattr $C$DW$347, DW_AT_name("RSVD7")
    3114                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_RSVD7")
    3115                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3116                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3117              $C$DW$348       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3119                      .dwattr $C$DW$348, DW_AT_name("DMA2CESR1")
    3120                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_DMA2CESR1")
    3121                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3122                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$349       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3125                      .dwattr $C$DW$349, DW_AT_name("DMA2CESR2")
    3126                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_DMA2CESR2")
    3127                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3128                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$350       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    3131                      .dwattr $C$DW$350, DW_AT_name("DMA3CESR1")
    3132                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_DMA3CESR1")
    3133                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3134                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$351       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    3137                      .dwattr $C$DW$351, DW_AT_name("DMA3CESR2")
    3138                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_DMA3CESR2")
    3139                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3140                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$352       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    3143                      .dwattr $C$DW$352, DW_AT_name("CLKSTOP")
    3144                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_CLKSTOP")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   83

    3145                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3146                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$353       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$55)
    3149                      .dwattr $C$DW$353, DW_AT_name("RSVD8")
    3150                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RSVD8")
    3151                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    3152                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$354       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    3155                      .dwattr $C$DW$354, DW_AT_name("DIEIDR0")
    3156                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_DIEIDR0")
    3157                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3158                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$355       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    3161                      .dwattr $C$DW$355, DW_AT_name("DIEIDR1")
    3162                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_DIEIDR1")
    3163                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3164                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$356       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    3167                      .dwattr $C$DW$356, DW_AT_name("DIEIDR2")
    3168                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_DIEIDR2")
    3169                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3170                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$357       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3173                      .dwattr $C$DW$357, DW_AT_name("DIEIDR3")
    3174                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_DIEIDR3")
    3175                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3176                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$358       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    3179                      .dwattr $C$DW$358, DW_AT_name("DIEIDR4")
    3180                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_DIEIDR4")
    3181                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3182                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$359       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    3185                      .dwattr $C$DW$359, DW_AT_name("DIEIDR5")
    3186                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_DIEIDR5")
    3187                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3188                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$360       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    3191                      .dwattr $C$DW$360, DW_AT_name("DIEIDR6")
    3192                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_DIEIDR6")
    3193                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3194                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$361       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    3197                      .dwattr $C$DW$361, DW_AT_name("DIEIDR7")
    3198                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DIEIDR7")
    3199                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   84

    3200                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3201                      .dwendtag $C$DW$T$56
    3202              
    3203              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    3204                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$56)
    3205                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3206              $C$DW$362       .dwtag  DW_TAG_TI_far_type
    3207                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$62)
    3208              $C$DW$363       .dwtag  DW_TAG_TI_ioport_type
    3209                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$362)
    3210              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    3211                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$363)
    3212              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    3213                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    3214                      .dwattr $C$DW$T$64, DW_AT_address_class(0x10)
    3215              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    3216                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3217                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3218              
    3219              $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    3220                      .dwattr $C$DW$T$71, DW_AT_name("CSL_I2cAddrMode")
    3221                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x01)
    3222              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
    3223              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
    3224                      .dwendtag $C$DW$T$71
    3225              
    3226              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
    3227                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3228                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3229              
    3230              $C$DW$T$73      .dwtag  DW_TAG_enumeration_type
    3231                      .dwattr $C$DW$T$73, DW_AT_name("CSL_I2cBitCount")
    3232                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    3233              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
    3234              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
    3235              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
    3236              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
    3237              $C$DW$370       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
    3238              $C$DW$371       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
    3239              $C$DW$372       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
    3240              $C$DW$373       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
    3241                      .dwendtag $C$DW$T$73
    3242              
    3243              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
    3244                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3245                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3246              
    3247              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3248                      .dwattr $C$DW$T$57, DW_AT_name("CSL_I2cConfig")
    3249                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x09)
    3250              $C$DW$374       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    3252                      .dwattr $C$DW$374, DW_AT_name("icoar")
    3253                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_icoar")
    3254                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   85

    3255                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3256              $C$DW$375       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    3258                      .dwattr $C$DW$375, DW_AT_name("icimr")
    3259                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_icimr")
    3260                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3261                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$376       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    3264                      .dwattr $C$DW$376, DW_AT_name("icclkl")
    3265                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_icclkl")
    3266                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3267                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3268              $C$DW$377       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    3270                      .dwattr $C$DW$377, DW_AT_name("icclkh")
    3271                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_icclkh")
    3272                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3273                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$378       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    3276                      .dwattr $C$DW$378, DW_AT_name("iccnt")
    3277                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_iccnt")
    3278                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3279                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$379       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    3282                      .dwattr $C$DW$379, DW_AT_name("icsar")
    3283                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_icsar")
    3284                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3285                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$380       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    3288                      .dwattr $C$DW$380, DW_AT_name("icmdr")
    3289                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_icmdr")
    3290                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3291                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$381       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    3294                      .dwattr $C$DW$381, DW_AT_name("icemdr")
    3295                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_icemdr")
    3296                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3297                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$382       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    3300                      .dwattr $C$DW$382, DW_AT_name("icpsc")
    3301                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_icpsc")
    3302                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3303                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3304                      .dwendtag $C$DW$T$57
    3305              
    3306              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
    3307                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$57)
    3308                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3309              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   86

    3310                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    3311                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    3312              
    3313              $C$DW$T$77      .dwtag  DW_TAG_enumeration_type
    3314                      .dwattr $C$DW$T$77, DW_AT_name("CSL_I2cFreeMode")
    3315                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x01)
    3316              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
    3317              $C$DW$384       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
    3318                      .dwendtag $C$DW$T$77
    3319              
    3320              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
    3321                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    3322                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3323              
    3324              $C$DW$T$75      .dwtag  DW_TAG_enumeration_type
    3325                      .dwattr $C$DW$T$75, DW_AT_name("CSL_I2cLoopback")
    3326                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    3327              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
    3328              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
    3329                      .dwendtag $C$DW$T$75
    3330              
    3331              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
    3332                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3333                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3334              
    3335              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3336                      .dwattr $C$DW$T$70, DW_AT_name("CSL_I2cObj")
    3337                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x10)
    3338              $C$DW$387       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$61)
    3340                      .dwattr $C$DW$387, DW_AT_name("i2cRegs")
    3341                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_i2cRegs")
    3342                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3343                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3344              $C$DW$388       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$65)
    3346                      .dwattr $C$DW$388, DW_AT_name("sysCtrlRegs")
    3347                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_sysCtrlRegs")
    3348                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3349                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3350              $C$DW$389       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$69)
    3352                      .dwattr $C$DW$389, DW_AT_name("I2C_isrDispatchTable")
    3353                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_I2C_isrDispatchTable")
    3354                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3355                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3356                      .dwendtag $C$DW$T$70
    3357              
    3358              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cObj")
    3359                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$70)
    3360                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    3361              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    3362                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    3363                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    3364              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("pI2cHandle")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   87

    3365                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    3366                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3367              
    3368              $C$DW$T$79      .dwtag  DW_TAG_enumeration_type
    3369                      .dwattr $C$DW$T$79, DW_AT_name("CSL_I2cRepeatMode")
    3370                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
    3371              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
    3372              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
    3373                      .dwendtag $C$DW$T$79
    3374              
    3375              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
    3376                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    3377                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3378              
    3379              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    3380                      .dwattr $C$DW$T$81, DW_AT_name("CSL_I2cSetup")
    3381                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    3382              $C$DW$392       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$72)
    3384                      .dwattr $C$DW$392, DW_AT_name("addrMode")
    3385                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_addrMode")
    3386                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3387                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$393       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$74)
    3390                      .dwattr $C$DW$393, DW_AT_name("bitCount")
    3391                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_bitCount")
    3392                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3393                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$394       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$76)
    3396                      .dwattr $C$DW$394, DW_AT_name("loopBack")
    3397                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_loopBack")
    3398                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3399                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$395       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$78)
    3402                      .dwattr $C$DW$395, DW_AT_name("freeMode")
    3403                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_freeMode")
    3404                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3405                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$396       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$80)
    3408                      .dwattr $C$DW$396, DW_AT_name("repeatMode")
    3409                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_repeatMode")
    3410                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3411                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$397       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    3414                      .dwattr $C$DW$397, DW_AT_name("ownAddr")
    3415                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_ownAddr")
    3416                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3417                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$398       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$49)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   88

    3420                      .dwattr $C$DW$398, DW_AT_name("sysInputClk")
    3421                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_sysInputClk")
    3422                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3423                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$399       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$49)
    3426                      .dwattr $C$DW$399, DW_AT_name("i2cBusFreq")
    3427                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_i2cBusFreq")
    3428                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3429                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3430                      .dwendtag $C$DW$T$81
    3431              
    3432              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
    3433                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$81)
    3434                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    3435              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    3436                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    3437                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    3438              
    3439              $C$DW$T$66      .dwtag  DW_TAG_subroutine_type
    3440                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3441              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3442                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3443                      .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    3444              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2C_EVENT_ISR")
    3445                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3446                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3447              
    3448              $C$DW$T$69      .dwtag  DW_TAG_array_type
    3449                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3450                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3451                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x0e)
    3452              $C$DW$400       .dwtag  DW_TAG_subrange_type
    3453                      .dwattr $C$DW$400, DW_AT_upper_bound(0x06)
    3454                      .dwendtag $C$DW$T$69
    3455              
    3456              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3457                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3458                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3459                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3460              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3461                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3462                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3463                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3464              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3465                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3466                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3467                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3468              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3469                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3470                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3471                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3472              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3473                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3474                      .dwattr $C$DW$T$8, DW_AT_name("short")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dmaWordSwap_example.asm                                      PAGE   89

    3475                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3476              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3477                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    3478                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3479              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    3480                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3481                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3482              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
