TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE    1

    1366              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:34 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   21

         0000cd 000A 
         0000ce 0000 
     755                      .align  2
     756 0000d0 0052  $C$FSL10:       .string "Read Write Buffers Does not Match!!",10,0
         0000d1 0065 
         0000d2 0061 
         0000d3 0064 
         0000d4 0020 
         0000d5 0057 
         0000d6 0072 
         0000d7 0069 
         0000d8 0074 
         0000d9 0065 
         0000da 0020 
         0000db 0042 
         0000dc 0075 
         0000dd 0066 
         0000de 0066 
         0000df 0065 
         0000e0 0072 
         0000e1 0073 
         0000e2 0020 
         0000e3 0044 
         0000e4 006F 
         0000e5 0065 
         0000e6 0073 
         0000e7 0020 
         0000e8 006E 
         0000e9 006F 
         0000ea 0074 
         0000eb 0020 
         0000ec 004D 
         0000ed 0061 
         0000ee 0074 
         0000ef 0063 
         0000f0 0068 
         0000f1 0021 
         0000f2 0021 
         0000f3 000A 
         0000f4 0000 
     757                      .align  2
     758 0000f6 0052  $C$FSL11:       .string "Read Write Buffers Match!!",10,0
         0000f7 0065 
         0000f8 0061 
         0000f9 0064 
         0000fa 0020 
         0000fb 0057 
         0000fc 0072 
         0000fd 0069 
         0000fe 0074 
         0000ff 0065 
         000100 0020 
         000101 0042 
         000102 0075 
         000103 0066 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   22

         000104 0066 
         000105 0065 
         000106 0072 
         000107 0073 
         000108 0020 
         000109 004D 
         00010a 0061 
         00010b 0074 
         00010c 0063 
         00010d 0068 
         00010e 0021 
         00010f 0021 
         000110 000A 
         000111 0000 
     759              ;******************************************************************************
     760              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     761              ;******************************************************************************
     762                      .global _I2C_init
     763                      .global _I2C_setup
     764                      .global _I2C_write
     765                      .global _I2C_read
     766                      .global _printf
     767              
     768              ;*******************************************************************************
     769              ;* TYPE INFORMATION                                                            *
     770              ;*******************************************************************************
     771              
     772              $C$DW$T$21      .dwtag  DW_TAG_enumeration_type
     773                      .dwattr $C$DW$T$21, DW_AT_name("CSL_I2cAddrMode")
     774                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     775              $C$DW$65        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
     776              $C$DW$66        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
     777                      .dwendtag $C$DW$T$21
     778              
     779              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
     780                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     781                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     782              
     783              $C$DW$T$23      .dwtag  DW_TAG_enumeration_type
     784                      .dwattr $C$DW$T$23, DW_AT_name("CSL_I2cBitCount")
     785                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     786              $C$DW$67        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
     787              $C$DW$68        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
     788              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
     789              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
     790              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
     791              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
     792              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
     793              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
     794                      .dwendtag $C$DW$T$23
     795              
     796              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
     797                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     798                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     799              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   23

     800              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     801                      .dwattr $C$DW$T$20, DW_AT_name("CSL_I2cConfig")
     802                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x09)
     803              $C$DW$75        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$75, DW_AT_name("icoar")
     806                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_icoar")
     807                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$76        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$76, DW_AT_name("icimr")
     812                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_icimr")
     813                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     814                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     815              $C$DW$77        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$77, DW_AT_name("icclkl")
     818                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_icclkl")
     819                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     820                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$78        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     823                      .dwattr $C$DW$78, DW_AT_name("icclkh")
     824                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_icclkh")
     825                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     826                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     827              $C$DW$79        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$79, DW_AT_name("iccnt")
     830                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_iccnt")
     831                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     832                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     833              $C$DW$80        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$80, DW_AT_name("icsar")
     836                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_icsar")
     837                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     838                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$81        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$81, DW_AT_name("icmdr")
     842                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_icmdr")
     843                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     844                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$82        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$82, DW_AT_name("icemdr")
     848                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_icemdr")
     849                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     850                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     851              $C$DW$83        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$83, DW_AT_name("icpsc")
     854                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_icpsc")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   24

     855                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     856                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     857                      .dwendtag $C$DW$T$20
     858              
     859              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
     860                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$20)
     861                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     862              
     863              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
     864                      .dwattr $C$DW$T$27, DW_AT_name("CSL_I2cFreeMode")
     865                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     866              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
     867              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
     868                      .dwendtag $C$DW$T$27
     869              
     870              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
     871                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     872                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     873              
     874              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
     875                      .dwattr $C$DW$T$25, DW_AT_name("CSL_I2cLoopback")
     876                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     877              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
     878              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
     879                      .dwendtag $C$DW$T$25
     880              
     881              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
     882                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
     883                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     884              
     885              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
     886                      .dwattr $C$DW$T$29, DW_AT_name("CSL_I2cRepeatMode")
     887                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     888              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
     889              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
     890                      .dwendtag $C$DW$T$29
     891              
     892              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
     893                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     894                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     895              
     896              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     897                      .dwattr $C$DW$T$32, DW_AT_name("CSL_I2cSetup")
     898                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
     899              $C$DW$90        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
     901                      .dwattr $C$DW$90, DW_AT_name("addrMode")
     902                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_addrMode")
     903                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$91        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$24)
     907                      .dwattr $C$DW$91, DW_AT_name("bitCount")
     908                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bitCount")
     909                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   25

     910                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     911              $C$DW$92        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$26)
     913                      .dwattr $C$DW$92, DW_AT_name("loopBack")
     914                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_loopBack")
     915                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     916                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$93        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$28)
     919                      .dwattr $C$DW$93, DW_AT_name("freeMode")
     920                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_freeMode")
     921                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     922                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$94        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$30)
     925                      .dwattr $C$DW$94, DW_AT_name("repeatMode")
     926                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_repeatMode")
     927                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     928                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$95        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$95, DW_AT_name("ownAddr")
     932                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ownAddr")
     933                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     934                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$96        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$31)
     937                      .dwattr $C$DW$96, DW_AT_name("sysInputClk")
     938                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_sysInputClk")
     939                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     940                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$97        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$31)
     943                      .dwattr $C$DW$97, DW_AT_name("i2cBusFreq")
     944                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_i2cBusFreq")
     945                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     946                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     947                      .dwendtag $C$DW$T$32
     948              
     949              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
     950                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
     951                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     952              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     953                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     954                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
     955              $C$DW$T$4       .dwtag  DW_TAG_base_type
     956                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     957                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     958                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     959              $C$DW$T$5       .dwtag  DW_TAG_base_type
     960                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     961                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     962                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     963              $C$DW$T$6       .dwtag  DW_TAG_base_type
     964                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_polled_example.asm                                           PAGE   26

     965                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     966                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     967              $C$DW$T$7       .dwtag  DW_TAG_base_type
     968                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     969                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     970                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     971              $C$DW$T$8       .dwtag  DW_TAG_base_type
     972                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     973                      .dwattr $C$DW$T$8, DW_AT_name("short")
     974                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     975              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
     976                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$8)
     977                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     978              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
     979                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
     980                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     981              $C$DW$98        .dwtag  DW_TAG_TI_far_type
     982                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$37)
     983              $C$DW$T$51      .dwtag  DW_TAG_volatile_type
     984                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$98)
     985              $C$DW$T$9       .dwtag  DW_TAG_base_type
     986                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     987                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     988                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     989              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
     990                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     991                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     992              $C$DW$99        .dwtag  DW_TAG_TI_far_type
     993                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     994              $C$DW$T$52      .dwtag  DW_TAG_volatile_type
     995                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$99)
     996              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
     997                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
