TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE    1

    2485              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:58 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1812                      .dwattr $C$DW$105, DW_AT_TI_begin_column(0x06)
    1813                      .dwattr $C$DW$105, DW_AT_TI_max_frame_size(0x02)
    1814                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1005,column 1,is_stmt,add
    1815              
    1816                      .dwfde $C$DW$CIE, _IRQ_globalRestore
    1817              $C$DW$106       .dwtag  DW_TAG_formal_parameter, DW_AT_name("value")
    1818                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_value")
    1819                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1820                      .dwattr $C$DW$106, DW_AT_location[DW_OP_reg12]
    1821              ;*******************************************************************************
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   39

    1822              ;* FUNCTION NAME: IRQ_globalRestore                                            *
    1823              ;*                                                                             *
    1824              ;*   Function Uses Regs : T0,AR1,SP,M40,SATA,SATD,RDM,FRCT,SMUL                *
    1825              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
    1826              ;*   Total Frame Size   : 2 words                                              *
    1827              ;*                        (1 return address/alignment)                         *
    1828              ;*                        (1 local values)                                     *
    1829              ;*   Min System Stack   : 1 word                                               *
    1830              ;*******************************************************************************
    1831 00055c       _IRQ_globalRestore:
    1832                      .dwcfi  cfa_offset, 1
    1833                      .dwcfi  save_reg_to_mem, 91, -1
    1834 00055c 4EFF          AADD #-1, SP
    1835                      .dwcfi  cfa_offset, 2
    1836              $C$DW$107       .dwtag  DW_TAG_variable, DW_AT_name("value")
    1837                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_value")
    1838                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$41)
    1839                      .dwattr $C$DW$107, DW_AT_location[DW_OP_bregx 0x24 0]
    1840 00055e C400          MOV T0, *SP(#0) ; |1005| 
    1841                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1006,column 5,is_stmt
    1842 000560 2249          MOV T0, AR1
    1843 000562 6289          BCC $C$L41,AR1 == #0 ; |1006| 
    1844                                                      ; branchcc occurs ; |1006| 
    1845                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1008,column 9,is_stmt
    1846 000564 20            NOP                      ;====> CODE AUTO-GENERATED by CSL
    1847                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1012,column 9,is_stmt
    1848 000565 46B3          BSET INTM                ;====> CODE AUTO-GENERATED by CSL
    1849                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1014,column 5,is_stmt
    1850 000567 4A03          B $C$L42  ; |1014| 
    1851                                                      ; branch occurs ; |1014| 
    1852 000569       $C$L41:    
    1853                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1018,column 9,is_stmt
    1854 000569 20            NOP                      ;====> CODE AUTO-GENERATED by CSL
    1855                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1022,column 9,is_stmt
    1856 00056a 46B2          BCLR INTM                ;====> CODE AUTO-GENERATED by CSL
    1857                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1025,column 1,is_stmt
    1858 00056c       $C$L42:    
    1859 00056c 4E01          AADD #1, SP
    1860                      .dwcfi  cfa_offset, 1
    1861              $C$DW$108       .dwtag  DW_TAG_TI_branch
    1862                      .dwattr $C$DW$108, DW_AT_low_pc(0x00)
    1863                      .dwattr $C$DW$108, DW_AT_TI_return
    1864 00056e 4804          RET
    1865                                                      ; return occurs
    1866                      .dwattr $C$DW$105, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c")
    1867                      .dwattr $C$DW$105, DW_AT_TI_end_line(0x401)
    1868                      .dwattr $C$DW$105, DW_AT_TI_end_column(0x01)
    1869                      .dwendentry
    1870                      .dwendtag $C$DW$105
    1871              
    1872              
    1873              ;*******************************************************************************
    1874              ;* TYPE INFORMATION                                                            *
    1875              ;*******************************************************************************
    1876              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   40

    1877              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1878                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1879              $C$DW$109       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1881                      .dwattr $C$DW$109, DW_AT_name("funcAddr")
    1882                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_funcAddr")
    1883                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$110       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1887                      .dwattr $C$DW$110, DW_AT_name("funcArg")
    1888                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_funcArg")
    1889                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1890                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$111       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1893                      .dwattr $C$DW$111, DW_AT_name("ierMask")
    1894                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ierMask")
    1895                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1896                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$112       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1899                      .dwattr $C$DW$112, DW_AT_name("cacheCtrl")
    1900                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_cacheCtrl")
    1901                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1902                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1903                      .dwendtag $C$DW$T$23
    1904              
    1905              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Dispatch")
    1906                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$23)
    1907                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1908              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1909                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1910                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    1911              
    1912              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1913                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    1914              $C$DW$113       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1916                      .dwattr $C$DW$113, DW_AT_name("funcAddr")
    1917                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_funcAddr")
    1918                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$114       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1922                      .dwattr $C$DW$114, DW_AT_name("funcArg")
    1923                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_funcArg")
    1924                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1925                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$115       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1928                      .dwattr $C$DW$115, DW_AT_name("ierMask")
    1929                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ierMask")
    1930                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1931                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   41

    1932              $C$DW$116       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    1934                      .dwattr $C$DW$116, DW_AT_name("cacheCtrl")
    1935                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_cacheCtrl")
    1936                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1937                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1938                      .dwendtag $C$DW$T$24
    1939              
    1940              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Config")
    1941                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    1942                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1943              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1944                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1945                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1946              
    1947              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1948                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x84)
    1949              $C$DW$117       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    1951                      .dwattr $C$DW$117, DW_AT_name("IrqDispatchTable")
    1952                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IrqDispatchTable")
    1953                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1955              $C$DW$118       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
    1957                      .dwattr $C$DW$118, DW_AT_name("IrqIntTable")
    1958                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IrqIntTable")
    1959                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1960                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1961              $C$DW$119       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    1963                      .dwattr $C$DW$119, DW_AT_name("IrqEventTable")
    1964                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IrqEventTable")
    1965                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1966                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1967              $C$DW$120       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$28)
    1969                      .dwattr $C$DW$120, DW_AT_name("biosPresent")
    1970                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_biosPresent")
    1971                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1972                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1973                      .dwendtag $C$DW$T$29
    1974              
    1975              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IrqDataObj")
    1976                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$29)
    1977                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1978              
    1979              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1980                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x4c)
    1981              $C$DW$121       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$30)
    1983                      .dwattr $C$DW$121, DW_AT_name("IER0")
    1984                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IER0")
    1985                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   42

    1987              $C$DW$122       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$30)
    1989                      .dwattr $C$DW$122, DW_AT_name("IFR0")
    1990                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IFR0")
    1991                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1992                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$123       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    1995                      .dwattr $C$DW$123, DW_AT_name("ST0_55")
    1996                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ST0_55")
    1997                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1998                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$124       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$30)
    2001                      .dwattr $C$DW$124, DW_AT_name("ST1_55")
    2002                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ST1_55")
    2003                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2004                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$125       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$30)
    2007                      .dwattr $C$DW$125, DW_AT_name("ST3_55")
    2008                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ST3_55")
    2009                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2010                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$126       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$31)
    2013                      .dwattr $C$DW$126, DW_AT_name("RSVD0")
    2014                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RSVD0")
    2015                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2016                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$127       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$30)
    2019                      .dwattr $C$DW$127, DW_AT_name("IER1")
    2020                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IER1")
    2021                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2022                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$128       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    2025                      .dwattr $C$DW$128, DW_AT_name("IFR1")
    2026                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IFR1")
    2027                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2028                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$129       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    2031                      .dwattr $C$DW$129, DW_AT_name("RSVD1")
    2032                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD1")
    2033                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2034                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$130       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$30)
    2037                      .dwattr $C$DW$130, DW_AT_name("IVPD")
    2038                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IVPD")
    2039                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2040                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$131       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   43

    2042                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$30)
    2043                      .dwattr $C$DW$131, DW_AT_name("IVPH")
    2044                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IVPH")
    2045                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2046                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$132       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$30)
    2049                      .dwattr $C$DW$132, DW_AT_name("ST2_55")
    2050                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ST2_55")
    2051                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4b]
    2052                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2053                      .dwendtag $C$DW$T$33
    2054              
    2055              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegs")
    2056                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$33)
    2057                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2058              $C$DW$133       .dwtag  DW_TAG_TI_far_type
    2059                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    2060              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    2061                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$133)
    2062              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2063                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2064                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    2065              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegsOvly")
    2066                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2067                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2068              
    2069              $C$DW$T$19      .dwtag  DW_TAG_subroutine_type
    2070                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2071              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    2072                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    2073                      .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    2074              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2075                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2076                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2077              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2078                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2079                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2080                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2081              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2082                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2083                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2084                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2085              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2086                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2087                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2088                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2089              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2090                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2091                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2092                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2093              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2094                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2095                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2096                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:59 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   44

    2097              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2098                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
    2099                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2100              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2101                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2102                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2103              $C$DW$T$9       .dwtag  DW_TAG_base_type
