TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE    1

   10992              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:14 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9617                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    9618                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    9619              
    9620              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    9621                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    9622              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_UNLOCK"), DW_AT_const_value(0x00)
    9623              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_LOCK"), DW_AT_const_value(0x01)
    9624                      .dwendtag $C$DW$T$58
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  235

    9625              
    9626              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscMediaLockStatus")
    9627                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9628                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9629              
    9630              $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    9631                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
    9632              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    9633              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    9634              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    9635              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    9636              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    9637              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    9638              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    9639              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    9640              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    9641              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    9642              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    9643              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    9644              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    9645              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    9646              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    9647              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    9648                      .dwendtag $C$DW$T$78
    9649              
    9650              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    9651                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    9652                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    9653              
    9654              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    9655                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    9656              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    9657              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    9658              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    9659              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    9660              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    9661                      .dwendtag $C$DW$T$80
    9662              
    9663              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    9664                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    9665                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9666              
    9667              $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    9668                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    9669              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
    9670              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
    9671                      .dwendtag $C$DW$T$86
    9672              
    9673              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
    9674                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    9675                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9676              
    9677              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9678                      .dwattr $C$DW$T$21, DW_AT_name("CSL_MscClassStruct")
    9679                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x220)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  236

    9680              $C$DW$664       .dwtag  DW_TAG_member
    9681                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$19)
    9682                      .dwattr $C$DW$664, DW_AT_name("ctrlHandle")
    9683                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ctrlHandle")
    9684                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9685                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    9686              $C$DW$665       .dwtag  DW_TAG_member
    9687                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
    9688                      .dwattr $C$DW$665, DW_AT_name("mscHandle")
    9689                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_mscHandle")
    9690                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9691                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    9692                      .dwendtag $C$DW$T$21
    9693              
    9694              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscClassStruct")
    9695                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$21)
    9696                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9697              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    9698                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    9699                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    9700              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("pMscClassHandle")
    9701                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    9702                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    9703              
    9704              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    9705                      .dwattr $C$DW$T$48, DW_AT_name("CSL_MscCtrlObject")
    9706                      .dwattr $C$DW$T$48, DW_AT_byte_size(0xb6)
    9707              $C$DW$666       .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    9709                      .dwattr $C$DW$666, DW_AT_name("ctrlInEpObj")
    9710                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ctrlInEpObj")
    9711                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9712                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    9713              $C$DW$667       .dwtag  DW_TAG_member
    9714                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    9715                      .dwattr $C$DW$667, DW_AT_name("devNum")
    9716                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_devNum")
    9717                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9718                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9719              $C$DW$668       .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
    9721                      .dwattr $C$DW$668, DW_AT_name("ctrlOutEpObj")
    9722                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ctrlOutEpObj")
    9723                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9724                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9725              $C$DW$669       .dwtag  DW_TAG_member
    9726                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$25)
    9727                      .dwattr $C$DW$669, DW_AT_name("suspendFlag")
    9728                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_suspendFlag")
    9729                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9730                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9731              $C$DW$670       .dwtag  DW_TAG_member
    9732                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$28)
    9733                      .dwattr $C$DW$670, DW_AT_name("hEpObjArray")
    9734                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_hEpObjArray")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  237

    9735                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9736                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9737              $C$DW$671       .dwtag  DW_TAG_member
    9738                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$29)
    9739                      .dwattr $C$DW$671, DW_AT_name("usbSetup")
    9740                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_usbSetup")
    9741                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9742                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9743              $C$DW$672       .dwtag  DW_TAG_member
    9744                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$30)
    9745                      .dwattr $C$DW$672, DW_AT_name("highSpeedCfgDescr")
    9746                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_highSpeedCfgDescr")
    9747                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9748                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9749              $C$DW$673       .dwtag  DW_TAG_member
    9750                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$30)
    9751                      .dwattr $C$DW$673, DW_AT_name("fullSpeedCfgDescr")
    9752                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_fullSpeedCfgDescr")
    9753                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    9754                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    9755              $C$DW$674       .dwtag  DW_TAG_member
    9756                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
    9757                      .dwattr $C$DW$674, DW_AT_name("deviceDescr")
    9758                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_deviceDescr")
    9759                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9760                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9761              $C$DW$675       .dwtag  DW_TAG_member
    9762                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$32)
    9763                      .dwattr $C$DW$675, DW_AT_name("deviceQualDescr")
    9764                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_deviceQualDescr")
    9765                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9766                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9767              $C$DW$676       .dwtag  DW_TAG_member
    9768                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$32)
    9769                      .dwattr $C$DW$676, DW_AT_name("confDescr")
    9770                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_confDescr")
    9771                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9772                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9773              $C$DW$677       .dwtag  DW_TAG_member
    9774                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
    9775                      .dwattr $C$DW$677, DW_AT_name("massStorageIntDescr")
    9776                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_massStorageIntDescr")
    9777                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    9778                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9779              $C$DW$678       .dwtag  DW_TAG_member
    9780                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
    9781                      .dwattr $C$DW$678, DW_AT_name("massStorageBulkOutEndptDescr")
    9782                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_massStorageBulkOutEndptDescr")
    9783                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9784                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9785              $C$DW$679       .dwtag  DW_TAG_member
    9786                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$34)
    9787                      .dwattr $C$DW$679, DW_AT_name("massStorageInterfcLnk")
    9788                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_massStorageInterfcLnk")
    9789                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  238

    9790                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9791              $C$DW$680       .dwtag  DW_TAG_member
    9792                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
    9793                      .dwattr $C$DW$680, DW_AT_name("massStorageBulkInEndptDescr")
    9794                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_massStorageBulkInEndptDescr")
    9795                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    9796                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9797              $C$DW$681       .dwtag  DW_TAG_member
    9798                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$34)
    9799                      .dwattr $C$DW$681, DW_AT_name("massStorageBulkOutEndptLnk")
    9800                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_massStorageBulkOutEndptLnk")
    9801                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    9802                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9803              $C$DW$682       .dwtag  DW_TAG_member
    9804                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$35)
    9805                      .dwattr $C$DW$682, DW_AT_name("stringDescrLangid")
    9806                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_stringDescrLangid")
    9807                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9808                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9809              $C$DW$683       .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
    9811                      .dwattr $C$DW$683, DW_AT_name("curConfigStat")
    9812                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_curConfigStat")
    9813                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    9814                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    9815              $C$DW$684       .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$34)
    9817                      .dwattr $C$DW$684, DW_AT_name("massStorageBulkInEndptLnk")
    9818                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_massStorageBulkInEndptLnk")
    9819                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    9820                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    9821              $C$DW$685       .dwtag  DW_TAG_member
    9822                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$33)
    9823                      .dwattr $C$DW$685, DW_AT_name("ctrlBuffer")
    9824                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ctrlBuffer")
    9825                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9826                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    9827              $C$DW$686       .dwtag  DW_TAG_member
    9828                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$34)
    9829                      .dwattr $C$DW$686, DW_AT_name("configDescrLnk")
    9830                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_configDescrLnk")
    9831                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9832                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    9833              $C$DW$687       .dwtag  DW_TAG_member
    9834                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$38)
    9835                      .dwattr $C$DW$687, DW_AT_name("strDescr")
    9836                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_strDescr")
    9837                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9838                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    9839              $C$DW$688       .dwtag  DW_TAG_member
    9840                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$40)
    9841                      .dwattr $C$DW$688, DW_AT_name("mscReqTable")
    9842                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_mscReqTable")
    9843                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    9844                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  239

    9845              $C$DW$689       .dwtag  DW_TAG_member
    9846                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$45)
    9847                      .dwattr $C$DW$689, DW_AT_name("fpRequestHandler")
    9848                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_fpRequestHandler")
    9849                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9850                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9851              $C$DW$690       .dwtag  DW_TAG_member
    9852                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$46)
    9853                      .dwattr $C$DW$690, DW_AT_name("usbSpeedCfg")
    9854                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_usbSpeedCfg")
    9855                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    9856                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9857              $C$DW$691       .dwtag  DW_TAG_member
    9858                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$47)
    9859                      .dwattr $C$DW$691, DW_AT_name("pCfgDescr")
    9860                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pCfgDescr")
    9861                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9862                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9863              $C$DW$692       .dwtag  DW_TAG_member
    9864                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$47)
    9865                      .dwattr $C$DW$692, DW_AT_name("pOtherSpeedCfgDescr")
    9866                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_pOtherSpeedCfgDescr")
    9867                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    9868                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    9869                      .dwendtag $C$DW$T$48
    9870              
    9871              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscCtrlObject")
    9872                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
    9873                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    9874              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    9875                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$19)
    9876                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
    9877              
    9878              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    9879                      .dwattr $C$DW$T$64, DW_AT_name("CSL_MscInitStructApp")
    9880                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x1e)
    9881              $C$DW$693       .dwtag  DW_TAG_member
    9882                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$3)
    9883                      .dwattr $C$DW$693, DW_AT_name("pMscObj")
    9884                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pMscObj")
    9885                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9886                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    9887              $C$DW$694       .dwtag  DW_TAG_member
    9888                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$25)
    9889                      .dwattr $C$DW$694, DW_AT_name("pId")
    9890                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_pId")
    9891                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9892                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    9893              $C$DW$695       .dwtag  DW_TAG_member
    9894                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
    9895                      .dwattr $C$DW$695, DW_AT_name("vId")
    9896                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_vId")
    9897                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9898                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    9899              $C$DW$696       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  240

    9900                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$25)
    9901                      .dwattr $C$DW$696, DW_AT_name("numLun")
    9902                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_numLun")
    9903                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9904                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    9905              $C$DW$697       .dwtag  DW_TAG_member
    9906                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$38)
    9907                      .dwattr $C$DW$697, DW_AT_name("strDescrApp")
    9908                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_strDescrApp")
    9909                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9910                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    9911              $C$DW$698       .dwtag  DW_TAG_member
    9912                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$47)
    9913                      .dwattr $C$DW$698, DW_AT_name("lbaBufferApp")
    9914                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_lbaBufferApp")
    9915                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9916                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9917              $C$DW$699       .dwtag  DW_TAG_member
    9918                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$40)
    9919                      .dwattr $C$DW$699, DW_AT_name("mscReqTableApp")
    9920                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_mscReqTableApp")
    9921                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9922                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    9923              $C$DW$700       .dwtag  DW_TAG_member
    9924                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$50)
    9925                      .dwattr $C$DW$700, DW_AT_name("bulkHandler")
    9926                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_bulkHandler")
    9927                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9928                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9929              $C$DW$701       .dwtag  DW_TAG_member
    9930                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$50)
    9931                      .dwattr $C$DW$701, DW_AT_name("ctrlHandler")
    9932                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ctrlHandler")
    9933                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9934                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    9935              $C$DW$702       .dwtag  DW_TAG_member
    9936                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
    9937                      .dwattr $C$DW$702, DW_AT_name("readMediaApp")
    9938                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_readMediaApp")
    9939                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9940                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9941              $C$DW$703       .dwtag  DW_TAG_member
    9942                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$55)
    9943                      .dwattr $C$DW$703, DW_AT_name("writeMediaApp")
    9944                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_writeMediaApp")
    9945                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9946                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    9947              $C$DW$704       .dwtag  DW_TAG_member
    9948                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$57)
    9949                      .dwattr $C$DW$704, DW_AT_name("mediaGetPresentStateApp")
    9950                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
    9951                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9952                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9953              $C$DW$705       .dwtag  DW_TAG_member
    9954                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$57)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  241

    9955                      .dwattr $C$DW$705, DW_AT_name("mediaInitApp")
    9956                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_mediaInitApp")
    9957                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9958                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9959              $C$DW$706       .dwtag  DW_TAG_member
    9960                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$57)
    9961                      .dwattr $C$DW$706, DW_AT_name("mediaEjectApp")
    9962                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_mediaEjectApp")
    9963                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9964                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    9965              $C$DW$707       .dwtag  DW_TAG_member
    9966                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$61)
    9967                      .dwattr $C$DW$707, DW_AT_name("mediaLockUnitApp")
    9968                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_mediaLockUnitApp")
    9969                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9970                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    9971              $C$DW$708       .dwtag  DW_TAG_member
    9972                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$63)
    9973                      .dwattr $C$DW$708, DW_AT_name("getMediaSizeApp")
    9974                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_getMediaSizeApp")
    9975                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9976                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    9977                      .dwendtag $C$DW$T$64
    9978              
    9979              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscInitStructApp")
    9980                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$64)
    9981                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    9982              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    9983                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    9984                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    9985              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("pMscAppClassHandle")
    9986                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    9987                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9988              
    9989              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    9990                      .dwattr $C$DW$T$66, DW_AT_name("CSL_MscLogicalUnit")
    9991                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x3e)
    9992              $C$DW$709       .dwtag  DW_TAG_member
    9993                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$65)
    9994                      .dwattr $C$DW$709, DW_AT_name("scsiInquiryData")
    9995                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_scsiInquiryData")
    9996                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9997                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9998              $C$DW$710       .dwtag  DW_TAG_member
    9999                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$53)
   10000                      .dwattr $C$DW$710, DW_AT_name("mediaSize")
   10001                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_mediaSize")
   10002                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10003                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
   10004              $C$DW$711       .dwtag  DW_TAG_member
   10005                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$53)
   10006                      .dwattr $C$DW$711, DW_AT_name("currLba")
   10007                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_currLba")
   10008                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10009                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  242

   10010              $C$DW$712       .dwtag  DW_TAG_member
   10011                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$53)
   10012                      .dwattr $C$DW$712, DW_AT_name("lbaSize")
   10013                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_lbaSize")
   10014                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10015                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
   10016              $C$DW$713       .dwtag  DW_TAG_member
   10017                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
   10018                      .dwattr $C$DW$713, DW_AT_name("removeable")
   10019                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_removeable")
   10020                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10021                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
   10022              $C$DW$714       .dwtag  DW_TAG_member
   10023                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
   10024                      .dwattr $C$DW$714, DW_AT_name("mediaState")
   10025                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_mediaState")
   10026                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
   10027                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
   10028              $C$DW$715       .dwtag  DW_TAG_member
   10029                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
   10030                      .dwattr $C$DW$715, DW_AT_name("readwrite")
   10031                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_readwrite")
   10032                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10033                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
   10034              $C$DW$716       .dwtag  DW_TAG_member
   10035                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$25)
   10036                      .dwattr $C$DW$716, DW_AT_name("lbaCnt")
   10037                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_lbaCnt")
   10038                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
   10039                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
   10040              $C$DW$717       .dwtag  DW_TAG_member
   10041                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
   10042                      .dwattr $C$DW$717, DW_AT_name("verifyFlag")
   10043                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_verifyFlag")
   10044                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10045                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
   10046                      .dwendtag $C$DW$T$66
   10047              
   10048              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLogicalUnit")
   10049                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$66)
   10050                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   10051              
   10052              $C$DW$T$70      .dwtag  DW_TAG_array_type
   10053                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
   10054                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   10055                      .dwattr $C$DW$T$70, DW_AT_byte_size(0xf8)
   10056              $C$DW$718       .dwtag  DW_TAG_subrange_type
   10057                      .dwattr $C$DW$718, DW_AT_upper_bound(0x03)
   10058                      .dwendtag $C$DW$T$70
   10059              
   10060              
   10061              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   10062                      .dwattr $C$DW$T$68, DW_AT_name("CSL_MscLunAttribApp")
   10063                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x20)
   10064              $C$DW$719       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  243

   10065                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$53)
   10066                      .dwattr $C$DW$719, DW_AT_name("lbaSizeApp")
   10067                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_lbaSizeApp")
   10068                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10069                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
   10070              $C$DW$720       .dwtag  DW_TAG_member
   10071                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$53)
   10072                      .dwattr $C$DW$720, DW_AT_name("mediaSizeApp")
   10073                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_mediaSizeApp")
   10074                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10075                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
   10076              $C$DW$721       .dwtag  DW_TAG_member
   10077                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
   10078                      .dwattr $C$DW$721, DW_AT_name("removeableApp")
   10079                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_removeableApp")
   10080                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10081                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
   10082              $C$DW$722       .dwtag  DW_TAG_member
   10083                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$67)
   10084                      .dwattr $C$DW$722, DW_AT_name("scsiInquiryConfData")
   10085                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_scsiInquiryConfData")
   10086                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10087                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
   10088              $C$DW$723       .dwtag  DW_TAG_member
   10089                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$25)
   10090                      .dwattr $C$DW$723, DW_AT_name("mediaStateApp")
   10091                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_mediaStateApp")
   10092                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   10093                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
   10094              $C$DW$724       .dwtag  DW_TAG_member
   10095                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
   10096                      .dwattr $C$DW$724, DW_AT_name("readwriteApp")
   10097                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_readwriteApp")
   10098                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10099                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
   10100                      .dwendtag $C$DW$T$68
   10101              
   10102              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLunAttribApp")
   10103                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$68)
   10104                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   10105              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
   10106                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
   10107                      .dwattr $C$DW$T$106, DW_AT_address_class(0x17)
   10108              
   10109              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   10110                      .dwattr $C$DW$T$73, DW_AT_name("CSL_MscObject")
   10111                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x16a)
   10112              $C$DW$725       .dwtag  DW_TAG_member
   10113                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$55)
   10114                      .dwattr $C$DW$725, DW_AT_name("readMedia")
   10115                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_readMedia")
   10116                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10117                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
   10118              $C$DW$726       .dwtag  DW_TAG_member
   10119                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$55)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  244

   10120                      .dwattr $C$DW$726, DW_AT_name("writeMedia")
   10121                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_writeMedia")
   10122                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10123                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
   10124              $C$DW$727       .dwtag  DW_TAG_member
   10125                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
   10126                      .dwattr $C$DW$727, DW_AT_name("mediaGetPresentState")
   10127                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_mediaGetPresentState")
   10128                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10129                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
   10130              $C$DW$728       .dwtag  DW_TAG_member
   10131                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$57)
   10132                      .dwattr $C$DW$728, DW_AT_name("mediaInit")
   10133                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_mediaInit")
   10134                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10135                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
   10136              $C$DW$729       .dwtag  DW_TAG_member
   10137                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
   10138                      .dwattr $C$DW$729, DW_AT_name("mediaEject")
   10139                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_mediaEject")
   10140                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10141                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
   10142              $C$DW$730       .dwtag  DW_TAG_member
   10143                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$61)
   10144                      .dwattr $C$DW$730, DW_AT_name("mediaLockUnit")
   10145                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_mediaLockUnit")
   10146                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10147                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
   10148              $C$DW$731       .dwtag  DW_TAG_member
   10149                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$63)
   10150                      .dwattr $C$DW$731, DW_AT_name("getMediaSize")
   10151                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_getMediaSize")
   10152                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10153                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
   10154              $C$DW$732       .dwtag  DW_TAG_member
   10155                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$47)
   10156                      .dwattr $C$DW$732, DW_AT_name("lbaBuffer")
   10157                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_lbaBuffer")
   10158                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10159                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
   10160              $C$DW$733       .dwtag  DW_TAG_member
   10161                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$53)
   10162                      .dwattr $C$DW$733, DW_AT_name("cbwDataTransferLength")
   10163                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_cbwDataTransferLength")
   10164                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10165                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
   10166              $C$DW$734       .dwtag  DW_TAG_member
   10167                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$70)
   10168                      .dwattr $C$DW$734, DW_AT_name("lun")
   10169                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_lun")
   10170                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10171                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
   10172              $C$DW$735       .dwtag  DW_TAG_member
   10173                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$71)
   10174                      .dwattr $C$DW$735, DW_AT_name("senseData")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  245

   10175                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_senseData")
   10176                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
   10177                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
   10178              $C$DW$736       .dwtag  DW_TAG_member
   10179                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$25)
   10180                      .dwattr $C$DW$736, DW_AT_name("activityPresentFlag")
   10181                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_activityPresentFlag")
   10182                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x119]
   10183                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
   10184              $C$DW$737       .dwtag  DW_TAG_member
   10185                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$72)
   10186                      .dwattr $C$DW$737, DW_AT_name("csw")
   10187                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_csw")
   10188                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
   10189                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
   10190              $C$DW$738       .dwtag  DW_TAG_member
   10191                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
   10192                      .dwattr $C$DW$738, DW_AT_name("readCapacity")
   10193                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_readCapacity")
   10194                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
   10195                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
   10196              $C$DW$739       .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$30)
   10198                      .dwattr $C$DW$739, DW_AT_name("cbw")
   10199                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_cbw")
   10200                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
   10201                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
   10202              $C$DW$740       .dwtag  DW_TAG_member
   10203                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$22)
   10204                      .dwattr $C$DW$740, DW_AT_name("bulkInEpObj")
   10205                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_bulkInEpObj")
   10206                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
   10207                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
   10208              $C$DW$741       .dwtag  DW_TAG_member
   10209                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$22)
   10210                      .dwattr $C$DW$741, DW_AT_name("bulkOutEpObj")
   10211                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_bulkOutEpObj")
   10212                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
   10213                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
   10214              $C$DW$742       .dwtag  DW_TAG_member
   10215                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
   10216                      .dwattr $C$DW$742, DW_AT_name("noOfLun")
   10217                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_noOfLun")
   10218                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
   10219                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
   10220              $C$DW$743       .dwtag  DW_TAG_member
   10221                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
   10222                      .dwattr $C$DW$743, DW_AT_name("storageState")
   10223                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_storageState")
   10224                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x163]
   10225                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
   10226              $C$DW$744       .dwtag  DW_TAG_member
   10227                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$33)
   10228                      .dwattr $C$DW$744, DW_AT_name("modeSenseData")
   10229                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_modeSenseData")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  246

   10230                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
   10231                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
   10232              $C$DW$745       .dwtag  DW_TAG_member
   10233                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$46)
   10234                      .dwattr $C$DW$745, DW_AT_name("writeToMedia")
   10235                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_writeToMedia")
   10236                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x169]
   10237                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
   10238                      .dwendtag $C$DW$T$73
   10239              
   10240              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscObject")
   10241                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$73)
   10242                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
   10243              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
   10244                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$20)
   10245                      .dwattr $C$DW$T$107, DW_AT_address_class(0x17)
   10246              
   10247              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   10248                      .dwattr $C$DW$T$75, DW_AT_name("CSL_MscRequestStruct")
   10249                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
   10250              $C$DW$746       .dwtag  DW_TAG_member
   10251                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$74)
   10252                      .dwattr $C$DW$746, DW_AT_name("request")
   10253                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_request")
   10254                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10255                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
   10256              $C$DW$747       .dwtag  DW_TAG_member
   10257                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$45)
   10258                      .dwattr $C$DW$747, DW_AT_name("fpRequestHandler")
   10259                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_fpRequestHandler")
   10260                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10261                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
   10262                      .dwendtag $C$DW$T$75
   10263              
   10264              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscRequestStruct")
   10265                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$75)
   10266                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   10267              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   10268                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
   10269                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
   10270              
   10271              $C$DW$T$77      .dwtag  DW_TAG_structure_type
   10272                      .dwattr $C$DW$T$77, DW_AT_name("CSL_UsbDataStruct")
   10273                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x06)
   10274              $C$DW$748       .dwtag  DW_TAG_member
   10275                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
   10276                      .dwattr $C$DW$748, DW_AT_name("bytes")
   10277                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_bytes")
   10278                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10279                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
   10280              $C$DW$749       .dwtag  DW_TAG_member
   10281                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$47)
   10282                      .dwattr $C$DW$749, DW_AT_name("pBuffer")
   10283                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_pBuffer")
   10284                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  247

   10285                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
   10286              $C$DW$750       .dwtag  DW_TAG_member
   10287                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$76)
   10288                      .dwattr $C$DW$750, DW_AT_name("pNextBuffer")
   10289                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_pNextBuffer")
   10290                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10291                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
   10292                      .dwendtag $C$DW$T$77
   10293              
   10294              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
   10295                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$77)
   10296                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
   10297              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   10298                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$34)
   10299                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
   10300              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
   10301                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$77)
   10302                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
   10303              
   10304              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   10305                      .dwattr $C$DW$T$84, DW_AT_name("CSL_UsbEpObj")
   10306                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
   10307              $C$DW$751       .dwtag  DW_TAG_member
   10308                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$79)
   10309                      .dwattr $C$DW$751, DW_AT_name("epNum")
   10310                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_epNum")
   10311                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10312                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
   10313              $C$DW$752       .dwtag  DW_TAG_member
   10314                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$81)
   10315                      .dwattr $C$DW$752, DW_AT_name("xferType")
   10316                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_xferType")
   10317                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10318                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
   10319              $C$DW$753       .dwtag  DW_TAG_member
   10320                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
   10321                      .dwattr $C$DW$753, DW_AT_name("maxPktSiz")
   10322                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_maxPktSiz")
   10323                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10324                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
   10325              $C$DW$754       .dwtag  DW_TAG_member
   10326                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
   10327                      .dwattr $C$DW$754, DW_AT_name("eventMask")
   10328                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_eventMask")
   10329                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10330                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
   10331              $C$DW$755       .dwtag  DW_TAG_member
   10332                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$82)
   10333                      .dwattr $C$DW$755, DW_AT_name("fxn")
   10334                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_fxn")
   10335                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10336                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
   10337              $C$DW$756       .dwtag  DW_TAG_member
   10338                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
   10339                      .dwattr $C$DW$756, DW_AT_name("dataFlags")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  248

   10340                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_dataFlags")
   10341                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10342                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
   10343              $C$DW$757       .dwtag  DW_TAG_member
   10344                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
   10345                      .dwattr $C$DW$757, DW_AT_name("status")
   10346                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_status")
   10347                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10348                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
   10349              $C$DW$758       .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
   10351                      .dwattr $C$DW$758, DW_AT_name("epDescRegSAddr")
   10352                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_epDescRegSAddr")
   10353                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10354                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
   10355              $C$DW$759       .dwtag  DW_TAG_member
   10356                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
   10357                      .dwattr $C$DW$759, DW_AT_name("dmaRegSAddr")
   10358                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_dmaRegSAddr")
   10359                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10360                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
   10361              $C$DW$760       .dwtag  DW_TAG_member
   10362                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
   10363                      .dwattr $C$DW$760, DW_AT_name("totByteCnt")
   10364                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_totByteCnt")
   10365                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10366                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
   10367              $C$DW$761       .dwtag  DW_TAG_member
   10368                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
   10369                      .dwattr $C$DW$761, DW_AT_name("byteInThisSeg")
   10370                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_byteInThisSeg")
   10371                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10372                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
   10373              $C$DW$762       .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$47)
   10375                      .dwattr $C$DW$762, DW_AT_name("xferBytCnt")
   10376                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_xferBytCnt")
   10377                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10378                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
   10379              $C$DW$763       .dwtag  DW_TAG_member
   10380                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$47)
   10381                      .dwattr $C$DW$763, DW_AT_name("pBuffer")
   10382                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_pBuffer")
   10383                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10384                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
   10385              $C$DW$764       .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$83)
   10387                      .dwattr $C$DW$764, DW_AT_name("pNextBuffer")
   10388                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_pNextBuffer")
   10389                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10390                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
   10391              $C$DW$765       .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
   10393                      .dwattr $C$DW$765, DW_AT_name("eventFlag")
   10394                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_eventFlag")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  249

   10395                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10396                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
   10397                      .dwendtag $C$DW$T$84
   10398              
   10399              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
   10400                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$84)
   10401                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
   10402              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
   10403                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
   10404                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
   10405              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
   10406                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
   10407                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
   10408              
   10409              $C$DW$T$28      .dwtag  DW_TAG_array_type
   10410                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
   10411                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
   10412                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
   10413              $C$DW$766       .dwtag  DW_TAG_subrange_type
   10414                      .dwattr $C$DW$766, DW_AT_upper_bound(0x04)
   10415                      .dwendtag $C$DW$T$28
   10416              
   10417              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
   10418                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$27)
   10419                      .dwattr $C$DW$T$108, DW_AT_address_class(0x17)
   10420              
   10421              $C$DW$T$85      .dwtag  DW_TAG_structure_type
   10422                      .dwattr $C$DW$T$85, DW_AT_name("CSL_UsbSetupStruct")
   10423                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
   10424              $C$DW$767       .dwtag  DW_TAG_member
   10425                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$10)
   10426                      .dwattr $C$DW$767, DW_AT_name("newPacket")
   10427                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_newPacket")
   10428                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10429                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
   10430              $C$DW$768       .dwtag  DW_TAG_member
   10431                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
   10432                      .dwattr $C$DW$768, DW_AT_name("bmRequestType")
   10433                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_bmRequestType")
   10434                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10435                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
   10436              $C$DW$769       .dwtag  DW_TAG_member
   10437                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
   10438                      .dwattr $C$DW$769, DW_AT_name("bRequest")
   10439                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_bRequest")
   10440                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10441                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
   10442              $C$DW$770       .dwtag  DW_TAG_member
   10443                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
   10444                      .dwattr $C$DW$770, DW_AT_name("wValue")
   10445                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_wValue")
   10446                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10447                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
   10448              $C$DW$771       .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  250

   10450                      .dwattr $C$DW$771, DW_AT_name("wIndex")
   10451                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_wIndex")
   10452                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10453                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
   10454              $C$DW$772       .dwtag  DW_TAG_member
   10455                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$25)
   10456                      .dwattr $C$DW$772, DW_AT_name("wLength")
   10457                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_wLength")
   10458                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10459                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
   10460                      .dwendtag $C$DW$T$85
   10461              
   10462              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
   10463                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$85)
   10464                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
   10465              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
   10466                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$29)
   10467                      .dwattr $C$DW$T$43, DW_AT_address_class(0x17)
   10468              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   10469                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
   10470              
   10471              $C$DW$T$49      .dwtag  DW_TAG_subroutine_type
   10472                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
   10473              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10474                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
   10475                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   10476              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
   10477                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$50)
   10478                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10479              $C$DW$773       .dwtag  DW_TAG_TI_far_type
   10480              $C$DW$T$110     .dwtag  DW_TAG_const_type
   10481                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$773)
   10482              $C$DW$T$111     .dwtag  DW_TAG_pointer_type
   10483                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   10484                      .dwattr $C$DW$T$111, DW_AT_address_class(0x17)
   10485              $C$DW$T$4       .dwtag  DW_TAG_base_type
   10486                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   10487                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   10488                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   10489              $C$DW$T$5       .dwtag  DW_TAG_base_type
   10490                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   10491                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   10492                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   10493              $C$DW$T$6       .dwtag  DW_TAG_base_type
   10494                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   10495                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   10496                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   10497              $C$DW$T$7       .dwtag  DW_TAG_base_type
   10498                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   10499                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   10500                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
   10501              $C$DW$T$8       .dwtag  DW_TAG_base_type
   10502                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   10503                      .dwattr $C$DW$T$8, DW_AT_name("short")
   10504                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  251

   10505              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
   10506                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
   10507                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   10508              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
   10509                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   10510                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
