TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE    1

    1611              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:24 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     734 00024d E604          MOV #0, *SP(#2) ; |376| 
         00024f 00   
     735                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 378,column 2,is_stmt
     736 000250 ED00          MOV dbl(*SP(#0)), XAR3
         000252 BF   
     737              
     738 000253 90B0          MOV XAR3, AC0
     739 000255 3D01  ||      MOV #0, AC1 ; |378| 
     740              
     741 000257 121C          CMPU AC1 != AC0, TC1 ; |378| 
         000259 04   
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   17

     742 00025a 6464          BCC $C$L17,TC1 ; |378| 
     743                                                      ; branchcc occurs ; |378| 
     744                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 380,column 3,is_stmt
     745 00025c E604          MOV #-5, *SP(#2) ; |380| 
         00025e FB   
     746                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 381,column 3,is_stmt
     747 00025f A404          MOV *SP(#2), T0 ; |381| 
     748 000261 0600          B $C$L18  ; |381| 
         000263 4C   
     749                                                      ; branch occurs ; |381| 
     750 000264       $C$L17:    
     751                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 385,column 5,is_stmt
     752 000264 7600          MOV #31, T0 ; |385| 
         000266 1F48 
     753 000268 AB79          MOV *AR3(short(#4)), AR3 ; |385| 
     754 00026a A96B          MOV port(*AR3(T0)), AR1 ; |385| 
         00026c 99   
     755 00026d ED00          MOV dbl(*SP(#0)), XAR3
         00026f BF   
     756 000270 AB79          MOV *AR3(short(#4)), AR3 ; |385| 
     757 000272 EC00          BCLR @#0, AR1 ; |385| 
         000274 92   
     758 000275 C96B          MOV AR1, port(*AR3(T0)) ; |385| 
         000277 9A   
     759                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 388,column 5,is_stmt
     760 000278 ED00          MOV dbl(*SP(#0)), XAR3
         00027a BF   
     761 00027b 7600          MOV #32, T0 ; |388| 
         00027d 2048 
     762 00027f AB79          MOV *AR3(short(#4)), AR3 ; |388| 
     763 000281 FB6B          MOV #4096, port(*AR3(T0)) ; |388| 
         000283 1000 
         000285 9A   
     764                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 389,column 2,is_stmt
     765 000286 ED00          MOV dbl(*SP(#0)), XAR3
         000288 BF   
     766 000289 7600          MOV #33, T0 ; |389| 
         00028b 2148 
     767 00028d AB79          MOV *AR3(short(#4)), AR3 ; |389| 
     768 00028f E66B          MOV #0, port(*AR3(T0)) ; |389| 
         000291 00   
         000292 9A   
     769                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 390,column 2,is_stmt
     770 000293 ED00          MOV dbl(*SP(#0)), XAR3
         000295 BF   
     771 000296 7600          MOV #35, T0 ; |390| 
         000298 2348 
     772 00029a AB79          MOV *AR3(short(#4)), AR3 ; |390| 
     773 00029c E66B          MOV #0, port(*AR3(T0)) ; |390| 
         00029e 00   
         00029f 9A   
     774                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 391,column 2,is_stmt
     775 0002a0 ED00          MOV dbl(*SP(#0)), XAR3
         0002a2 BF   
     776 0002a3 7600          MOV #34, T0 ; |391| 
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   18

         0002a5 2248 
     777 0002a7 AB79          MOV *AR3(short(#4)), AR3 ; |391| 
     778 0002a9 FB6B          MOV #2054, port(*AR3(T0)) ; |391| 
         0002ab 0806 
         0002ad 9A   
     779                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 393,column 2,is_stmt
     780 0002ae A404          MOV *SP(#2), T0 ; |393| 
     781 0002b0       $C$L18:    
     782                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 394,column 1,is_stmt
     783 0002b0 4E03          AADD #3, SP
     784                      .dwcfi  cfa_offset, 1
     785              $C$DW$44        .dwtag  DW_TAG_TI_branch
     786                      .dwattr $C$DW$44, DW_AT_low_pc(0x00)
     787                      .dwattr $C$DW$44, DW_AT_TI_return
     788 0002b2 4804          RET
     789                                                      ; return occurs
     790                      .dwattr $C$DW$40, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c")
     791                      .dwattr $C$DW$40, DW_AT_TI_end_line(0x18a)
     792                      .dwattr $C$DW$40, DW_AT_TI_end_column(0x01)
     793                      .dwendentry
     794                      .dwendtag $C$DW$40
     795              
     796              
     797              ;*******************************************************************************
     798              ;* TYPE INFORMATION                                                            *
     799              ;*******************************************************************************
     800              
     801              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     802                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     803              $C$DW$45        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$45, DW_AT_name("PLLCNTL1")
     806                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PLLCNTL1")
     807                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$46        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$46, DW_AT_name("PLLINCNTL")
     812                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PLLINCNTL")
     813                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     814                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     815              $C$DW$47        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$47, DW_AT_name("PLLCNTL2")
     818                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_PLLCNTL2")
     819                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     820                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$48        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     823                      .dwattr $C$DW$48, DW_AT_name("PLLOUTCNTL")
     824                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_PLLOUTCNTL")
     825                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     826                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     827                      .dwendtag $C$DW$T$20
     828              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   19

     829              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
     830                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
     831                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     832              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     833                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     834                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     835              
     836              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     837                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
     838              $C$DW$49        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     840                      .dwattr $C$DW$49, DW_AT_name("EBSR")
     841                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_EBSR")
     842                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     844              $C$DW$50        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     846                      .dwattr $C$DW$50, DW_AT_name("RSVD0")
     847                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_RSVD0")
     848                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     849                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     850              $C$DW$51        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     852                      .dwattr $C$DW$51, DW_AT_name("PCGCR1")
     853                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PCGCR1")
     854                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     855                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$52        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     858                      .dwattr $C$DW$52, DW_AT_name("PCGCR2")
     859                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PCGCR2")
     860                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     861                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     862              $C$DW$53        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     864                      .dwattr $C$DW$53, DW_AT_name("PSRCR")
     865                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PSRCR")
     866                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     867                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$54        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     870                      .dwattr $C$DW$54, DW_AT_name("PRCR")
     871                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PRCR")
     872                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     873                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$55        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
     876                      .dwattr $C$DW$55, DW_AT_name("RSVD1")
     877                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RSVD1")
     878                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     879                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$56        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     882                      .dwattr $C$DW$56, DW_AT_name("TIAFR")
     883                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_TIAFR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   20

     884                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     885                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$57        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     888                      .dwattr $C$DW$57, DW_AT_name("RSVD2")
     889                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_RSVD2")
     890                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     891                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     892              $C$DW$58        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     894                      .dwattr $C$DW$58, DW_AT_name("ODSCR")
     895                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ODSCR")
     896                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     897                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$59        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     900                      .dwattr $C$DW$59, DW_AT_name("PDINHIBR1")
     901                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PDINHIBR1")
     902                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     903                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     904              $C$DW$60        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     906                      .dwattr $C$DW$60, DW_AT_name("PDINHIBR2")
     907                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PDINHIBR2")
     908                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     909                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$61        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     912                      .dwattr $C$DW$61, DW_AT_name("PDINHIBR3")
     913                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PDINHIBR3")
     914                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     915                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$62        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     918                      .dwattr $C$DW$62, DW_AT_name("DMA0CESR1")
     919                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_DMA0CESR1")
     920                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     921                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$63        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     924                      .dwattr $C$DW$63, DW_AT_name("DMA0CESR2")
     925                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_DMA0CESR2")
     926                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     927                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$64        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     930                      .dwattr $C$DW$64, DW_AT_name("DMA1CESR1")
     931                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_DMA1CESR1")
     932                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     933                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$65        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     936                      .dwattr $C$DW$65, DW_AT_name("DMA1CESR2")
     937                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_DMA1CESR2")
     938                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   21

     939                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$66        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     942                      .dwattr $C$DW$66, DW_AT_name("SDRAMCCR")
     943                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SDRAMCCR")
     944                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     945                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     946              $C$DW$67        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     948                      .dwattr $C$DW$67, DW_AT_name("CCR2")
     949                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CCR2")
     950                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     951                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$68        .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     954                      .dwattr $C$DW$68, DW_AT_name("CGCR1")
     955                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CGCR1")
     956                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     957                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$69        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     960                      .dwattr $C$DW$69, DW_AT_name("CGICR")
     961                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CGICR")
     962                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     963                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$70        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     966                      .dwattr $C$DW$70, DW_AT_name("CGCR2")
     967                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CGCR2")
     968                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     969                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$71        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     972                      .dwattr $C$DW$71, DW_AT_name("CGOCR")
     973                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CGOCR")
     974                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     975                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$72        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     978                      .dwattr $C$DW$72, DW_AT_name("CCSSR")
     979                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CCSSR")
     980                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     981                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$73        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     984                      .dwattr $C$DW$73, DW_AT_name("RSVD3")
     985                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_RSVD3")
     986                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     987                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$74        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     990                      .dwattr $C$DW$74, DW_AT_name("ECDR")
     991                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ECDR")
     992                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     993                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   22

     994              $C$DW$75        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     996                      .dwattr $C$DW$75, DW_AT_name("RSVD4")
     997                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RSVD4")
     998                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     999                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$76        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1002                      .dwattr $C$DW$76, DW_AT_name("RAMSLPMDCNTLR1")
    1003                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1004                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1005                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$77        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1008                      .dwattr $C$DW$77, DW_AT_name("RSVD5")
    1009                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RSVD5")
    1010                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1011                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$78        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1014                      .dwattr $C$DW$78, DW_AT_name("RAMSLPMDCNTLR2")
    1015                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1016                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1017                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$79        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1020                      .dwattr $C$DW$79, DW_AT_name("RAMSLPMDCNTLR3")
    1021                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1022                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1023                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$80        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1026                      .dwattr $C$DW$80, DW_AT_name("RAMSLPMDCNTLR4")
    1027                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1028                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1029                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$81        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1032                      .dwattr $C$DW$81, DW_AT_name("RAMSLPMDCNTLR5")
    1033                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1034                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1035                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$82        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
    1038                      .dwattr $C$DW$82, DW_AT_name("RSVD6")
    1039                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_RSVD6")
    1040                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1041                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$83        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1044                      .dwattr $C$DW$83, DW_AT_name("DMAIFR")
    1045                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_DMAIFR")
    1046                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1047                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$84        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   23

    1049                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1050                      .dwattr $C$DW$84, DW_AT_name("DMAIER")
    1051                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_DMAIER")
    1052                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1053                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$85        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1056                      .dwattr $C$DW$85, DW_AT_name("USBSCR")
    1057                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_USBSCR")
    1058                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1059                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1060              $C$DW$86        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1062                      .dwattr $C$DW$86, DW_AT_name("ESCR")
    1063                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ESCR")
    1064                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1065                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$87        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    1068                      .dwattr $C$DW$87, DW_AT_name("RSVD7")
    1069                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD7")
    1070                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1071                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$88        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1074                      .dwattr $C$DW$88, DW_AT_name("DMA2CESR1")
    1075                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_DMA2CESR1")
    1076                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1077                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$89        .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1080                      .dwattr $C$DW$89, DW_AT_name("DMA2CESR2")
    1081                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_DMA2CESR2")
    1082                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1083                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$90        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1086                      .dwattr $C$DW$90, DW_AT_name("DMA3CESR1")
    1087                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_DMA3CESR1")
    1088                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1089                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$91        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1092                      .dwattr $C$DW$91, DW_AT_name("DMA3CESR2")
    1093                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_DMA3CESR2")
    1094                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1095                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$92        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1098                      .dwattr $C$DW$92, DW_AT_name("CLKSTOP")
    1099                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CLKSTOP")
    1100                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1101                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$93        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   24

    1104                      .dwattr $C$DW$93, DW_AT_name("RSVD8")
    1105                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RSVD8")
    1106                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1107                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$94        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1110                      .dwattr $C$DW$94, DW_AT_name("DIEIDR0")
    1111                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_DIEIDR0")
    1112                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1113                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$95        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1116                      .dwattr $C$DW$95, DW_AT_name("DIEIDR1")
    1117                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_DIEIDR1")
    1118                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1119                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$96        .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1122                      .dwattr $C$DW$96, DW_AT_name("DIEIDR2")
    1123                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_DIEIDR2")
    1124                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1125                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$97        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1128                      .dwattr $C$DW$97, DW_AT_name("DIEIDR3")
    1129                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_DIEIDR3")
    1130                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1131                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$98        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1134                      .dwattr $C$DW$98, DW_AT_name("DIEIDR4")
    1135                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_DIEIDR4")
    1136                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1137                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$99        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1140                      .dwattr $C$DW$99, DW_AT_name("DIEIDR5")
    1141                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DIEIDR5")
    1142                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1143                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$100       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1146                      .dwattr $C$DW$100, DW_AT_name("DIEIDR6")
    1147                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DIEIDR6")
    1148                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1149                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$101       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1152                      .dwattr $C$DW$101, DW_AT_name("DIEIDR7")
    1153                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_DIEIDR7")
    1154                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1155                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1156                      .dwendtag $C$DW$T$25
    1157              
    1158              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   25

    1159                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    1160                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1161              $C$DW$102       .dwtag  DW_TAG_TI_far_type
    1162                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1163              $C$DW$103       .dwtag  DW_TAG_TI_ioport_type
    1164                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$102)
    1165              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1166                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$103)
    1167              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1168                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1169                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    1170              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1171                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1172                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1173              
    1174              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1175                      .dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
    1176                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    1177              $C$DW$104       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    1179                      .dwattr $C$DW$104, DW_AT_name("pllConfig")
    1180                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_pllConfig")
    1181                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$105       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1185                      .dwattr $C$DW$105, DW_AT_name("instId")
    1186                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_instId")
    1187                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1188                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$106       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$32)
    1191                      .dwattr $C$DW$106, DW_AT_name("sysAddr")
    1192                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_sysAddr")
    1193                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1194                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1195                      .dwendtag $C$DW$T$33
    1196              
    1197              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    1198                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1199                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1200              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1201                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1202                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1203              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1204                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1205                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    1206              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    1207                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1208                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1209              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1210                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1211                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1212                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1213              $C$DW$T$5       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   26

    1214                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1215                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1216                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1217              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1218                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1219                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1220                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1221              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1222                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1223                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1224                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1225              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1226                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1227                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1228                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1229              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1230                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$8)
    1231                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1232              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1233                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1234                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1235              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1236                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1237                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1238                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1239              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1240                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1241                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1242              $C$DW$107       .dwtag  DW_TAG_TI_far_type
    1243                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1244              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
