TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE    1

    2656              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:59 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1365                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1366                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1367              
    1368              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1369                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1370              $C$DW$39        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1371              $C$DW$40        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1372              $C$DW$41        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1373              $C$DW$42        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1374              $C$DW$43        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1375                      .dwendtag $C$DW$T$32
    1376              
    1377              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1378                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1379                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1380              
    1381              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1382                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1383              $C$DW$44        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1384              $C$DW$45        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1385                      .dwendtag $C$DW$T$38
    1386              
    1387              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1388                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1389                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1390              
    1391              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1392                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1393              $C$DW$46        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1394              $C$DW$47        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1395              $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1396              $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1397              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1398                      .dwendtag $C$DW$T$41
    1399              
    1400              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1401                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1402                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1403              
    1404              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1405                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   36

    1406              $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1407              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1408                      .dwendtag $C$DW$T$43
    1409              
    1410              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1411                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1412                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1413              
    1414              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1415                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1416              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1417              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1418                      .dwendtag $C$DW$T$45
    1419              
    1420              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1421                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1422                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1423              
    1424              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1425                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1426              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
    1427              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1428                      .dwendtag $C$DW$T$47
    1429              
    1430              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1431                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1432                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1433              
    1434              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1435                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1436              $C$DW$57        .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    1438                      .dwattr $C$DW$57, DW_AT_name("LCDREVMIN")
    1439                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_LCDREVMIN")
    1440                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$58        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
    1444                      .dwattr $C$DW$58, DW_AT_name("LCDREVMAJ")
    1445                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1446                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1447                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$59        .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
    1450                      .dwattr $C$DW$59, DW_AT_name("RSVD0")
    1451                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_RSVD0")
    1452                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1453                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$60        .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
    1456                      .dwattr $C$DW$60, DW_AT_name("LCDCR")
    1457                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_LCDCR")
    1458                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1459                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$61        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   37

    1461                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
    1462                      .dwattr $C$DW$61, DW_AT_name("RSVD1")
    1463                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_RSVD1")
    1464                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1465                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$62        .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
    1468                      .dwattr $C$DW$62, DW_AT_name("LCDSR")
    1469                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_LCDSR")
    1470                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1471                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$63        .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
    1474                      .dwattr $C$DW$63, DW_AT_name("RSVD2")
    1475                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_RSVD2")
    1476                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1477                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$64        .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1480                      .dwattr $C$DW$64, DW_AT_name("LCDLIDDCR")
    1481                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1482                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1483                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$65        .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
    1486                      .dwattr $C$DW$65, DW_AT_name("RSVD3")
    1487                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD3")
    1488                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1489                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$66        .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    1492                      .dwattr $C$DW$66, DW_AT_name("LCDLIDDCS0CONFIG0")
    1493                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1494                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1495                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$67        .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1498                      .dwattr $C$DW$67, DW_AT_name("LCDLIDDCS0CONFIG1")
    1499                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1500                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1501                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$68        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
    1504                      .dwattr $C$DW$68, DW_AT_name("RSVD4")
    1505                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_RSVD4")
    1506                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1507                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$69        .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$69, DW_AT_name("LCDLIDDCS0ADDR")
    1511                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1512                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1513                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$70        .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   38

    1516                      .dwattr $C$DW$70, DW_AT_name("RSVD5")
    1517                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_RSVD5")
    1518                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1519                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$71        .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1522                      .dwattr $C$DW$71, DW_AT_name("LCDLIDDCS0DATA")
    1523                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1524                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1525                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$72        .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1528                      .dwattr $C$DW$72, DW_AT_name("RSVD6")
    1529                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD6")
    1530                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1531                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$73        .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1534                      .dwattr $C$DW$73, DW_AT_name("LCDLIDDCS1CONFIG0")
    1535                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1536                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1537                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$74        .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1540                      .dwattr $C$DW$74, DW_AT_name("LCDLIDDCS1CONFIG1")
    1541                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    1542                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1543                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$75        .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1546                      .dwattr $C$DW$75, DW_AT_name("RSVD7")
    1547                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RSVD7")
    1548                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1549                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$76        .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1552                      .dwattr $C$DW$76, DW_AT_name("LCDLIDDCS1ADDR")
    1553                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1554                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1555                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$77        .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1558                      .dwattr $C$DW$77, DW_AT_name("RSVD8")
    1559                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RSVD8")
    1560                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1561                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$78        .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1564                      .dwattr $C$DW$78, DW_AT_name("LCDLIDDCS1DATA")
    1565                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1566                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1567                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$79        .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
    1570                      .dwattr $C$DW$79, DW_AT_name("RSVD9")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   39

    1571                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_RSVD9")
    1572                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1573                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$80        .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1576                      .dwattr $C$DW$80, DW_AT_name("LCDDMACR")
    1577                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_LCDDMACR")
    1578                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1579                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$81        .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1582                      .dwattr $C$DW$81, DW_AT_name("RSVD10")
    1583                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RSVD10")
    1584                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1585                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$82        .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1588                      .dwattr $C$DW$82, DW_AT_name("LCDDMAFB0BAR0")
    1589                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1590                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1591                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$83        .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1594                      .dwattr $C$DW$83, DW_AT_name("LCDDMAFB0BAR1")
    1595                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1596                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1597                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$84        .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1600                      .dwattr $C$DW$84, DW_AT_name("RSVD11")
    1601                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_RSVD11")
    1602                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1603                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$85        .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1606                      .dwattr $C$DW$85, DW_AT_name("LCDDMAFB0CAR0")
    1607                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1608                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1609                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$86        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1612                      .dwattr $C$DW$86, DW_AT_name("LCDDMAFB0CAR1")
    1613                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1614                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1615                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$87        .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1618                      .dwattr $C$DW$87, DW_AT_name("RSVD12")
    1619                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD12")
    1620                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1621                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$88        .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1624                      .dwattr $C$DW$88, DW_AT_name("LCDDMAFB1BAR0")
    1625                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   40

    1626                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1627                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$89        .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1630                      .dwattr $C$DW$89, DW_AT_name("LCDDMAFB1BAR1")
    1631                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1632                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1633                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$90        .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1636                      .dwattr $C$DW$90, DW_AT_name("RSVD13")
    1637                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD13")
    1638                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1639                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$91        .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1642                      .dwattr $C$DW$91, DW_AT_name("LCDDMAFB1CAR0")
    1643                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1644                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1645                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$92        .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1648                      .dwattr $C$DW$92, DW_AT_name("LCDDMAFB1CAR1")
    1649                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1650                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1651                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1652                      .dwendtag $C$DW$T$24
    1653              
    1654              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1655                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$24)
    1656                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1657              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    1658                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$54)
    1659              $C$DW$94        .dwtag  DW_TAG_TI_ioport_type
    1660                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$93)
    1661              $C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1662                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$94)
    1663              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    1664                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1665                      .dwattr $C$DW$T$56, DW_AT_address_class(0x10)
    1666              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    1667                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1668                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1669              
    1670              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1671                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    1672              $C$DW$95        .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$95, DW_AT_name("clkDiv")
    1675                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_clkDiv")
    1676                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$96        .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    1680                      .dwattr $C$DW$96, DW_AT_name("fdoneIntEn")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   41

    1681                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_fdoneIntEn")
    1682                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1683                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$97        .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1686                      .dwattr $C$DW$97, DW_AT_name("dmaCs0Cs1")
    1687                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    1688                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1689                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$98        .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$30)
    1692                      .dwattr $C$DW$98, DW_AT_name("dmaEnable")
    1693                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_dmaEnable")
    1694                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1695                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$99        .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$31)
    1698                      .dwattr $C$DW$99, DW_AT_name("polControl")
    1699                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_polControl")
    1700                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1701                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$100       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$33)
    1704                      .dwattr $C$DW$100, DW_AT_name("modeSel")
    1705                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_modeSel")
    1706                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1707                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1708                      .dwendtag $C$DW$T$34
    1709              
    1710              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    1711                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    1712                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1713              
    1714              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1715                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    1716              $C$DW$101       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$101, DW_AT_name("wSu")
    1719                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_wSu")
    1720                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$102       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$102, DW_AT_name("wStrobe")
    1725                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_wStrobe")
    1726                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1727                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$103       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$103, DW_AT_name("wHold")
    1731                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_wHold")
    1732                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1733                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1734              $C$DW$104       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   42

    1736                      .dwattr $C$DW$104, DW_AT_name("rSu")
    1737                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rSu")
    1738                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1739                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$105       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$105, DW_AT_name("rStrobe")
    1743                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rStrobe")
    1744                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1745                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1746              $C$DW$106       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1748                      .dwattr $C$DW$106, DW_AT_name("rHold")
    1749                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rHold")
    1750                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1751                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$107       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$107, DW_AT_name("ta")
    1755                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ta")
    1756                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1757                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1758                      .dwendtag $C$DW$T$35
    1759              
    1760              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    1761                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    1762                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1763              
    1764              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1765                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    1766              $C$DW$108       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$3)
    1768                      .dwattr $C$DW$108, DW_AT_name("extendSetup")
    1769                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_extendSetup")
    1770                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$109       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1774                      .dwattr $C$DW$109, DW_AT_name("config")
    1775                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_config")
    1776                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1777                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1778              $C$DW$110       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$37)
    1780                      .dwattr $C$DW$110, DW_AT_name("timingCs0")
    1781                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_timingCs0")
    1782                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1783                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$111       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$39)
    1786                      .dwattr $C$DW$111, DW_AT_name("useCs1")
    1787                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_useCs1")
    1788                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1789                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1790              $C$DW$112       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   43

    1791                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$37)
    1792                      .dwattr $C$DW$112, DW_AT_name("timingCs1")
    1793                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_timingCs1")
    1794                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1795                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1796                      .dwendtag $C$DW$T$40
    1797              
    1798              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    1799                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$40)
    1800                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1801              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1802                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1803                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    1804              
    1805              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1806                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    1807              $C$DW$113       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$42)
    1809                      .dwattr $C$DW$113, DW_AT_name("burstSize")
    1810                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_burstSize")
    1811                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$114       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$44)
    1815                      .dwattr $C$DW$114, DW_AT_name("eofIntEn")
    1816                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_eofIntEn")
    1817                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1818                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$115       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$46)
    1821                      .dwattr $C$DW$115, DW_AT_name("bigEndian")
    1822                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bigEndian")
    1823                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1824                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$116       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$48)
    1827                      .dwattr $C$DW$116, DW_AT_name("frameMode")
    1828                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_frameMode")
    1829                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1830                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$117       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$49)
    1833                      .dwattr $C$DW$117, DW_AT_name("fb0Base")
    1834                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_fb0Base")
    1835                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1836                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$118       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$49)
    1839                      .dwattr $C$DW$118, DW_AT_name("fb0Ceil")
    1840                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_fb0Ceil")
    1841                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1842                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$119       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$49)
    1845                      .dwattr $C$DW$119, DW_AT_name("fb1Base")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   44

    1846                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_fb1Base")
    1847                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1848                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$120       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$49)
    1851                      .dwattr $C$DW$120, DW_AT_name("fb1Ceil")
    1852                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_fb1Ceil")
    1853                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1854                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1855                      .dwendtag $C$DW$T$50
    1856              
    1857              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    1858                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$50)
    1859                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1860              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1861                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1862                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1863              
    1864              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1865                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    1866              $C$DW$121       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1868                      .dwattr $C$DW$121, DW_AT_name("EBSR")
    1869                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_EBSR")
    1870                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$122       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1874                      .dwattr $C$DW$122, DW_AT_name("RSVD0")
    1875                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD0")
    1876                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1877                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$123       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1880                      .dwattr $C$DW$123, DW_AT_name("PCGCR1")
    1881                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PCGCR1")
    1882                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1883                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$124       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1886                      .dwattr $C$DW$124, DW_AT_name("PCGCR2")
    1887                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PCGCR2")
    1888                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1889                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1890              $C$DW$125       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1892                      .dwattr $C$DW$125, DW_AT_name("PSRCR")
    1893                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PSRCR")
    1894                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1895                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1896              $C$DW$126       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1898                      .dwattr $C$DW$126, DW_AT_name("PRCR")
    1899                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PRCR")
    1900                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   45

    1901                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1902              $C$DW$127       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$51)
    1904                      .dwattr $C$DW$127, DW_AT_name("RSVD1")
    1905                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RSVD1")
    1906                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1907                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1908              $C$DW$128       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1910                      .dwattr $C$DW$128, DW_AT_name("TIAFR")
    1911                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_TIAFR")
    1912                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1913                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1914              $C$DW$129       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1916                      .dwattr $C$DW$129, DW_AT_name("RSVD2")
    1917                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD2")
    1918                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1919                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$130       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1922                      .dwattr $C$DW$130, DW_AT_name("ODSCR")
    1923                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ODSCR")
    1924                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1925                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$131       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1928                      .dwattr $C$DW$131, DW_AT_name("PDINHIBR1")
    1929                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PDINHIBR1")
    1930                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1931                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$132       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1934                      .dwattr $C$DW$132, DW_AT_name("PDINHIBR2")
    1935                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PDINHIBR2")
    1936                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1937                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$133       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1940                      .dwattr $C$DW$133, DW_AT_name("PDINHIBR3")
    1941                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PDINHIBR3")
    1942                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1943                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$134       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1946                      .dwattr $C$DW$134, DW_AT_name("DMA0CESR1")
    1947                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_DMA0CESR1")
    1948                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1949                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$135       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1952                      .dwattr $C$DW$135, DW_AT_name("DMA0CESR2")
    1953                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_DMA0CESR2")
    1954                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1955                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   46

    1956              $C$DW$136       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1958                      .dwattr $C$DW$136, DW_AT_name("DMA1CESR1")
    1959                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DMA1CESR1")
    1960                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1961                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$137       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1964                      .dwattr $C$DW$137, DW_AT_name("DMA1CESR2")
    1965                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DMA1CESR2")
    1966                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1967                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1968              $C$DW$138       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1970                      .dwattr $C$DW$138, DW_AT_name("SDRAMCCR")
    1971                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SDRAMCCR")
    1972                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1973                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$139       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1976                      .dwattr $C$DW$139, DW_AT_name("CCR2")
    1977                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CCR2")
    1978                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1979                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1980              $C$DW$140       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1982                      .dwattr $C$DW$140, DW_AT_name("CGCR1")
    1983                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CGCR1")
    1984                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1985                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1986              $C$DW$141       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1988                      .dwattr $C$DW$141, DW_AT_name("CGICR")
    1989                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CGICR")
    1990                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1991                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$142       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1994                      .dwattr $C$DW$142, DW_AT_name("CGCR2")
    1995                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CGCR2")
    1996                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1997                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$143       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2000                      .dwattr $C$DW$143, DW_AT_name("CGOCR")
    2001                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CGOCR")
    2002                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2003                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$144       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2006                      .dwattr $C$DW$144, DW_AT_name("CCSSR")
    2007                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CCSSR")
    2008                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2009                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$145       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   47

    2011                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2012                      .dwattr $C$DW$145, DW_AT_name("RSVD3")
    2013                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RSVD3")
    2014                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2015                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$146       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    2018                      .dwattr $C$DW$146, DW_AT_name("ECDR")
    2019                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ECDR")
    2020                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2021                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$147       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    2024                      .dwattr $C$DW$147, DW_AT_name("RSVD4")
    2025                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RSVD4")
    2026                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2027                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$148       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2030                      .dwattr $C$DW$148, DW_AT_name("RAMSLPMDCNTLR1")
    2031                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2032                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2033                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$149       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2036                      .dwattr $C$DW$149, DW_AT_name("RSVD5")
    2037                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_RSVD5")
    2038                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2039                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$150       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    2042                      .dwattr $C$DW$150, DW_AT_name("RAMSLPMDCNTLR2")
    2043                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2044                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2045                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2046              $C$DW$151       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2048                      .dwattr $C$DW$151, DW_AT_name("RAMSLPMDCNTLR3")
    2049                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2050                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2051                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$152       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2054                      .dwattr $C$DW$152, DW_AT_name("RAMSLPMDCNTLR4")
    2055                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2056                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2057                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$153       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2060                      .dwattr $C$DW$153, DW_AT_name("RAMSLPMDCNTLR5")
    2061                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2062                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2063                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2064              $C$DW$154       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   48

    2066                      .dwattr $C$DW$154, DW_AT_name("RSVD6")
    2067                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_RSVD6")
    2068                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2069                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$155       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2072                      .dwattr $C$DW$155, DW_AT_name("DMAIFR")
    2073                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMAIFR")
    2074                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2075                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2076              $C$DW$156       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2078                      .dwattr $C$DW$156, DW_AT_name("DMAIER")
    2079                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMAIER")
    2080                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2081                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$157       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2084                      .dwattr $C$DW$157, DW_AT_name("USBSCR")
    2085                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_USBSCR")
    2086                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2087                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$158       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2090                      .dwattr $C$DW$158, DW_AT_name("ESCR")
    2091                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ESCR")
    2092                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2093                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$159       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2096                      .dwattr $C$DW$159, DW_AT_name("RSVD7")
    2097                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RSVD7")
    2098                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2099                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$160       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2102                      .dwattr $C$DW$160, DW_AT_name("DMA2CESR1")
    2103                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DMA2CESR1")
    2104                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2105                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2106              $C$DW$161       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2108                      .dwattr $C$DW$161, DW_AT_name("DMA2CESR2")
    2109                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DMA2CESR2")
    2110                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2111                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$162       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2114                      .dwattr $C$DW$162, DW_AT_name("DMA3CESR1")
    2115                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DMA3CESR1")
    2116                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2117                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2118              $C$DW$163       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2120                      .dwattr $C$DW$163, DW_AT_name("DMA3CESR2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   49

    2121                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMA3CESR2")
    2122                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2123                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$164       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2126                      .dwattr $C$DW$164, DW_AT_name("CLKSTOP")
    2127                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CLKSTOP")
    2128                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2129                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2130              $C$DW$165       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$52)
    2132                      .dwattr $C$DW$165, DW_AT_name("RSVD8")
    2133                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD8")
    2134                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2135                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$166       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2138                      .dwattr $C$DW$166, DW_AT_name("DIEIDR0")
    2139                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_DIEIDR0")
    2140                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2141                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$167       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2144                      .dwattr $C$DW$167, DW_AT_name("DIEIDR1")
    2145                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DIEIDR1")
    2146                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2147                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$168       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2150                      .dwattr $C$DW$168, DW_AT_name("DIEIDR2")
    2151                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DIEIDR2")
    2152                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2153                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$169       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2156                      .dwattr $C$DW$169, DW_AT_name("DIEIDR3")
    2157                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_DIEIDR3")
    2158                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2159                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$170       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2162                      .dwattr $C$DW$170, DW_AT_name("DIEIDR4")
    2163                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DIEIDR4")
    2164                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2165                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$171       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2168                      .dwattr $C$DW$171, DW_AT_name("DIEIDR5")
    2169                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_DIEIDR5")
    2170                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2171                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2172              $C$DW$172       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2174                      .dwattr $C$DW$172, DW_AT_name("DIEIDR6")
    2175                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DIEIDR6")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   50

    2176                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2177                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$173       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2180                      .dwattr $C$DW$173, DW_AT_name("DIEIDR7")
    2181                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DIEIDR7")
    2182                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2183                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2184                      .dwendtag $C$DW$T$53
    2185              
    2186              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2187                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$53)
    2188                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2189              $C$DW$174       .dwtag  DW_TAG_TI_far_type
    2190                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$65)
    2191              $C$DW$175       .dwtag  DW_TAG_TI_ioport_type
    2192                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$174)
    2193              $C$DW$T$66      .dwtag  DW_TAG_volatile_type
    2194                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$175)
    2195              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    2196                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2197                      .dwattr $C$DW$T$67, DW_AT_address_class(0x10)
    2198              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2199                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2200                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2201              
    2202              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2203                      .dwattr $C$DW$T$60, DW_AT_name("CSL_LcdcObj")
    2204                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    2205              $C$DW$176       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$57)
    2207                      .dwattr $C$DW$176, DW_AT_name("regs")
    2208                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_regs")
    2209                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$177       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$59)
    2213                      .dwattr $C$DW$177, DW_AT_name("perNum")
    2214                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_perNum")
    2215                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2216                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2217                      .dwendtag $C$DW$T$60
    2218              
    2219              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2220                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$60)
    2221                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2222              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2223                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2224                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    2225              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2226                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2227                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2228              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2229                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2230              $C$DW$T$4       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   51

    2231                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2232                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2233                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2234              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2235                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2236                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2237                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2238              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2239                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2240                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2241                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2242              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2243                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2244                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2245                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2246              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2247                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2248                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2249                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2250              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2251                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
    2252                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2253              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2254                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2255                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2256              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2257                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$58)
    2258                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2259              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2260                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2261                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    2262              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2263                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2264                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2265                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2266              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
