TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE    1

    3364              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:56 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2229                      .dwendtag $C$DW$T$50
    2230              
    2231              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataDelay")
    2232                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2233                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2234              
    2235              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    2236                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2237              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
    2238              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
    2239                      .dwendtag $C$DW$T$52
    2240              
    2241              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
    2242                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2243                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2244              
    2245              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    2246                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2247              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
    2248              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
    2249                      .dwendtag $C$DW$T$54
    2250              
    2251              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
    2252                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2253                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2254              
    2255              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
    2256                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    2257              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
    2258              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
    2259                      .dwendtag $C$DW$T$56
    2260              
    2261              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
    2262                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2263                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2264              
    2265              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2266                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2267              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
    2268              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
    2269              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
    2270              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
    2271              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   54

    2272              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
    2273              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
    2274              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
    2275                      .dwendtag $C$DW$T$58
    2276              
    2277              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
    2278                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2279                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2280              
    2281              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    2282                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
    2283              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
    2284              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
    2285                      .dwendtag $C$DW$T$60
    2286              
    2287              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
    2288                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2289                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2290              
    2291              $C$DW$T$62      .dwtag  DW_TAG_enumeration_type
    2292                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
    2293              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
    2294              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
    2295                      .dwendtag $C$DW$T$62
    2296              
    2297              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
    2298                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2299                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2300              
    2301              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2302                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x2e)
    2303              $C$DW$162       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2305                      .dwattr $C$DW$162, DW_AT_name("I2SSCTRL")
    2306                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_I2SSCTRL")
    2307                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2309              $C$DW$163       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2311                      .dwattr $C$DW$163, DW_AT_name("RSVD0")
    2312                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RSVD0")
    2313                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2314                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$164       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2317                      .dwattr $C$DW$164, DW_AT_name("I2SSRATE")
    2318                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_I2SSRATE")
    2319                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2320                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$165       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2323                      .dwattr $C$DW$165, DW_AT_name("RSVD1")
    2324                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD1")
    2325                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2326                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   55

    2327              $C$DW$166       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2329                      .dwattr $C$DW$166, DW_AT_name("I2STXLT0")
    2330                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_I2STXLT0")
    2331                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2332                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2333              $C$DW$167       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2335                      .dwattr $C$DW$167, DW_AT_name("I2STXLT1")
    2336                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_I2STXLT1")
    2337                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2338                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2339              $C$DW$168       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2341                      .dwattr $C$DW$168, DW_AT_name("RSVD2")
    2342                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD2")
    2343                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2344                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$169       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2347                      .dwattr $C$DW$169, DW_AT_name("I2STXRT0")
    2348                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_I2STXRT0")
    2349                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2350                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$170       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2353                      .dwattr $C$DW$170, DW_AT_name("I2STXRT1")
    2354                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_I2STXRT1")
    2355                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2356                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$171       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2359                      .dwattr $C$DW$171, DW_AT_name("RSVD3")
    2360                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD3")
    2361                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2362                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2363              $C$DW$172       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2365                      .dwattr $C$DW$172, DW_AT_name("I2SINTFL")
    2366                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_I2SINTFL")
    2367                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2368                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2369              $C$DW$173       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2371                      .dwattr $C$DW$173, DW_AT_name("RSVD4")
    2372                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD4")
    2373                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2374                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2375              $C$DW$174       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    2377                      .dwattr $C$DW$174, DW_AT_name("I2SINTMASK")
    2378                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_I2SINTMASK")
    2379                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2380                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$175       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   56

    2382                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2383                      .dwattr $C$DW$175, DW_AT_name("RSVD5")
    2384                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD5")
    2385                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2386                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2387              $C$DW$176       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2389                      .dwattr $C$DW$176, DW_AT_name("I2SRXLT0")
    2390                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_I2SRXLT0")
    2391                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2392                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2393              $C$DW$177       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2395                      .dwattr $C$DW$177, DW_AT_name("I2SRXLT1")
    2396                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_I2SRXLT1")
    2397                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2398                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$178       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2401                      .dwattr $C$DW$178, DW_AT_name("RSVD6")
    2402                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD6")
    2403                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2404                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$179       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2407                      .dwattr $C$DW$179, DW_AT_name("I2SRXRT0")
    2408                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_I2SRXRT0")
    2409                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2410                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2411              $C$DW$180       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2413                      .dwattr $C$DW$180, DW_AT_name("I2SRXRT1")
    2414                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_I2SRXRT1")
    2415                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2416                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2417                      .dwendtag $C$DW$T$24
    2418              
    2419              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
    2420                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
    2421                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2422              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    2423                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    2424              $C$DW$182       .dwtag  DW_TAG_TI_ioport_type
    2425                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$181)
    2426              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    2427                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$182)
    2428              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2429                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2430                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    2431              
    2432              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2433                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    2434              $C$DW$183       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    2436                      .dwattr $C$DW$183, DW_AT_name("i2sNum")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   57

    2437                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_i2sNum")
    2438                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$184       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
    2442                      .dwattr $C$DW$184, DW_AT_name("opMode")
    2443                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_opMode")
    2444                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2445                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2446              $C$DW$185       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2448                      .dwattr $C$DW$185, DW_AT_name("chType")
    2449                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_chType")
    2450                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2451                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2452              $C$DW$186       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$33)
    2454                      .dwattr $C$DW$186, DW_AT_name("hwRegs")
    2455                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_hwRegs")
    2456                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2457                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$187       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2460                      .dwattr $C$DW$187, DW_AT_name("configured")
    2461                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_configured")
    2462                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2463                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$188       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$35)
    2466                      .dwattr $C$DW$188, DW_AT_name("datapack")
    2467                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_datapack")
    2468                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2469                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$189       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$37)
    2472                      .dwattr $C$DW$189, DW_AT_name("fsDiv")
    2473                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_fsDiv")
    2474                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2475                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2476              $C$DW$190       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$39)
    2478                      .dwattr $C$DW$190, DW_AT_name("wordLen")
    2479                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_wordLen")
    2480                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2481                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$191       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$41)
    2484                      .dwattr $C$DW$191, DW_AT_name("loopBackMode")
    2485                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_loopBackMode")
    2486                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2487                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$192       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$42)
    2490                      .dwattr $C$DW$192, DW_AT_name("firstRead")
    2491                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_firstRead")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   58

    2492                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2493                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2494                      .dwendtag $C$DW$T$43
    2495              
    2496              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
    2497                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$43)
    2498                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2499              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2500                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2501                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    2502              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
    2503                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2504                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2505              
    2506              $C$DW$T$72      .dwtag  DW_TAG_array_type
    2507                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$68)
    2508                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2509                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x28)
    2510              $C$DW$193       .dwtag  DW_TAG_subrange_type
    2511                      .dwattr $C$DW$193, DW_AT_upper_bound(0x03)
    2512                      .dwendtag $C$DW$T$72
    2513              
    2514              
    2515              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    2516                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    2517              $C$DW$194       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$45)
    2519                      .dwattr $C$DW$194, DW_AT_name("dataType")
    2520                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_dataType")
    2521                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$195       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$41)
    2525                      .dwattr $C$DW$195, DW_AT_name("loopBackMode")
    2526                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_loopBackMode")
    2527                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2528                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$196       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$47)
    2531                      .dwattr $C$DW$196, DW_AT_name("fsPol")
    2532                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_fsPol")
    2533                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2534                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$197       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$49)
    2537                      .dwattr $C$DW$197, DW_AT_name("clkPol")
    2538                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_clkPol")
    2539                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2540                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$198       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$51)
    2543                      .dwattr $C$DW$198, DW_AT_name("datadelay")
    2544                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_datadelay")
    2545                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2546                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   59

    2547              $C$DW$199       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$35)
    2549                      .dwattr $C$DW$199, DW_AT_name("datapack")
    2550                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_datapack")
    2551                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2552                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$200       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$53)
    2555                      .dwattr $C$DW$200, DW_AT_name("signext")
    2556                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_signext")
    2557                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2558                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$201       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$39)
    2561                      .dwattr $C$DW$201, DW_AT_name("wordLen")
    2562                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_wordLen")
    2563                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2564                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$202       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$55)
    2567                      .dwattr $C$DW$202, DW_AT_name("i2sMode")
    2568                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_i2sMode")
    2569                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2570                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$203       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$57)
    2573                      .dwattr $C$DW$203, DW_AT_name("dataFormat")
    2574                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_dataFormat")
    2575                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2576                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2577              $C$DW$204       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$37)
    2579                      .dwattr $C$DW$204, DW_AT_name("fsDiv")
    2580                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_fsDiv")
    2581                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2582                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$205       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$59)
    2585                      .dwattr $C$DW$205, DW_AT_name("clkDiv")
    2586                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_clkDiv")
    2587                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2588                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2589              $C$DW$206       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$61)
    2591                      .dwattr $C$DW$206, DW_AT_name("FError")
    2592                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_FError")
    2593                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2594                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$207       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$63)
    2597                      .dwattr $C$DW$207, DW_AT_name("OuError")
    2598                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_OuError")
    2599                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2600                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2601                      .dwendtag $C$DW$T$64
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   60

    2602              
    2603              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    2604                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$64)
    2605                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2606              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2607                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2608                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    2609              
    2610              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    2611                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x48)
    2612              $C$DW$208       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2614                      .dwattr $C$DW$208, DW_AT_name("EBSR")
    2615                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_EBSR")
    2616                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$209       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2620                      .dwattr $C$DW$209, DW_AT_name("RSVD0")
    2621                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD0")
    2622                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2623                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$210       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    2626                      .dwattr $C$DW$210, DW_AT_name("PCGCR1")
    2627                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PCGCR1")
    2628                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2629                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$211       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2632                      .dwattr $C$DW$211, DW_AT_name("PCGCR2")
    2633                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PCGCR2")
    2634                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2635                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$212       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2638                      .dwattr $C$DW$212, DW_AT_name("PSRCR")
    2639                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PSRCR")
    2640                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2641                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$213       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    2644                      .dwattr $C$DW$213, DW_AT_name("PRCR")
    2645                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_PRCR")
    2646                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2647                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$214       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$65)
    2650                      .dwattr $C$DW$214, DW_AT_name("RSVD1")
    2651                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RSVD1")
    2652                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2653                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$215       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2656                      .dwattr $C$DW$215, DW_AT_name("TIAFR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   61

    2657                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_TIAFR")
    2658                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2659                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$216       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2662                      .dwattr $C$DW$216, DW_AT_name("RSVD2")
    2663                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RSVD2")
    2664                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2665                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$217       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$217, DW_AT_name("ODSCR")
    2669                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ODSCR")
    2670                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2671                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$218       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2674                      .dwattr $C$DW$218, DW_AT_name("PDINHIBR1")
    2675                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PDINHIBR1")
    2676                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2677                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$219       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2680                      .dwattr $C$DW$219, DW_AT_name("PDINHIBR2")
    2681                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PDINHIBR2")
    2682                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2683                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$220       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2686                      .dwattr $C$DW$220, DW_AT_name("PDINHIBR3")
    2687                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PDINHIBR3")
    2688                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2689                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$221       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2692                      .dwattr $C$DW$221, DW_AT_name("DMA0CESR1")
    2693                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMA0CESR1")
    2694                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2695                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$222       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2698                      .dwattr $C$DW$222, DW_AT_name("DMA0CESR2")
    2699                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMA0CESR2")
    2700                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2701                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$223       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$223, DW_AT_name("DMA1CESR1")
    2705                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_DMA1CESR1")
    2706                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2707                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$224       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    2710                      .dwattr $C$DW$224, DW_AT_name("DMA1CESR2")
    2711                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_DMA1CESR2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   62

    2712                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2713                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$225       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$225, DW_AT_name("SDRAMCCR")
    2717                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_SDRAMCCR")
    2718                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2719                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$226       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$226, DW_AT_name("CCR2")
    2723                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_CCR2")
    2724                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2725                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$227       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2728                      .dwattr $C$DW$227, DW_AT_name("CGCR1")
    2729                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_CGCR1")
    2730                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2731                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$228       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$228, DW_AT_name("CGICR")
    2735                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_CGICR")
    2736                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2737                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$229       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2740                      .dwattr $C$DW$229, DW_AT_name("CGCR2")
    2741                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_CGCR2")
    2742                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2743                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$230       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2746                      .dwattr $C$DW$230, DW_AT_name("CGOCR")
    2747                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_CGOCR")
    2748                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2749                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$231       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$231, DW_AT_name("CCSSR")
    2753                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_CCSSR")
    2754                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2755                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$232       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2758                      .dwattr $C$DW$232, DW_AT_name("RSVD3")
    2759                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RSVD3")
    2760                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2761                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$233       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$233, DW_AT_name("ECDR")
    2765                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_ECDR")
    2766                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   63

    2767                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$234       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2770                      .dwattr $C$DW$234, DW_AT_name("RSVD4")
    2771                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RSVD4")
    2772                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2773                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$235       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$235, DW_AT_name("RAMSLPMDCNTLR1")
    2777                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2778                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2779                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$236       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2782                      .dwattr $C$DW$236, DW_AT_name("RSVD5")
    2783                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD5")
    2784                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2785                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$237       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    2788                      .dwattr $C$DW$237, DW_AT_name("RAMSLPMDCNTLR2")
    2789                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2790                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2791                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$238       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2794                      .dwattr $C$DW$238, DW_AT_name("RAMSLPMDCNTLR3")
    2795                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2796                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2797                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$239       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$239, DW_AT_name("RAMSLPMDCNTLR4")
    2801                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2802                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2803                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$240       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2806                      .dwattr $C$DW$240, DW_AT_name("RAMSLPMDCNTLR5")
    2807                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2808                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2809                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$241       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$22)
    2812                      .dwattr $C$DW$241, DW_AT_name("RSVD6")
    2813                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RSVD6")
    2814                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2815                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$242       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2818                      .dwattr $C$DW$242, DW_AT_name("DMAIFR")
    2819                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMAIFR")
    2820                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2821                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   64

    2822              $C$DW$243       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2824                      .dwattr $C$DW$243, DW_AT_name("DMAIER")
    2825                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMAIER")
    2826                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2827                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2828              $C$DW$244       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2830                      .dwattr $C$DW$244, DW_AT_name("USBSCR")
    2831                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_USBSCR")
    2832                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2833                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$245       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2836                      .dwattr $C$DW$245, DW_AT_name("ESCR")
    2837                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ESCR")
    2838                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2839                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$246       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    2842                      .dwattr $C$DW$246, DW_AT_name("RSVD7")
    2843                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD7")
    2844                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2845                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$247       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2848                      .dwattr $C$DW$247, DW_AT_name("DMA2CESR1")
    2849                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DMA2CESR1")
    2850                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2851                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2852              $C$DW$248       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2854                      .dwattr $C$DW$248, DW_AT_name("DMA2CESR2")
    2855                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DMA2CESR2")
    2856                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2857                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$249       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2860                      .dwattr $C$DW$249, DW_AT_name("DMA3CESR1")
    2861                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DMA3CESR1")
    2862                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2863                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$250       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2866                      .dwattr $C$DW$250, DW_AT_name("DMA3CESR2")
    2867                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DMA3CESR2")
    2868                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2869                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$251       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2872                      .dwattr $C$DW$251, DW_AT_name("CLKSTOP")
    2873                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_CLKSTOP")
    2874                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2875                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$252       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   65

    2877                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$66)
    2878                      .dwattr $C$DW$252, DW_AT_name("RSVD8")
    2879                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_RSVD8")
    2880                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2881                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$253       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2884                      .dwattr $C$DW$253, DW_AT_name("DIEIDR0")
    2885                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DIEIDR0")
    2886                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2887                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$254       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2890                      .dwattr $C$DW$254, DW_AT_name("DIEIDR1")
    2891                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DIEIDR1")
    2892                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2893                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$255       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2896                      .dwattr $C$DW$255, DW_AT_name("DIEIDR2")
    2897                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DIEIDR2")
    2898                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2899                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$256       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2902                      .dwattr $C$DW$256, DW_AT_name("DIEIDR3")
    2903                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DIEIDR3")
    2904                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2905                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$257       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2908                      .dwattr $C$DW$257, DW_AT_name("DIEIDR4")
    2909                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_DIEIDR4")
    2910                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2911                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$258       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2914                      .dwattr $C$DW$258, DW_AT_name("DIEIDR5")
    2915                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_DIEIDR5")
    2916                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2917                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$259       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2920                      .dwattr $C$DW$259, DW_AT_name("DIEIDR6")
    2921                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_DIEIDR6")
    2922                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2923                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$260       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2926                      .dwattr $C$DW$260, DW_AT_name("DIEIDR7")
    2927                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_DIEIDR7")
    2928                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2929                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2930                      .dwendtag $C$DW$T$67
    2931              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   66

    2932              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2933                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$67)
    2934                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2935              $C$DW$261       .dwtag  DW_TAG_TI_far_type
    2936                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$75)
    2937              $C$DW$262       .dwtag  DW_TAG_TI_ioport_type
    2938                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$261)
    2939              $C$DW$T$76      .dwtag  DW_TAG_volatile_type
    2940                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$262)
    2941              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2942                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2943                      .dwattr $C$DW$T$77, DW_AT_address_class(0x10)
    2944              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2945                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2946                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2947                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2948              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2949                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2950                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2951                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2952              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2953                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2954                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2955                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2956              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2957                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2958                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2959                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2960              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2961                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2962                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2963                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2964              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2965                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    2966                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2967              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2968                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    2969                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2970              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2971                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2972                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2973                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2974              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2975                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2976                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2977              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    2978                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2979              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    2980                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$263)
