TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE    1

    2655              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:35 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1652              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_MAX_WORD_LEN"), DW_AT_const_value(0x20)
    1653                      .dwendtag $C$DW$T$25
    1654              
    1655              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordLen")
    1656                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1657                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1658              
    1659              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1660                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1661              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1662              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1663                      .dwendtag $C$DW$T$27
    1664              
    1665              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordCntEnb")
    1666                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1667                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   37

    1668              
    1669              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    1670                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1671              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1672              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1673                      .dwendtag $C$DW$T$29
    1674              
    1675              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FrameCntEnb")
    1676                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1677                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1678              
    1679              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1680                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1681              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_0"), DW_AT_const_value(0x00)
    1682              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_1"), DW_AT_const_value(0x01)
    1683              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_2"), DW_AT_const_value(0x02)
    1684              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_3"), DW_AT_const_value(0x03)
    1685              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_UNKNOWN"), DW_AT_const_value(0x04)
    1686                      .dwendtag $C$DW$T$31
    1687              
    1688              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_DataDly")
    1689                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1690                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1691              
    1692              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1693                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1694              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_LOW_AT_IDLE"), DW_AT_const_value(0x00)
    1695              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_HIGH_AT_IDLE"), DW_AT_const_value(0x01)
    1696                      .dwendtag $C$DW$T$33
    1697              
    1698              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity")
    1699                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1700                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1701              
    1702              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1703                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1704              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_LOW"), DW_AT_const_value(0x00)
    1705              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_HIGH"), DW_AT_const_value(0x01)
    1706                      .dwendtag $C$DW$T$35
    1707              
    1708              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ChipSelPol")
    1709                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1710                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1711              
    1712              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1713                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1714              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_FALL_EDGE"), DW_AT_const_value(0x00)
    1715              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_RISE_EDGE"), DW_AT_const_value(0x01)
    1716                      .dwendtag $C$DW$T$37
    1717              
    1718              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPh")
    1719                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1720                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1721              
    1722              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   38

    1723                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1724              $C$DW$154       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$154, DW_AT_name("configured")
    1727                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_configured")
    1728                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$155       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1732                      .dwattr $C$DW$155, DW_AT_name("mode")
    1733                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_mode")
    1734                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1735                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$156       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    1738                      .dwattr $C$DW$156, DW_AT_name("opMode")
    1739                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_opMode")
    1740                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1741                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1742                      .dwendtag $C$DW$T$24
    1743              
    1744              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiObj")
    1745                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
    1746                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1747              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1748                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1749                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1750              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiHandle")
    1751                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1752                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1753              
    1754              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1755                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1756              $C$DW$157       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$157, DW_AT_name("spiClkDiv")
    1759                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_spiClkDiv")
    1760                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$158       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$26)
    1764                      .dwattr $C$DW$158, DW_AT_name("wLen")
    1765                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_wLen")
    1766                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1767                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$159       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$159, DW_AT_name("frLen")
    1771                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_frLen")
    1772                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1773                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1774              $C$DW$160       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$28)
    1776                      .dwattr $C$DW$160, DW_AT_name("wcEnable")
    1777                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_wcEnable")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   39

    1778                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1779                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$161       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$30)
    1782                      .dwattr $C$DW$161, DW_AT_name("fcEnable")
    1783                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_fcEnable")
    1784                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1785                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$162       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1788                      .dwattr $C$DW$162, DW_AT_name("csNum")
    1789                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_csNum")
    1790                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1791                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$163       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
    1794                      .dwattr $C$DW$163, DW_AT_name("dataDelay")
    1795                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_dataDelay")
    1796                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1797                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$164       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    1800                      .dwattr $C$DW$164, DW_AT_name("clkPol")
    1801                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_clkPol")
    1802                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1803                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1804              $C$DW$165       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$36)
    1806                      .dwattr $C$DW$165, DW_AT_name("csPol")
    1807                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_csPol")
    1808                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1809                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$166       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$38)
    1812                      .dwattr $C$DW$166, DW_AT_name("clkPh")
    1813                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_clkPh")
    1814                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1815                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1816                      .dwendtag $C$DW$T$39
    1817              
    1818              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Config")
    1819                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    1820                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1821              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1822                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1823                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
    1824              
    1825              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1826                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x48)
    1827              $C$DW$167       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$40)
    1829                      .dwattr $C$DW$167, DW_AT_name("EBSR")
    1830                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EBSR")
    1831                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   40

    1833              $C$DW$168       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$40)
    1835                      .dwattr $C$DW$168, DW_AT_name("RSVD0")
    1836                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD0")
    1837                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1838                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$169       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$40)
    1841                      .dwattr $C$DW$169, DW_AT_name("PCGCR1")
    1842                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCGCR1")
    1843                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1844                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$170       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1847                      .dwattr $C$DW$170, DW_AT_name("PCGCR2")
    1848                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCGCR2")
    1849                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1850                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$171       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1853                      .dwattr $C$DW$171, DW_AT_name("PSRCR")
    1854                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PSRCR")
    1855                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1856                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$172       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1859                      .dwattr $C$DW$172, DW_AT_name("PRCR")
    1860                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PRCR")
    1861                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1862                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$173       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$41)
    1865                      .dwattr $C$DW$173, DW_AT_name("RSVD1")
    1866                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD1")
    1867                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1868                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$174       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1871                      .dwattr $C$DW$174, DW_AT_name("TIAFR")
    1872                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_TIAFR")
    1873                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1874                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$175       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    1877                      .dwattr $C$DW$175, DW_AT_name("RSVD2")
    1878                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD2")
    1879                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1880                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$176       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$40)
    1883                      .dwattr $C$DW$176, DW_AT_name("ODSCR")
    1884                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ODSCR")
    1885                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1886                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$177       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   41

    1888                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1889                      .dwattr $C$DW$177, DW_AT_name("PDINHIBR1")
    1890                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PDINHIBR1")
    1891                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1892                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$178       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
    1895                      .dwattr $C$DW$178, DW_AT_name("PDINHIBR2")
    1896                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PDINHIBR2")
    1897                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1898                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$179       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    1901                      .dwattr $C$DW$179, DW_AT_name("PDINHIBR3")
    1902                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PDINHIBR3")
    1903                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1904                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$180       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$40)
    1907                      .dwattr $C$DW$180, DW_AT_name("DMA0CESR1")
    1908                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA0CESR1")
    1909                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1910                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$181       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    1913                      .dwattr $C$DW$181, DW_AT_name("DMA0CESR2")
    1914                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA0CESR2")
    1915                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1916                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$182       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1919                      .dwattr $C$DW$182, DW_AT_name("DMA1CESR1")
    1920                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMA1CESR1")
    1921                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1922                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$183       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1925                      .dwattr $C$DW$183, DW_AT_name("DMA1CESR2")
    1926                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMA1CESR2")
    1927                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1928                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$184       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1931                      .dwattr $C$DW$184, DW_AT_name("SDRAMCCR")
    1932                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SDRAMCCR")
    1933                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1934                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$185       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$40)
    1937                      .dwattr $C$DW$185, DW_AT_name("CCR2")
    1938                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CCR2")
    1939                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1940                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$186       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   42

    1943                      .dwattr $C$DW$186, DW_AT_name("CGCR1")
    1944                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CGCR1")
    1945                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1946                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$187       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    1949                      .dwattr $C$DW$187, DW_AT_name("CGICR")
    1950                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CGICR")
    1951                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1952                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$188       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    1955                      .dwattr $C$DW$188, DW_AT_name("CGCR2")
    1956                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CGCR2")
    1957                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1958                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$189       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    1961                      .dwattr $C$DW$189, DW_AT_name("CGOCR")
    1962                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CGOCR")
    1963                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1964                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$190       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$40)
    1967                      .dwattr $C$DW$190, DW_AT_name("CCSSR")
    1968                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CCSSR")
    1969                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1970                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$191       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$40)
    1973                      .dwattr $C$DW$191, DW_AT_name("RSVD3")
    1974                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD3")
    1975                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1976                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$192       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$40)
    1979                      .dwattr $C$DW$192, DW_AT_name("ECDR")
    1980                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ECDR")
    1981                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1982                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$193       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$40)
    1985                      .dwattr $C$DW$193, DW_AT_name("RSVD4")
    1986                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD4")
    1987                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1988                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$194       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$40)
    1991                      .dwattr $C$DW$194, DW_AT_name("RAMSLPMDCNTLR1")
    1992                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1993                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1994                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$195       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$40)
    1997                      .dwattr $C$DW$195, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   43

    1998                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD5")
    1999                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2000                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$196       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$40)
    2003                      .dwattr $C$DW$196, DW_AT_name("RAMSLPMDCNTLR2")
    2004                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2005                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2006                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$197       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    2009                      .dwattr $C$DW$197, DW_AT_name("RAMSLPMDCNTLR3")
    2010                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2011                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2012                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$198       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    2015                      .dwattr $C$DW$198, DW_AT_name("RAMSLPMDCNTLR4")
    2016                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2017                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2018                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$199       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    2021                      .dwattr $C$DW$199, DW_AT_name("RAMSLPMDCNTLR5")
    2022                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2023                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2024                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$200       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$42)
    2027                      .dwattr $C$DW$200, DW_AT_name("RSVD6")
    2028                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD6")
    2029                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2030                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$201       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$40)
    2033                      .dwattr $C$DW$201, DW_AT_name("DMAIFR")
    2034                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DMAIFR")
    2035                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2036                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$202       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$40)
    2039                      .dwattr $C$DW$202, DW_AT_name("DMAIER")
    2040                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DMAIER")
    2041                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2042                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2043              $C$DW$203       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$40)
    2045                      .dwattr $C$DW$203, DW_AT_name("USBSCR")
    2046                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_USBSCR")
    2047                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2048                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$204       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$40)
    2051                      .dwattr $C$DW$204, DW_AT_name("ESCR")
    2052                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ESCR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   44

    2053                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2054                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$205       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$42)
    2057                      .dwattr $C$DW$205, DW_AT_name("RSVD7")
    2058                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RSVD7")
    2059                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2060                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$206       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$40)
    2063                      .dwattr $C$DW$206, DW_AT_name("DMA2CESR1")
    2064                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA2CESR1")
    2065                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2066                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2067              $C$DW$207       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$40)
    2069                      .dwattr $C$DW$207, DW_AT_name("DMA2CESR2")
    2070                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DMA2CESR2")
    2071                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2072                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$208       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    2075                      .dwattr $C$DW$208, DW_AT_name("DMA3CESR1")
    2076                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMA3CESR1")
    2077                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2078                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$209       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$40)
    2081                      .dwattr $C$DW$209, DW_AT_name("DMA3CESR2")
    2082                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA3CESR2")
    2083                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2084                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2085              $C$DW$210       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$40)
    2087                      .dwattr $C$DW$210, DW_AT_name("CLKSTOP")
    2088                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CLKSTOP")
    2089                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2090                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$211       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$43)
    2093                      .dwattr $C$DW$211, DW_AT_name("RSVD8")
    2094                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD8")
    2095                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2096                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$212       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$40)
    2099                      .dwattr $C$DW$212, DW_AT_name("DIEIDR0")
    2100                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DIEIDR0")
    2101                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2102                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$213       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$40)
    2105                      .dwattr $C$DW$213, DW_AT_name("DIEIDR1")
    2106                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DIEIDR1")
    2107                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   45

    2108                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2109              $C$DW$214       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$40)
    2111                      .dwattr $C$DW$214, DW_AT_name("DIEIDR2")
    2112                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DIEIDR2")
    2113                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2114                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$215       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$40)
    2117                      .dwattr $C$DW$215, DW_AT_name("DIEIDR3")
    2118                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR3")
    2119                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2120                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$216       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$40)
    2123                      .dwattr $C$DW$216, DW_AT_name("DIEIDR4")
    2124                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR4")
    2125                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2126                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$217       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$40)
    2129                      .dwattr $C$DW$217, DW_AT_name("DIEIDR5")
    2130                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DIEIDR5")
    2131                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2132                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$218       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$40)
    2135                      .dwattr $C$DW$218, DW_AT_name("DIEIDR6")
    2136                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_DIEIDR6")
    2137                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2138                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2139              $C$DW$219       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$40)
    2141                      .dwattr $C$DW$219, DW_AT_name("DIEIDR7")
    2142                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DIEIDR7")
    2143                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2144                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2145                      .dwendtag $C$DW$T$44
    2146              
    2147              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2148                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$44)
    2149                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2150              $C$DW$220       .dwtag  DW_TAG_TI_far_type
    2151                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$52)
    2152              $C$DW$221       .dwtag  DW_TAG_TI_ioport_type
    2153                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$220)
    2154              $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    2155                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$221)
    2156              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2157                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2158                      .dwattr $C$DW$T$54, DW_AT_address_class(0x10)
    2159              
    2160              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2161                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    2162              $C$DW$222       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   46

    2163                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$40)
    2164                      .dwattr $C$DW$222, DW_AT_name("SPICDR")
    2165                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SPICDR")
    2166                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$223       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$40)
    2170                      .dwattr $C$DW$223, DW_AT_name("SPICCR")
    2171                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_SPICCR")
    2172                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2173                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$224       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$40)
    2176                      .dwattr $C$DW$224, DW_AT_name("SPIDCR1")
    2177                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_SPIDCR1")
    2178                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2179                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$225       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    2182                      .dwattr $C$DW$225, DW_AT_name("SPIDCR2")
    2183                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_SPIDCR2")
    2184                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2185                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$226       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$40)
    2188                      .dwattr $C$DW$226, DW_AT_name("SPICMD1")
    2189                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_SPICMD1")
    2190                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2191                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$227       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$40)
    2194                      .dwattr $C$DW$227, DW_AT_name("SPICMD2")
    2195                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SPICMD2")
    2196                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2197                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2198              $C$DW$228       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$40)
    2200                      .dwattr $C$DW$228, DW_AT_name("SPISTAT1")
    2201                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SPISTAT1")
    2202                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2203                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2204              $C$DW$229       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$40)
    2206                      .dwattr $C$DW$229, DW_AT_name("SPISTAT2")
    2207                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SPISTAT2")
    2208                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2209                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2210              $C$DW$230       .dwtag  DW_TAG_member
    2211                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$40)
    2212                      .dwattr $C$DW$230, DW_AT_name("SPIDR1")
    2213                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_SPIDR1")
    2214                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2215                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2216              $C$DW$231       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   47

    2218                      .dwattr $C$DW$231, DW_AT_name("SPIDR2")
    2219                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_SPIDR2")
    2220                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2221                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2222                      .dwendtag $C$DW$T$45
    2223              
    2224              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegs")
    2225                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$45)
    2226                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2227              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    2228                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$55)
    2229              $C$DW$233       .dwtag  DW_TAG_TI_ioport_type
    2230                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$232)
    2231              $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    2232                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$233)
    2233              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2234                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2235                      .dwattr $C$DW$T$57, DW_AT_address_class(0x10)
    2236              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegsOvly")
    2237                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2238                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2239              
    2240              $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2241                      .dwattr $C$DW$T$59, DW_AT_name("SPI_Command")
    2242                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
    2243              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD_CMD"), DW_AT_const_value(0x00)
    2244              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_READ"), DW_AT_const_value(0x01)
    2245              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WRITE"), DW_AT_const_value(0x02)
    2246              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD1_CMD"), DW_AT_const_value(0x03)
    2247                      .dwendtag $C$DW$T$59
    2248              
    2249              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Command")
    2250                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2251                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2252              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2253                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2254                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2255                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2256              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2257                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2258                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2259                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2260              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2261                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2262                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2263                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2264              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2265                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2266                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2267                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2268              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2269                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2270                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2271                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2272              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
