TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE    1

    5189              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:48 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4053                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4054              
    4055              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    4056                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  105

    4057              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
    4058              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
    4059                      .dwendtag $C$DW$T$43
    4060              
    4061              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
    4062                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4063                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4064              
    4065              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    4066                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4067              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
    4068              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
    4069              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
    4070              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
    4071              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    4072                      .dwendtag $C$DW$T$45
    4073              
    4074              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    4075                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4076                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4077              
    4078              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    4079                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    4080              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    4081              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    4082              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    4083              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    4084              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    4085              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    4086              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    4087              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    4088              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    4089              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    4090              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    4091              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    4092              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    4093              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    4094              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    4095              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    4096              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    4097              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    4098              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    4099              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    4100              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    4101              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    4102                      .dwendtag $C$DW$T$47
    4103              
    4104              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    4105                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4106                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4107              
    4108              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4109                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    4110              $C$DW$151       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  106

    4112                      .dwattr $C$DW$151, DW_AT_name("DMACH0SSAL")
    4113                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_DMACH0SSAL")
    4114                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4115                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$152       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    4118                      .dwattr $C$DW$152, DW_AT_name("DMACH0SSAU")
    4119                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DMACH0SSAU")
    4120                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4121                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$153       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    4124                      .dwattr $C$DW$153, DW_AT_name("DMACH0DSAL")
    4125                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DMACH0DSAL")
    4126                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4127                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$154       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    4130                      .dwattr $C$DW$154, DW_AT_name("DMACH0DSAU")
    4131                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DMACH0DSAU")
    4132                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4133                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$155       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    4136                      .dwattr $C$DW$155, DW_AT_name("DMACH0TCR1")
    4137                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMACH0TCR1")
    4138                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4139                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$156       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    4142                      .dwattr $C$DW$156, DW_AT_name("DMACH0TCR2")
    4143                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMACH0TCR2")
    4144                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4145                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$157       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    4148                      .dwattr $C$DW$157, DW_AT_name("RSVD0")
    4149                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RSVD0")
    4150                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4151                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$158       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    4154                      .dwattr $C$DW$158, DW_AT_name("DMACH1SSAL")
    4155                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DMACH1SSAL")
    4156                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4157                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$159       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    4160                      .dwattr $C$DW$159, DW_AT_name("DMACH1SSAU")
    4161                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_DMACH1SSAU")
    4162                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4163                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$160       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    4166                      .dwattr $C$DW$160, DW_AT_name("DMACH1DSAL")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  107

    4167                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DMACH1DSAL")
    4168                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4169                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$161       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    4172                      .dwattr $C$DW$161, DW_AT_name("DMACH1DSAU")
    4173                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DMACH1DSAU")
    4174                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4175                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$162       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    4178                      .dwattr $C$DW$162, DW_AT_name("DMACH1TCR1")
    4179                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DMACH1TCR1")
    4180                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4181                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$163       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    4184                      .dwattr $C$DW$163, DW_AT_name("DMACH1TCR2")
    4185                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMACH1TCR2")
    4186                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4187                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$164       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    4190                      .dwattr $C$DW$164, DW_AT_name("RSVD1")
    4191                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD1")
    4192                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4193                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$165       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    4196                      .dwattr $C$DW$165, DW_AT_name("DMACH2SSAL")
    4197                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DMACH2SSAL")
    4198                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4199                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$166       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    4202                      .dwattr $C$DW$166, DW_AT_name("DMACH2SSAU")
    4203                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_DMACH2SSAU")
    4204                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4205                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4206              $C$DW$167       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    4208                      .dwattr $C$DW$167, DW_AT_name("DMACH2DSAL")
    4209                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DMACH2DSAL")
    4210                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4211                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$168       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    4214                      .dwattr $C$DW$168, DW_AT_name("DMACH2DSAU")
    4215                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DMACH2DSAU")
    4216                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4217                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$169       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    4220                      .dwattr $C$DW$169, DW_AT_name("DMACH2TCR1")
    4221                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_DMACH2TCR1")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  108

    4222                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4223                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$170       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    4226                      .dwattr $C$DW$170, DW_AT_name("DMACH2TCR2")
    4227                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DMACH2TCR2")
    4228                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4229                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$171       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    4232                      .dwattr $C$DW$171, DW_AT_name("RSVD2")
    4233                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD2")
    4234                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4235                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$172       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    4238                      .dwattr $C$DW$172, DW_AT_name("DMACH3SSAL")
    4239                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DMACH3SSAL")
    4240                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4241                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4242              $C$DW$173       .dwtag  DW_TAG_member
    4243                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    4244                      .dwattr $C$DW$173, DW_AT_name("DMACH3SSAU")
    4245                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DMACH3SSAU")
    4246                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4247                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4248              $C$DW$174       .dwtag  DW_TAG_member
    4249                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    4250                      .dwattr $C$DW$174, DW_AT_name("DMACH3DSAL")
    4251                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_DMACH3DSAL")
    4252                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4253                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4254              $C$DW$175       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    4256                      .dwattr $C$DW$175, DW_AT_name("DMACH3DSAU")
    4257                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DMACH3DSAU")
    4258                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4259                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4260              $C$DW$176       .dwtag  DW_TAG_member
    4261                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    4262                      .dwattr $C$DW$176, DW_AT_name("DMACH3TCR1")
    4263                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_DMACH3TCR1")
    4264                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4265                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4266              $C$DW$177       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    4268                      .dwattr $C$DW$177, DW_AT_name("DMACH3TCR2")
    4269                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMACH3TCR2")
    4270                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4271                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4272                      .dwendtag $C$DW$T$22
    4273              
    4274              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    4275                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4276                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  109

    4277              $C$DW$178       .dwtag  DW_TAG_TI_far_type
    4278                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    4279              $C$DW$179       .dwtag  DW_TAG_TI_ioport_type
    4280                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$178)
    4281              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    4282                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$179)
    4283              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4284                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4285                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4286              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    4287                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4288                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4289              
    4290              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4291                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    4292              $C$DW$180       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    4294                      .dwattr $C$DW$180, DW_AT_name("dmaRegs")
    4295                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_dmaRegs")
    4296                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4297                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4298              $C$DW$181       .dwtag  DW_TAG_member
    4299                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$28)
    4300                      .dwattr $C$DW$181, DW_AT_name("chanNum")
    4301                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_chanNum")
    4302                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4303                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4304              $C$DW$182       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$30)
    4306                      .dwattr $C$DW$182, DW_AT_name("dmaInstNum")
    4307                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_dmaInstNum")
    4308                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4309                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4310              $C$DW$183       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    4312                      .dwattr $C$DW$183, DW_AT_name("isChanFree")
    4313                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_isChanFree")
    4314                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4315                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4316              $C$DW$184       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$33)
    4318                      .dwattr $C$DW$184, DW_AT_name("chanDir")
    4319                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_chanDir")
    4320                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4321                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$185       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$35)
    4324                      .dwattr $C$DW$185, DW_AT_name("trigger")
    4325                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_trigger")
    4326                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4327                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$186       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$37)
    4330                      .dwattr $C$DW$186, DW_AT_name("trfType")
    4331                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_trfType")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  110

    4332                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4333                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4334              $C$DW$187       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$39)
    4336                      .dwattr $C$DW$187, DW_AT_name("dmaInt")
    4337                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_dmaInt")
    4338                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4339                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4340              $C$DW$188       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    4342                      .dwattr $C$DW$188, DW_AT_name("pingPongEnabled")
    4343                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_pingPongEnabled")
    4344                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4345                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4346                      .dwendtag $C$DW$T$40
    4347              
    4348              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    4349                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$40)
    4350                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4351              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4352                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    4353                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    4354              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    4355                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    4356                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4357              
    4358              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4359                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
    4360              $C$DW$189       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$42)
    4362                      .dwattr $C$DW$189, DW_AT_name("pingPongMode")
    4363                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_pingPongMode")
    4364                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4365                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4366              $C$DW$190       .dwtag  DW_TAG_member
    4367                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$44)
    4368                      .dwattr $C$DW$190, DW_AT_name("autoMode")
    4369                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_autoMode")
    4370                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4371                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4372              $C$DW$191       .dwtag  DW_TAG_member
    4373                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$46)
    4374                      .dwattr $C$DW$191, DW_AT_name("burstLen")
    4375                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_burstLen")
    4376                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4377                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4378              $C$DW$192       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$35)
    4380                      .dwattr $C$DW$192, DW_AT_name("trigger")
    4381                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_trigger")
    4382                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4383                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4384              $C$DW$193       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$48)
    4386                      .dwattr $C$DW$193, DW_AT_name("dmaEvt")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  111

    4387                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_dmaEvt")
    4388                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4389                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4390              $C$DW$194       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$39)
    4392                      .dwattr $C$DW$194, DW_AT_name("dmaInt")
    4393                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_dmaInt")
    4394                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4395                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4396              $C$DW$195       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$33)
    4398                      .dwattr $C$DW$195, DW_AT_name("chanDir")
    4399                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_chanDir")
    4400                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4401                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    4402              $C$DW$196       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$37)
    4404                      .dwattr $C$DW$196, DW_AT_name("trfType")
    4405                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_trfType")
    4406                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4407                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    4408              $C$DW$197       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    4410                      .dwattr $C$DW$197, DW_AT_name("dataLen")
    4411                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_dataLen")
    4412                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4413                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$198       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$49)
    4416                      .dwattr $C$DW$198, DW_AT_name("srcAddr")
    4417                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_srcAddr")
    4418                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4419                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$199       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$49)
    4422                      .dwattr $C$DW$199, DW_AT_name("destAddr")
    4423                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_destAddr")
    4424                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4425                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4426                      .dwendtag $C$DW$T$50
    4427              
    4428              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    4429                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$50)
    4430                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4431              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    4432                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    4433                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    4434              
    4435              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4436                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x48)
    4437              $C$DW$200       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    4439                      .dwattr $C$DW$200, DW_AT_name("EBSR")
    4440                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EBSR")
    4441                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  112

    4442                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$201       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    4445                      .dwattr $C$DW$201, DW_AT_name("RSVD0")
    4446                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD0")
    4447                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4448                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$202       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    4451                      .dwattr $C$DW$202, DW_AT_name("PCGCR1")
    4452                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCGCR1")
    4453                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4454                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$203       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    4457                      .dwattr $C$DW$203, DW_AT_name("PCGCR2")
    4458                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCGCR2")
    4459                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4460                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$204       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    4463                      .dwattr $C$DW$204, DW_AT_name("PSRCR")
    4464                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PSRCR")
    4465                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4466                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$205       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    4469                      .dwattr $C$DW$205, DW_AT_name("PRCR")
    4470                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PRCR")
    4471                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4472                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$206       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$51)
    4475                      .dwattr $C$DW$206, DW_AT_name("RSVD1")
    4476                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD1")
    4477                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4478                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$207       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    4481                      .dwattr $C$DW$207, DW_AT_name("TIAFR")
    4482                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_TIAFR")
    4483                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4484                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$208       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    4487                      .dwattr $C$DW$208, DW_AT_name("RSVD2")
    4488                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD2")
    4489                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4490                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4491              $C$DW$209       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    4493                      .dwattr $C$DW$209, DW_AT_name("ODSCR")
    4494                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ODSCR")
    4495                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4496                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  113

    4497              $C$DW$210       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    4499                      .dwattr $C$DW$210, DW_AT_name("PDINHIBR1")
    4500                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PDINHIBR1")
    4501                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4502                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4503              $C$DW$211       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    4505                      .dwattr $C$DW$211, DW_AT_name("PDINHIBR2")
    4506                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PDINHIBR2")
    4507                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4508                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$212       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    4511                      .dwattr $C$DW$212, DW_AT_name("PDINHIBR3")
    4512                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PDINHIBR3")
    4513                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4514                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4515              $C$DW$213       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    4517                      .dwattr $C$DW$213, DW_AT_name("DMA0CESR1")
    4518                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DMA0CESR1")
    4519                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4520                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$214       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    4523                      .dwattr $C$DW$214, DW_AT_name("DMA0CESR2")
    4524                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMA0CESR2")
    4525                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4526                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$215       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    4529                      .dwattr $C$DW$215, DW_AT_name("DMA1CESR1")
    4530                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMA1CESR1")
    4531                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4532                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4533              $C$DW$216       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    4535                      .dwattr $C$DW$216, DW_AT_name("DMA1CESR2")
    4536                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DMA1CESR2")
    4537                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4538                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$217       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    4541                      .dwattr $C$DW$217, DW_AT_name("SDRAMCCR")
    4542                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_SDRAMCCR")
    4543                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4544                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4545              $C$DW$218       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    4547                      .dwattr $C$DW$218, DW_AT_name("CCR2")
    4548                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CCR2")
    4549                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4550                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4551              $C$DW$219       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  114

    4552                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    4553                      .dwattr $C$DW$219, DW_AT_name("CGCR1")
    4554                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_CGCR1")
    4555                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4556                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4557              $C$DW$220       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    4559                      .dwattr $C$DW$220, DW_AT_name("CGICR")
    4560                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_CGICR")
    4561                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4562                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4563              $C$DW$221       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    4565                      .dwattr $C$DW$221, DW_AT_name("CGCR2")
    4566                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_CGCR2")
    4567                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4568                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4569              $C$DW$222       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    4571                      .dwattr $C$DW$222, DW_AT_name("CGOCR")
    4572                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_CGOCR")
    4573                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4574                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4575              $C$DW$223       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    4577                      .dwattr $C$DW$223, DW_AT_name("CCSSR")
    4578                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_CCSSR")
    4579                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4580                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4581              $C$DW$224       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    4583                      .dwattr $C$DW$224, DW_AT_name("RSVD3")
    4584                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD3")
    4585                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4586                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4587              $C$DW$225       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    4589                      .dwattr $C$DW$225, DW_AT_name("ECDR")
    4590                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_ECDR")
    4591                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4592                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4593              $C$DW$226       .dwtag  DW_TAG_member
    4594                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    4595                      .dwattr $C$DW$226, DW_AT_name("RSVD4")
    4596                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD4")
    4597                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4598                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4599              $C$DW$227       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    4601                      .dwattr $C$DW$227, DW_AT_name("RAMSLPMDCNTLR1")
    4602                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4603                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4604                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4605              $C$DW$228       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  115

    4607                      .dwattr $C$DW$228, DW_AT_name("RSVD5")
    4608                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD5")
    4609                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4610                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4611              $C$DW$229       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    4613                      .dwattr $C$DW$229, DW_AT_name("RAMSLPMDCNTLR2")
    4614                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4615                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4616                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4617              $C$DW$230       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    4619                      .dwattr $C$DW$230, DW_AT_name("RAMSLPMDCNTLR3")
    4620                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4621                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4622                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4623              $C$DW$231       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    4625                      .dwattr $C$DW$231, DW_AT_name("RAMSLPMDCNTLR4")
    4626                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4627                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4628                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4629              $C$DW$232       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    4631                      .dwattr $C$DW$232, DW_AT_name("RAMSLPMDCNTLR5")
    4632                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4633                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4634                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4635              $C$DW$233       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$52)
    4637                      .dwattr $C$DW$233, DW_AT_name("RSVD6")
    4638                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RSVD6")
    4639                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4640                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4641              $C$DW$234       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    4643                      .dwattr $C$DW$234, DW_AT_name("DMAIFR")
    4644                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMAIFR")
    4645                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4646                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4647              $C$DW$235       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    4649                      .dwattr $C$DW$235, DW_AT_name("DMAIER")
    4650                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMAIER")
    4651                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4652                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4653              $C$DW$236       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    4655                      .dwattr $C$DW$236, DW_AT_name("USBSCR")
    4656                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_USBSCR")
    4657                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4658                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4659              $C$DW$237       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    4661                      .dwattr $C$DW$237, DW_AT_name("ESCR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  116

    4662                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ESCR")
    4663                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4664                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4665              $C$DW$238       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$52)
    4667                      .dwattr $C$DW$238, DW_AT_name("RSVD7")
    4668                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSVD7")
    4669                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4670                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4671              $C$DW$239       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    4673                      .dwattr $C$DW$239, DW_AT_name("DMA2CESR1")
    4674                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DMA2CESR1")
    4675                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4676                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$240       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    4679                      .dwattr $C$DW$240, DW_AT_name("DMA2CESR2")
    4680                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DMA2CESR2")
    4681                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4682                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$241       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    4685                      .dwattr $C$DW$241, DW_AT_name("DMA3CESR1")
    4686                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMA3CESR1")
    4687                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4688                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$242       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    4691                      .dwattr $C$DW$242, DW_AT_name("DMA3CESR2")
    4692                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMA3CESR2")
    4693                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4694                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$243       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    4697                      .dwattr $C$DW$243, DW_AT_name("CLKSTOP")
    4698                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CLKSTOP")
    4699                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4700                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$244       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$53)
    4703                      .dwattr $C$DW$244, DW_AT_name("RSVD8")
    4704                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD8")
    4705                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4706                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$245       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    4709                      .dwattr $C$DW$245, DW_AT_name("DIEIDR0")
    4710                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DIEIDR0")
    4711                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4712                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$246       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    4715                      .dwattr $C$DW$246, DW_AT_name("DIEIDR1")
    4716                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DIEIDR1")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  117

    4717                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4718                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$247       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    4721                      .dwattr $C$DW$247, DW_AT_name("DIEIDR2")
    4722                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DIEIDR2")
    4723                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4724                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$248       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    4727                      .dwattr $C$DW$248, DW_AT_name("DIEIDR3")
    4728                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DIEIDR3")
    4729                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4730                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$249       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    4733                      .dwattr $C$DW$249, DW_AT_name("DIEIDR4")
    4734                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DIEIDR4")
    4735                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4736                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$250       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    4739                      .dwattr $C$DW$250, DW_AT_name("DIEIDR5")
    4740                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DIEIDR5")
    4741                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4742                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4743              $C$DW$251       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    4745                      .dwattr $C$DW$251, DW_AT_name("DIEIDR6")
    4746                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DIEIDR6")
    4747                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4748                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4749              $C$DW$252       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    4751                      .dwattr $C$DW$252, DW_AT_name("DIEIDR7")
    4752                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DIEIDR7")
    4753                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4754                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4755                      .dwendtag $C$DW$T$54
    4756              
    4757              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4758                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$54)
    4759                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4760              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    4761                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$64)
    4762              $C$DW$254       .dwtag  DW_TAG_TI_ioport_type
    4763                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$253)
    4764              $C$DW$T$65      .dwtag  DW_TAG_volatile_type
    4765                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$254)
    4766              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    4767                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4768                      .dwattr $C$DW$T$66, DW_AT_address_class(0x10)
    4769              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4770                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4771                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  118

    4772              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4773                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4774                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4775                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4776              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4777                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4778                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4779                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4780              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4781                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4782                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4783                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4784              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4785                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4786                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4787                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4788              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4789                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4790                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4791                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4792              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    4793                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
    4794                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4795              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    4796                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4797                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4798              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    4799                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4800                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    4801              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4802                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4803                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4804                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
