TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE    1

   10687              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:39 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7456                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$92)
    7457                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    7458              
    7459              $C$DW$T$93      .dwtag  DW_TAG_enumeration_type
    7460                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x01)
    7461              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
    7462              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
    7463              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
    7464              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
    7465                      .dwendtag $C$DW$T$93
    7466              
    7467              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
    7468                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7469                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    7470              
    7471              $C$DW$T$95      .dwtag  DW_TAG_enumeration_type
    7472                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    7473              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    7474              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    7475                      .dwendtag $C$DW$T$95
    7476              
    7477              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    7478                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    7479                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    7480              
    7481              $C$DW$T$107     .dwtag  DW_TAG_enumeration_type
    7482                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
    7483              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  180

    7484              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    7485              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    7486              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    7487              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    7488              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    7489              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    7490              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    7491              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    7492              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    7493              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    7494              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    7495              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    7496              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    7497              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    7498              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    7499                      .dwendtag $C$DW$T$107
    7500              
    7501              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    7502                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    7503                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    7504              
    7505              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    7506                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    7507              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    7508              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    7509              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    7510              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    7511              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    7512                      .dwendtag $C$DW$T$109
    7513              
    7514              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    7515                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    7516                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7517              
    7518              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7519                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    7520              $C$DW$432       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    7522                      .dwattr $C$DW$432, DW_AT_name("TXFUNCADDR")
    7523                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_TXFUNCADDR")
    7524                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7525                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7526              $C$DW$433       .dwtag  DW_TAG_member
    7527                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    7528                      .dwattr $C$DW$433, DW_AT_name("TXHUBADDR_TXHUBPORT")
    7529                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    7530                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7531                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7532              $C$DW$434       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    7534                      .dwattr $C$DW$434, DW_AT_name("RSVD0")
    7535                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD0")
    7536                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7537                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7538              $C$DW$435       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  181

    7539                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    7540                      .dwattr $C$DW$435, DW_AT_name("RXFUNCADDR")
    7541                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_RXFUNCADDR")
    7542                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7543                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7544              $C$DW$436       .dwtag  DW_TAG_member
    7545                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    7546                      .dwattr $C$DW$436, DW_AT_name("RXHUBADDR_RXHUBPORT")
    7547                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    7548                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7549                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7550              $C$DW$437       .dwtag  DW_TAG_member
    7551                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    7552                      .dwattr $C$DW$437, DW_AT_name("RSVD36")
    7553                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD36")
    7554                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7555                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7556                      .dwendtag $C$DW$T$22
    7557              
    7558              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    7559                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    7560                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7561              
    7562              $C$DW$T$40      .dwtag  DW_TAG_array_type
    7563                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    7564                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7565                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    7566              $C$DW$438       .dwtag  DW_TAG_subrange_type
    7567                      .dwattr $C$DW$438, DW_AT_upper_bound(0x04)
    7568                      .dwendtag $C$DW$T$40
    7569              
    7570              
    7571              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7572                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    7573              $C$DW$439       .dwtag  DW_TAG_member
    7574                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    7575                      .dwattr $C$DW$439, DW_AT_name("TXMAXP")
    7576                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_TXMAXP")
    7577                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7578                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7579              $C$DW$440       .dwtag  DW_TAG_member
    7580                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    7581                      .dwattr $C$DW$440, DW_AT_name("PERI_TXCSR")
    7582                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_PERI_TXCSR")
    7583                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7584                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7585              $C$DW$441       .dwtag  DW_TAG_member
    7586                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    7587                      .dwattr $C$DW$441, DW_AT_name("RSVD0")
    7588                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD0")
    7589                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7590                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7591              $C$DW$442       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    7593                      .dwattr $C$DW$442, DW_AT_name("RXMAXP")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  182

    7594                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_RXMAXP")
    7595                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7596                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7597              $C$DW$443       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    7599                      .dwattr $C$DW$443, DW_AT_name("PERI_RXCSR")
    7600                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_PERI_RXCSR")
    7601                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7602                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7603              $C$DW$444       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    7605                      .dwattr $C$DW$444, DW_AT_name("RSVD1")
    7606                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD1")
    7607                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7608                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7609              $C$DW$445       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    7611                      .dwattr $C$DW$445, DW_AT_name("RXCOUNT")
    7612                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RXCOUNT")
    7613                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7614                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7615              $C$DW$446       .dwtag  DW_TAG_member
    7616                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    7617                      .dwattr $C$DW$446, DW_AT_name("RSVD41")
    7618                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD41")
    7619                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7620                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7621                      .dwendtag $C$DW$T$24
    7622              
    7623              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    7624                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    7625                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7626              
    7627              $C$DW$T$43      .dwtag  DW_TAG_array_type
    7628                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    7629                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    7630                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    7631              $C$DW$447       .dwtag  DW_TAG_subrange_type
    7632                      .dwattr $C$DW$447, DW_AT_upper_bound(0x03)
    7633                      .dwendtag $C$DW$T$43
    7634              
    7635              
    7636              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7637                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    7638              $C$DW$448       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    7640                      .dwattr $C$DW$448, DW_AT_name("TXGCR1")
    7641                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_TXGCR1")
    7642                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7643                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7644              $C$DW$449       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    7646                      .dwattr $C$DW$449, DW_AT_name("TXGCR2")
    7647                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_TXGCR2")
    7648                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  183

    7649                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7650              $C$DW$450       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$25)
    7652                      .dwattr $C$DW$450, DW_AT_name("RSVD0")
    7653                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD0")
    7654                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7655                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7656              $C$DW$451       .dwtag  DW_TAG_member
    7657                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    7658                      .dwattr $C$DW$451, DW_AT_name("RXGCR1")
    7659                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RXGCR1")
    7660                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7661                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7662              $C$DW$452       .dwtag  DW_TAG_member
    7663                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    7664                      .dwattr $C$DW$452, DW_AT_name("RXGCR2")
    7665                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_RXGCR2")
    7666                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7667                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7668              $C$DW$453       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    7670                      .dwattr $C$DW$453, DW_AT_name("RSVD1")
    7671                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD1")
    7672                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7673                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7674              $C$DW$454       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    7676                      .dwattr $C$DW$454, DW_AT_name("RXHPCR1A")
    7677                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_RXHPCR1A")
    7678                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7679                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7680              $C$DW$455       .dwtag  DW_TAG_member
    7681                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    7682                      .dwattr $C$DW$455, DW_AT_name("RXHPCR2A")
    7683                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_RXHPCR2A")
    7684                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7685                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7686              $C$DW$456       .dwtag  DW_TAG_member
    7687                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    7688                      .dwattr $C$DW$456, DW_AT_name("RSVD2")
    7689                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD2")
    7690                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7691                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7692              $C$DW$457       .dwtag  DW_TAG_member
    7693                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    7694                      .dwattr $C$DW$457, DW_AT_name("RXHPCR1B")
    7695                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_RXHPCR1B")
    7696                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7697                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7698              $C$DW$458       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    7700                      .dwattr $C$DW$458, DW_AT_name("RXHPCR2B")
    7701                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_RXHPCR2B")
    7702                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7703                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  184

    7704              $C$DW$459       .dwtag  DW_TAG_member
    7705                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$26)
    7706                      .dwattr $C$DW$459, DW_AT_name("RSVD46")
    7707                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD46")
    7708                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7709                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7710                      .dwendtag $C$DW$T$27
    7711              
    7712              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    7713                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    7714                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7715              
    7716              $C$DW$T$47      .dwtag  DW_TAG_array_type
    7717                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7718                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7719                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    7720              $C$DW$460       .dwtag  DW_TAG_subrange_type
    7721                      .dwattr $C$DW$460, DW_AT_upper_bound(0x03)
    7722                      .dwendtag $C$DW$T$47
    7723              
    7724              
    7725              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7726                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    7727              $C$DW$461       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    7729                      .dwattr $C$DW$461, DW_AT_name("ENTRYLSW")
    7730                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ENTRYLSW")
    7731                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7732                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7733              $C$DW$462       .dwtag  DW_TAG_member
    7734                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    7735                      .dwattr $C$DW$462, DW_AT_name("ENTRYMSW")
    7736                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_ENTRYMSW")
    7737                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7738                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7739              $C$DW$463       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
    7741                      .dwattr $C$DW$463, DW_AT_name("RSVD49")
    7742                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD49")
    7743                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7744                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7745                      .dwendtag $C$DW$T$28
    7746              
    7747              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    7748                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    7749                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7750              
    7751              $C$DW$T$51      .dwtag  DW_TAG_array_type
    7752                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    7753                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7754                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    7755              $C$DW$464       .dwtag  DW_TAG_subrange_type
    7756                      .dwattr $C$DW$464, DW_AT_upper_bound(0x3f)
    7757                      .dwendtag $C$DW$T$51
    7758              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  185

    7759              
    7760              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7761                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    7762              $C$DW$465       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    7764                      .dwattr $C$DW$465, DW_AT_name("QMEMRBASE1")
    7765                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_QMEMRBASE1")
    7766                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7767                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7768              $C$DW$466       .dwtag  DW_TAG_member
    7769                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    7770                      .dwattr $C$DW$466, DW_AT_name("QMEMRBASE2")
    7771                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_QMEMRBASE2")
    7772                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7773                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7774              $C$DW$467       .dwtag  DW_TAG_member
    7775                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
    7776                      .dwattr $C$DW$467, DW_AT_name("RSVD0")
    7777                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD0")
    7778                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7779                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7780              $C$DW$468       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    7782                      .dwattr $C$DW$468, DW_AT_name("QMEMRCTRL1")
    7783                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    7784                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7785                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7786              $C$DW$469       .dwtag  DW_TAG_member
    7787                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    7788                      .dwattr $C$DW$469, DW_AT_name("QMEMRCTRL2")
    7789                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    7790                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7791                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7792              $C$DW$470       .dwtag  DW_TAG_member
    7793                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$29)
    7794                      .dwattr $C$DW$470, DW_AT_name("RSVD63")
    7795                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD63")
    7796                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7797                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7798                      .dwendtag $C$DW$T$30
    7799              
    7800              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    7801                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
    7802                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    7803              
    7804              $C$DW$T$57      .dwtag  DW_TAG_array_type
    7805                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    7806                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    7807                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
    7808              $C$DW$471       .dwtag  DW_TAG_subrange_type
    7809                      .dwattr $C$DW$471, DW_AT_upper_bound(0x0f)
    7810                      .dwendtag $C$DW$T$57
    7811              
    7812              
    7813              $C$DW$T$32      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  186

    7814                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    7815              $C$DW$472       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$31)
    7817                      .dwattr $C$DW$472, DW_AT_name("RSVD0")
    7818                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_RSVD0")
    7819                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7820                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7821              $C$DW$473       .dwtag  DW_TAG_member
    7822                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    7823                      .dwattr $C$DW$473, DW_AT_name("CTRL1D")
    7824                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_CTRL1D")
    7825                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7826                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7827              $C$DW$474       .dwtag  DW_TAG_member
    7828                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    7829                      .dwattr $C$DW$474, DW_AT_name("CTRL2D")
    7830                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_CTRL2D")
    7831                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7832                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7833              $C$DW$475       .dwtag  DW_TAG_member
    7834                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$21)
    7835                      .dwattr $C$DW$475, DW_AT_name("RSVD65")
    7836                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD65")
    7837                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7838                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7839                      .dwendtag $C$DW$T$32
    7840              
    7841              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    7842                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    7843                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7844              
    7845              $C$DW$T$60      .dwtag  DW_TAG_array_type
    7846                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    7847                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7848                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
    7849              $C$DW$476       .dwtag  DW_TAG_subrange_type
    7850                      .dwattr $C$DW$476, DW_AT_upper_bound(0x3f)
    7851                      .dwendtag $C$DW$T$60
    7852              
    7853              
    7854              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7855                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    7856              $C$DW$477       .dwtag  DW_TAG_member
    7857                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    7858                      .dwattr $C$DW$477, DW_AT_name("QSTATA")
    7859                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_QSTATA")
    7860                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7861                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7862              $C$DW$478       .dwtag  DW_TAG_member
    7863                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$33)
    7864                      .dwattr $C$DW$478, DW_AT_name("RSVD0")
    7865                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_RSVD0")
    7866                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7867                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7868              $C$DW$479       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  187

    7869                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    7870                      .dwattr $C$DW$479, DW_AT_name("QSTAT1B")
    7871                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_QSTAT1B")
    7872                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7873                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7874              $C$DW$480       .dwtag  DW_TAG_member
    7875                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    7876                      .dwattr $C$DW$480, DW_AT_name("QSTAT2B")
    7877                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_QSTAT2B")
    7878                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7879                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7880              $C$DW$481       .dwtag  DW_TAG_member
    7881                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$21)
    7882                      .dwattr $C$DW$481, DW_AT_name("RSVD1")
    7883                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RSVD1")
    7884                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7885                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7886              $C$DW$482       .dwtag  DW_TAG_member
    7887                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    7888                      .dwattr $C$DW$482, DW_AT_name("QSTAT1C")
    7889                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_QSTAT1C")
    7890                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7891                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7892              $C$DW$483       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
    7894                      .dwattr $C$DW$483, DW_AT_name("RSVD67")
    7895                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD67")
    7896                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7897                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7898                      .dwendtag $C$DW$T$34
    7899              
    7900              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    7901                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    7902                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    7903              
    7904              $C$DW$T$63      .dwtag  DW_TAG_array_type
    7905                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    7906                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7907                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
    7908              $C$DW$484       .dwtag  DW_TAG_subrange_type
    7909                      .dwattr $C$DW$484, DW_AT_upper_bound(0x3f)
    7910                      .dwendtag $C$DW$T$63
    7911              
    7912              
    7913              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7914                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
    7915              $C$DW$485       .dwtag  DW_TAG_member
    7916                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    7917                      .dwattr $C$DW$485, DW_AT_name("REVID1")
    7918                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_REVID1")
    7919                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7920                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7921              $C$DW$486       .dwtag  DW_TAG_member
    7922                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    7923                      .dwattr $C$DW$486, DW_AT_name("REVID2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  188

    7924                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_REVID2")
    7925                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7926                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7927              $C$DW$487       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$21)
    7929                      .dwattr $C$DW$487, DW_AT_name("RSVD0")
    7930                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_RSVD0")
    7931                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7932                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7933              $C$DW$488       .dwtag  DW_TAG_member
    7934                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
    7935                      .dwattr $C$DW$488, DW_AT_name("CTRLR")
    7936                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_CTRLR")
    7937                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7938                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7939              $C$DW$489       .dwtag  DW_TAG_member
    7940                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$33)
    7941                      .dwattr $C$DW$489, DW_AT_name("RSVD1")
    7942                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD1")
    7943                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7944                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7945              $C$DW$490       .dwtag  DW_TAG_member
    7946                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    7947                      .dwattr $C$DW$490, DW_AT_name("STATR")
    7948                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_STATR")
    7949                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7950                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7951              $C$DW$491       .dwtag  DW_TAG_member
    7952                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$33)
    7953                      .dwattr $C$DW$491, DW_AT_name("RSVD2")
    7954                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD2")
    7955                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7956                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7957              $C$DW$492       .dwtag  DW_TAG_member
    7958                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    7959                      .dwattr $C$DW$492, DW_AT_name("EMUR")
    7960                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_EMUR")
    7961                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7962                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7963              $C$DW$493       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$33)
    7965                      .dwattr $C$DW$493, DW_AT_name("RSVD3")
    7966                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD3")
    7967                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7968                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7969              $C$DW$494       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    7971                      .dwattr $C$DW$494, DW_AT_name("MODE1")
    7972                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_MODE1")
    7973                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7974                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7975              $C$DW$495       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    7977                      .dwattr $C$DW$495, DW_AT_name("MODE2")
    7978                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_MODE2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  189

    7979                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7980                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7981              $C$DW$496       .dwtag  DW_TAG_member
    7982                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
    7983                      .dwattr $C$DW$496, DW_AT_name("RSVD4")
    7984                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD4")
    7985                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7986                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7987              $C$DW$497       .dwtag  DW_TAG_member
    7988                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    7989                      .dwattr $C$DW$497, DW_AT_name("AUTOREQ")
    7990                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_AUTOREQ")
    7991                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7992                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7993              $C$DW$498       .dwtag  DW_TAG_member
    7994                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$33)
    7995                      .dwattr $C$DW$498, DW_AT_name("RSVD5")
    7996                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD5")
    7997                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7998                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7999              $C$DW$499       .dwtag  DW_TAG_member
    8000                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    8001                      .dwattr $C$DW$499, DW_AT_name("SPRFIXTIME1")
    8002                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    8003                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8004                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8005              $C$DW$500       .dwtag  DW_TAG_member
    8006                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    8007                      .dwattr $C$DW$500, DW_AT_name("SPRFIXTIME2")
    8008                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    8009                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8010                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8011              $C$DW$501       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$21)
    8013                      .dwattr $C$DW$501, DW_AT_name("RSVD6")
    8014                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD6")
    8015                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8016                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8017              $C$DW$502       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
    8019                      .dwattr $C$DW$502, DW_AT_name("TEARDOWN1")
    8020                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_TEARDOWN1")
    8021                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8022                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8023              $C$DW$503       .dwtag  DW_TAG_member
    8024                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    8025                      .dwattr $C$DW$503, DW_AT_name("TEARDOWN2")
    8026                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_TEARDOWN2")
    8027                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8028                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8029              $C$DW$504       .dwtag  DW_TAG_member
    8030                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
    8031                      .dwattr $C$DW$504, DW_AT_name("RSVD7")
    8032                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD7")
    8033                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  190

    8034                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8035              $C$DW$505       .dwtag  DW_TAG_member
    8036                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
    8037                      .dwattr $C$DW$505, DW_AT_name("INTSRCR1")
    8038                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_INTSRCR1")
    8039                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8040                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8041              $C$DW$506       .dwtag  DW_TAG_member
    8042                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    8043                      .dwattr $C$DW$506, DW_AT_name("INTSRCR2")
    8044                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_INTSRCR2")
    8045                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8046                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8047              $C$DW$507       .dwtag  DW_TAG_member
    8048                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    8049                      .dwattr $C$DW$507, DW_AT_name("RSVD8")
    8050                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD8")
    8051                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8052                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8053              $C$DW$508       .dwtag  DW_TAG_member
    8054                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
    8055                      .dwattr $C$DW$508, DW_AT_name("INTSETR1")
    8056                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_INTSETR1")
    8057                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8058                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8059              $C$DW$509       .dwtag  DW_TAG_member
    8060                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
    8061                      .dwattr $C$DW$509, DW_AT_name("INTSETR2")
    8062                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_INTSETR2")
    8063                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8064                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8065              $C$DW$510       .dwtag  DW_TAG_member
    8066                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
    8067                      .dwattr $C$DW$510, DW_AT_name("RSVD9")
    8068                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD9")
    8069                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8070                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    8071              $C$DW$511       .dwtag  DW_TAG_member
    8072                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    8073                      .dwattr $C$DW$511, DW_AT_name("INTCLRR1")
    8074                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_INTCLRR1")
    8075                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8076                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    8077              $C$DW$512       .dwtag  DW_TAG_member
    8078                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
    8079                      .dwattr $C$DW$512, DW_AT_name("INTCLRR2")
    8080                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_INTCLRR2")
    8081                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    8082                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    8083              $C$DW$513       .dwtag  DW_TAG_member
    8084                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
    8085                      .dwattr $C$DW$513, DW_AT_name("RSVD10")
    8086                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_RSVD10")
    8087                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8088                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  191

    8089              $C$DW$514       .dwtag  DW_TAG_member
    8090                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
    8091                      .dwattr $C$DW$514, DW_AT_name("INTMSKR1")
    8092                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_INTMSKR1")
    8093                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8094                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    8095              $C$DW$515       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
    8097                      .dwattr $C$DW$515, DW_AT_name("INTMSKR2")
    8098                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_INTMSKR2")
    8099                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    8100                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    8101              $C$DW$516       .dwtag  DW_TAG_member
    8102                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$21)
    8103                      .dwattr $C$DW$516, DW_AT_name("RSVD11")
    8104                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD11")
    8105                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    8106                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    8107              $C$DW$517       .dwtag  DW_TAG_member
    8108                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
    8109                      .dwattr $C$DW$517, DW_AT_name("INTMSKSETR1")
    8110                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_INTMSKSETR1")
    8111                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8112                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    8113              $C$DW$518       .dwtag  DW_TAG_member
    8114                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
    8115                      .dwattr $C$DW$518, DW_AT_name("INTMSKSETR2")
    8116                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_INTMSKSETR2")
    8117                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    8118                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    8119              $C$DW$519       .dwtag  DW_TAG_member
    8120                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    8121                      .dwattr $C$DW$519, DW_AT_name("RSVD12")
    8122                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_RSVD12")
    8123                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8124                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    8125              $C$DW$520       .dwtag  DW_TAG_member
    8126                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    8127                      .dwattr $C$DW$520, DW_AT_name("INTMSKCLRR1")
    8128                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    8129                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8130                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    8131              $C$DW$521       .dwtag  DW_TAG_member
    8132                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$20)
    8133                      .dwattr $C$DW$521, DW_AT_name("INTMSKCLRR2")
    8134                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    8135                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    8136                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    8137              $C$DW$522       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$21)
    8139                      .dwattr $C$DW$522, DW_AT_name("RSVD13")
    8140                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD13")
    8141                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8142                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    8143              $C$DW$523       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  192

    8144                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    8145                      .dwattr $C$DW$523, DW_AT_name("INTMASKEDR1")
    8146                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_INTMASKEDR1")
    8147                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8148                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8149              $C$DW$524       .dwtag  DW_TAG_member
    8150                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$20)
    8151                      .dwattr $C$DW$524, DW_AT_name("INTMASKEDR2")
    8152                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_INTMASKEDR2")
    8153                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    8154                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8155              $C$DW$525       .dwtag  DW_TAG_member
    8156                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$21)
    8157                      .dwattr $C$DW$525, DW_AT_name("RSVD14")
    8158                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_RSVD14")
    8159                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8160                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8161              $C$DW$526       .dwtag  DW_TAG_member
    8162                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
    8163                      .dwattr $C$DW$526, DW_AT_name("EOIR")
    8164                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_EOIR")
    8165                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8166                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8167              $C$DW$527       .dwtag  DW_TAG_member
    8168                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$33)
    8169                      .dwattr $C$DW$527, DW_AT_name("RSVD15")
    8170                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_RSVD15")
    8171                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    8172                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8173              $C$DW$528       .dwtag  DW_TAG_member
    8174                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
    8175                      .dwattr $C$DW$528, DW_AT_name("INTVECTR1")
    8176                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_INTVECTR1")
    8177                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8178                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8179              $C$DW$529       .dwtag  DW_TAG_member
    8180                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    8181                      .dwattr $C$DW$529, DW_AT_name("INTVECTR2")
    8182                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_INTVECTR2")
    8183                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    8184                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8185              $C$DW$530       .dwtag  DW_TAG_member
    8186                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$26)
    8187                      .dwattr $C$DW$530, DW_AT_name("RSVD16")
    8188                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD16")
    8189                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8190                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8191              $C$DW$531       .dwtag  DW_TAG_member
    8192                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    8193                      .dwattr $C$DW$531, DW_AT_name("GREP1SZR1")
    8194                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_GREP1SZR1")
    8195                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8196                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8197              $C$DW$532       .dwtag  DW_TAG_member
    8198                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  193

    8199                      .dwattr $C$DW$532, DW_AT_name("GREP1SZR2")
    8200                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_GREP1SZR2")
    8201                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    8202                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8203              $C$DW$533       .dwtag  DW_TAG_member
    8204                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
    8205                      .dwattr $C$DW$533, DW_AT_name("RSVD17")
    8206                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD17")
    8207                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    8208                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8209              $C$DW$534       .dwtag  DW_TAG_member
    8210                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
    8211                      .dwattr $C$DW$534, DW_AT_name("GREP2SZR1")
    8212                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_GREP2SZR1")
    8213                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    8214                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8215              $C$DW$535       .dwtag  DW_TAG_member
    8216                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
    8217                      .dwattr $C$DW$535, DW_AT_name("GREP2SZR2")
    8218                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_GREP2SZR2")
    8219                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    8220                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8221              $C$DW$536       .dwtag  DW_TAG_member
    8222                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$21)
    8223                      .dwattr $C$DW$536, DW_AT_name("RSVD18")
    8224                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_RSVD18")
    8225                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8226                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8227              $C$DW$537       .dwtag  DW_TAG_member
    8228                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
    8229                      .dwattr $C$DW$537, DW_AT_name("GREP3SZR1")
    8230                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_GREP3SZR1")
    8231                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8232                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8233              $C$DW$538       .dwtag  DW_TAG_member
    8234                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
    8235                      .dwattr $C$DW$538, DW_AT_name("GREP3SZR2")
    8236                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_GREP3SZR2")
    8237                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    8238                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8239              $C$DW$539       .dwtag  DW_TAG_member
    8240                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$21)
    8241                      .dwattr $C$DW$539, DW_AT_name("RSVD19")
    8242                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_RSVD19")
    8243                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8244                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8245              $C$DW$540       .dwtag  DW_TAG_member
    8246                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
    8247                      .dwattr $C$DW$540, DW_AT_name("GREP4SZR1")
    8248                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_GREP4SZR1")
    8249                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8250                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8251              $C$DW$541       .dwtag  DW_TAG_member
    8252                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
    8253                      .dwattr $C$DW$541, DW_AT_name("GREP4SZR2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  194

    8254                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_GREP4SZR2")
    8255                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    8256                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8257              $C$DW$542       .dwtag  DW_TAG_member
    8258                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$35)
    8259                      .dwattr $C$DW$542, DW_AT_name("RSVD20")
    8260                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_RSVD20")
    8261                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8262                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8263              $C$DW$543       .dwtag  DW_TAG_member
    8264                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
    8265                      .dwattr $C$DW$543, DW_AT_name("FADDR_POWER")
    8266                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_FADDR_POWER")
    8267                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    8268                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8269              $C$DW$544       .dwtag  DW_TAG_member
    8270                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
    8271                      .dwattr $C$DW$544, DW_AT_name("INTRTX")
    8272                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_INTRTX")
    8273                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    8274                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    8275              $C$DW$545       .dwtag  DW_TAG_member
    8276                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$21)
    8277                      .dwattr $C$DW$545, DW_AT_name("RSVD21")
    8278                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_RSVD21")
    8279                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    8280                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    8281              $C$DW$546       .dwtag  DW_TAG_member
    8282                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$20)
    8283                      .dwattr $C$DW$546, DW_AT_name("INTRRX")
    8284                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_INTRRX")
    8285                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    8286                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    8287              $C$DW$547       .dwtag  DW_TAG_member
    8288                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
    8289                      .dwattr $C$DW$547, DW_AT_name("INTRTXE")
    8290                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_INTRTXE")
    8291                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    8292                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    8293              $C$DW$548       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$21)
    8295                      .dwattr $C$DW$548, DW_AT_name("RSVD22")
    8296                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD22")
    8297                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    8298                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    8299              $C$DW$549       .dwtag  DW_TAG_member
    8300                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
    8301                      .dwattr $C$DW$549, DW_AT_name("INTRRXE")
    8302                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_INTRRXE")
    8303                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    8304                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    8305              $C$DW$550       .dwtag  DW_TAG_member
    8306                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$20)
    8307                      .dwattr $C$DW$550, DW_AT_name("INTRUSB_INTRUSBE")
    8308                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  195

    8309                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    8310                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    8311              $C$DW$551       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$21)
    8313                      .dwattr $C$DW$551, DW_AT_name("RSVD23")
    8314                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_RSVD23")
    8315                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    8316                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    8317              $C$DW$552       .dwtag  DW_TAG_member
    8318                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$20)
    8319                      .dwattr $C$DW$552, DW_AT_name("FRAME")
    8320                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_FRAME")
    8321                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    8322                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    8323              $C$DW$553       .dwtag  DW_TAG_member
    8324                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$20)
    8325                      .dwattr $C$DW$553, DW_AT_name("INDEX_TESTMODE")
    8326                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    8327                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    8328                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    8329              $C$DW$554       .dwtag  DW_TAG_member
    8330                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$21)
    8331                      .dwattr $C$DW$554, DW_AT_name("RSVD24")
    8332                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_RSVD24")
    8333                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    8334                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    8335              $C$DW$555       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$20)
    8337                      .dwattr $C$DW$555, DW_AT_name("TXMAXP_INDX")
    8338                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    8339                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    8340                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    8341              $C$DW$556       .dwtag  DW_TAG_member
    8342                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$20)
    8343                      .dwattr $C$DW$556, DW_AT_name("PERI_CSR0_INDX")
    8344                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    8345                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    8346                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    8347              $C$DW$557       .dwtag  DW_TAG_member
    8348                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$21)
    8349                      .dwattr $C$DW$557, DW_AT_name("RSVD25")
    8350                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_RSVD25")
    8351                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    8352                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    8353              $C$DW$558       .dwtag  DW_TAG_member
    8354                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$20)
    8355                      .dwattr $C$DW$558, DW_AT_name("RXMAXP_INDX")
    8356                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    8357                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    8358                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    8359              $C$DW$559       .dwtag  DW_TAG_member
    8360                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$20)
    8361                      .dwattr $C$DW$559, DW_AT_name("PERI_RXCSR_INDX")
    8362                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    8363                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  196

    8364                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    8365              $C$DW$560       .dwtag  DW_TAG_member
    8366                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
    8367                      .dwattr $C$DW$560, DW_AT_name("RSVD26")
    8368                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_RSVD26")
    8369                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    8370                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    8371              $C$DW$561       .dwtag  DW_TAG_member
    8372                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
    8373                      .dwattr $C$DW$561, DW_AT_name("COUNT0_INDX")
    8374                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_COUNT0_INDX")
    8375                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    8376                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    8377              $C$DW$562       .dwtag  DW_TAG_member
    8378                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$36)
    8379                      .dwattr $C$DW$562, DW_AT_name("RSVD27")
    8380                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_RSVD27")
    8381                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    8382                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    8383              $C$DW$563       .dwtag  DW_TAG_member
    8384                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$20)
    8385                      .dwattr $C$DW$563, DW_AT_name("CONFIGDATA_INDX")
    8386                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    8387                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    8388                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    8389              $C$DW$564       .dwtag  DW_TAG_member
    8390                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
    8391                      .dwattr $C$DW$564, DW_AT_name("RSVD28")
    8392                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_RSVD28")
    8393                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    8394                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    8395              $C$DW$565       .dwtag  DW_TAG_member
    8396                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
    8397                      .dwattr $C$DW$565, DW_AT_name("FIFO0R1")
    8398                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_FIFO0R1")
    8399                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    8400                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    8401              $C$DW$566       .dwtag  DW_TAG_member
    8402                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    8403                      .dwattr $C$DW$566, DW_AT_name("FIFO0R2")
    8404                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_FIFO0R2")
    8405                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    8406                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    8407              $C$DW$567       .dwtag  DW_TAG_member
    8408                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$21)
    8409                      .dwattr $C$DW$567, DW_AT_name("RSVD29")
    8410                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_RSVD29")
    8411                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    8412                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    8413              $C$DW$568       .dwtag  DW_TAG_member
    8414                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
    8415                      .dwattr $C$DW$568, DW_AT_name("FIFO1R1")
    8416                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_FIFO1R1")
    8417                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    8418                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  197

    8419              $C$DW$569       .dwtag  DW_TAG_member
    8420                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
    8421                      .dwattr $C$DW$569, DW_AT_name("FIFO1R2")
    8422                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_FIFO1R2")
    8423                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    8424                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    8425              $C$DW$570       .dwtag  DW_TAG_member
    8426                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
    8427                      .dwattr $C$DW$570, DW_AT_name("RSVD30")
    8428                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_RSVD30")
    8429                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    8430                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    8431              $C$DW$571       .dwtag  DW_TAG_member
    8432                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$20)
    8433                      .dwattr $C$DW$571, DW_AT_name("FIFO2R1")
    8434                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_FIFO2R1")
    8435                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    8436                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    8437              $C$DW$572       .dwtag  DW_TAG_member
    8438                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$20)
    8439                      .dwattr $C$DW$572, DW_AT_name("FIFO2R2")
    8440                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_FIFO2R2")
    8441                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    8442                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    8443              $C$DW$573       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$21)
    8445                      .dwattr $C$DW$573, DW_AT_name("RSVD31")
    8446                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_RSVD31")
    8447                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    8448                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    8449              $C$DW$574       .dwtag  DW_TAG_member
    8450                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$20)
    8451                      .dwattr $C$DW$574, DW_AT_name("FIFO3R1")
    8452                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FIFO3R1")
    8453                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    8454                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    8455              $C$DW$575       .dwtag  DW_TAG_member
    8456                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    8457                      .dwattr $C$DW$575, DW_AT_name("FIFO3R2")
    8458                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FIFO3R2")
    8459                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    8460                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    8461              $C$DW$576       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$21)
    8463                      .dwattr $C$DW$576, DW_AT_name("RSVD32")
    8464                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD32")
    8465                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    8466                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    8467              $C$DW$577       .dwtag  DW_TAG_member
    8468                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
    8469                      .dwattr $C$DW$577, DW_AT_name("FIFO4R1")
    8470                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FIFO4R1")
    8471                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    8472                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    8473              $C$DW$578       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  198

    8474                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    8475                      .dwattr $C$DW$578, DW_AT_name("FIFO4R2")
    8476                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FIFO4R2")
    8477                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    8478                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    8479              $C$DW$579       .dwtag  DW_TAG_member
    8480                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$37)
    8481                      .dwattr $C$DW$579, DW_AT_name("RSVD33")
    8482                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD33")
    8483                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    8484                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    8485              $C$DW$580       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    8487                      .dwattr $C$DW$580, DW_AT_name("DEVCTL")
    8488                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_DEVCTL")
    8489                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    8490                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    8491              $C$DW$581       .dwtag  DW_TAG_member
    8492                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$20)
    8493                      .dwattr $C$DW$581, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    8494                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    8495                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    8496                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    8497              $C$DW$582       .dwtag  DW_TAG_member
    8498                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$21)
    8499                      .dwattr $C$DW$582, DW_AT_name("RSVD34")
    8500                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_RSVD34")
    8501                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    8502                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    8503              $C$DW$583       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
    8505                      .dwattr $C$DW$583, DW_AT_name("TXFIFOADDR")
    8506                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_TXFIFOADDR")
    8507                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    8508                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    8509              $C$DW$584       .dwtag  DW_TAG_member
    8510                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    8511                      .dwattr $C$DW$584, DW_AT_name("RXFIFOADDR")
    8512                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_RXFIFOADDR")
    8513                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    8514                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    8515              $C$DW$585       .dwtag  DW_TAG_member
    8516                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$25)
    8517                      .dwattr $C$DW$585, DW_AT_name("RSVD35")
    8518                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD35")
    8519                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    8520                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    8521              $C$DW$586       .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    8523                      .dwattr $C$DW$586, DW_AT_name("HWVERS")
    8524                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_HWVERS")
    8525                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    8526                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    8527              $C$DW$587       .dwtag  DW_TAG_member
    8528                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  199

    8529                      .dwattr $C$DW$587, DW_AT_name("RSVD37")
    8530                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_RSVD37")
    8531                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    8532                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    8533              $C$DW$588       .dwtag  DW_TAG_member
    8534                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$40)
    8535                      .dwattr $C$DW$588, DW_AT_name("EPTRG")
    8536                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_EPTRG")
    8537                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    8538                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    8539              $C$DW$589       .dwtag  DW_TAG_member
    8540                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$41)
    8541                      .dwattr $C$DW$589, DW_AT_name("RSVD38")
    8542                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_RSVD38")
    8543                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    8544                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    8545              $C$DW$590       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    8547                      .dwattr $C$DW$590, DW_AT_name("PERI_CSR0")
    8548                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_PERI_CSR0")
    8549                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    8550                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    8551              $C$DW$591       .dwtag  DW_TAG_member
    8552                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$25)
    8553                      .dwattr $C$DW$591, DW_AT_name("RSVD39")
    8554                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_RSVD39")
    8555                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    8556                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    8557              $C$DW$592       .dwtag  DW_TAG_member
    8558                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    8559                      .dwattr $C$DW$592, DW_AT_name("COUNT0")
    8560                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_COUNT0")
    8561                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    8562                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    8563              $C$DW$593       .dwtag  DW_TAG_member
    8564                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$36)
    8565                      .dwattr $C$DW$593, DW_AT_name("RSVD40")
    8566                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_RSVD40")
    8567                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    8568                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    8569              $C$DW$594       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
    8571                      .dwattr $C$DW$594, DW_AT_name("CONFIGDATA")
    8572                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_CONFIGDATA")
    8573                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    8574                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    8575              $C$DW$595       .dwtag  DW_TAG_member
    8576                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$21)
    8577                      .dwattr $C$DW$595, DW_AT_name("RSVD42")
    8578                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_RSVD42")
    8579                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    8580                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    8581              $C$DW$596       .dwtag  DW_TAG_member
    8582                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$43)
    8583                      .dwattr $C$DW$596, DW_AT_name("EPCSR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  200

    8584                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_EPCSR")
    8585                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    8586                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    8587              $C$DW$597       .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$44)
    8589                      .dwattr $C$DW$597, DW_AT_name("RSVD43")
    8590                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_RSVD43")
    8591                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    8592                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    8593              $C$DW$598       .dwtag  DW_TAG_member
    8594                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
    8595                      .dwattr $C$DW$598, DW_AT_name("DMAREVID1")
    8596                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_DMAREVID1")
    8597                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    8598                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    8599              $C$DW$599       .dwtag  DW_TAG_member
    8600                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    8601                      .dwattr $C$DW$599, DW_AT_name("DMAREVID2")
    8602                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_DMAREVID2")
    8603                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    8604                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    8605              $C$DW$600       .dwtag  DW_TAG_member
    8606                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
    8607                      .dwattr $C$DW$600, DW_AT_name("RSVD44")
    8608                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_RSVD44")
    8609                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    8610                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    8611              $C$DW$601       .dwtag  DW_TAG_member
    8612                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
    8613                      .dwattr $C$DW$601, DW_AT_name("TDFDQ")
    8614                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_TDFDQ")
    8615                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    8616                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    8617              $C$DW$602       .dwtag  DW_TAG_member
    8618                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$33)
    8619                      .dwattr $C$DW$602, DW_AT_name("RSVD45")
    8620                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_RSVD45")
    8621                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    8622                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    8623              $C$DW$603       .dwtag  DW_TAG_member
    8624                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    8625                      .dwattr $C$DW$603, DW_AT_name("DMAEMU")
    8626                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_DMAEMU")
    8627                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    8628                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    8629              $C$DW$604       .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$45)
    8631                      .dwattr $C$DW$604, DW_AT_name("RSVD47")
    8632                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_RSVD47")
    8633                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    8634                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    8635              $C$DW$605       .dwtag  DW_TAG_member
    8636                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$47)
    8637                      .dwattr $C$DW$605, DW_AT_name("CHANNEL")
    8638                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_CHANNEL")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  201

    8639                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    8640                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    8641              $C$DW$606       .dwtag  DW_TAG_member
    8642                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$48)
    8643                      .dwattr $C$DW$606, DW_AT_name("RSVD48")
    8644                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_RSVD48")
    8645                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
    8646                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    8647              $C$DW$607       .dwtag  DW_TAG_member
    8648                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
    8649                      .dwattr $C$DW$607, DW_AT_name("DMA_SCHED_CTRL1")
    8650                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
    8651                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
    8652                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    8653              $C$DW$608       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$20)
    8655                      .dwattr $C$DW$608, DW_AT_name("DMA_SCHED_CTRL2")
    8656                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
    8657                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
    8658                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    8659              $C$DW$609       .dwtag  DW_TAG_member
    8660                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$49)
    8661                      .dwattr $C$DW$609, DW_AT_name("RSVD50")
    8662                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_RSVD50")
    8663                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
    8664                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    8665              $C$DW$610       .dwtag  DW_TAG_member
    8666                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$51)
    8667                      .dwattr $C$DW$610, DW_AT_name("CDMASCHETBLWORD")
    8668                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
    8669                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
    8670                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
