TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE    1

    5453              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:41 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4062              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_UNLOCK"), DW_AT_const_value(0x00)
    4063              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_LOCK"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   91

    4064                      .dwendtag $C$DW$T$60
    4065              
    4066              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcMediaLockStatus")
    4067                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4068                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4069              
    4070              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    4071                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    4072              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    4073              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    4074              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    4075              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    4076              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    4077              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    4078              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    4079              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    4080              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    4081              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    4082              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    4083              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    4084              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    4085              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    4086              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    4087              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    4088                      .dwendtag $C$DW$T$80
    4089              
    4090              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    4091                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4092                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4093              
    4094              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    4095                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    4096              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    4097              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    4098              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    4099              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    4100              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    4101                      .dwendtag $C$DW$T$82
    4102              
    4103              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    4104                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4105                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4106              
    4107              $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
    4108                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    4109              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_DESCR"), DW_AT_const_value(0x00)
    4110              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_QUAL_DESCR"), DW_AT_const_value(0x01)
    4111              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_CONFIG_DESCR"), DW_AT_const_value(0x02)
    4112              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_INTERFACE_DESCR"), DW_AT_const_value(0x03)
    4113              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_STRING_LANGID_DESC"), DW_AT_const_value(0x04)
    4114                      .dwendtag $C$DW$T$91
    4115              
    4116              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcDescrId")
    4117                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    4118                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   92

    4119              
    4120              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4121                      .dwattr $C$DW$T$21, DW_AT_name("CSL_AcClassStruct")
    4122                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x2f6)
    4123              $C$DW$363       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    4125                      .dwattr $C$DW$363, DW_AT_name("ctrlHandle")
    4126                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ctrlHandle")
    4127                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4128                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$364       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$364, DW_AT_name("acHandle")
    4132                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_acHandle")
    4133                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18a]
    4134                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4135                      .dwendtag $C$DW$T$21
    4136              
    4137              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcClassStruct")
    4138                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$21)
    4139                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4140              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    4141                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4142                      .dwattr $C$DW$T$94, DW_AT_address_class(0x17)
    4143              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("pAcClassHandle")
    4144                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4145                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4146              
    4147              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4148                      .dwattr $C$DW$T$48, DW_AT_name("CSL_AcCtrlObject")
    4149                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x18a)
    4150              $C$DW$365       .dwtag  DW_TAG_member
    4151                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
    4152                      .dwattr $C$DW$365, DW_AT_name("ctrlInEpObj")
    4153                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ctrlInEpObj")
    4154                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4155                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4156              $C$DW$366       .dwtag  DW_TAG_member
    4157                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
    4158                      .dwattr $C$DW$366, DW_AT_name("devNum")
    4159                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_devNum")
    4160                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4161                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4162              $C$DW$367       .dwtag  DW_TAG_member
    4163                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
    4164                      .dwattr $C$DW$367, DW_AT_name("ctrlOutEpObj")
    4165                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ctrlOutEpObj")
    4166                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4167                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4168              $C$DW$368       .dwtag  DW_TAG_member
    4169                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    4170                      .dwattr $C$DW$368, DW_AT_name("suspendFlag")
    4171                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_suspendFlag")
    4172                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4173                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   93

    4174              $C$DW$369       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$28)
    4176                      .dwattr $C$DW$369, DW_AT_name("hEpObjArray")
    4177                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_hEpObjArray")
    4178                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4179                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4180              $C$DW$370       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    4182                      .dwattr $C$DW$370, DW_AT_name("usbSetup")
    4183                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_usbSetup")
    4184                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4185                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4186              $C$DW$371       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    4188                      .dwattr $C$DW$371, DW_AT_name("leftVolBuf")
    4189                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_leftVolBuf")
    4190                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4191                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4192              $C$DW$372       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$30)
    4194                      .dwattr $C$DW$372, DW_AT_name("rightVolBuf")
    4195                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rightVolBuf")
    4196                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4197                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4198              $C$DW$373       .dwtag  DW_TAG_member
    4199                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$31)
    4200                      .dwattr $C$DW$373, DW_AT_name("leftRightVolBuf")
    4201                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_leftRightVolBuf")
    4202                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4203                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4204              $C$DW$374       .dwtag  DW_TAG_member
    4205                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
    4206                      .dwattr $C$DW$374, DW_AT_name("muteCtrlBuf")
    4207                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_muteCtrlBuf")
    4208                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4209                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4210              $C$DW$375       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$32)
    4212                      .dwattr $C$DW$375, DW_AT_name("getMinBuffer")
    4213                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_getMinBuffer")
    4214                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4215                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4216              $C$DW$376       .dwtag  DW_TAG_member
    4217                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
    4218                      .dwattr $C$DW$376, DW_AT_name("getMaxBuffer")
    4219                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_getMaxBuffer")
    4220                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4221                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4222              $C$DW$377       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$32)
    4224                      .dwattr $C$DW$377, DW_AT_name("getResBuffer")
    4225                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_getResBuffer")
    4226                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4227                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4228              $C$DW$378       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   94

    4229                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$33)
    4230                      .dwattr $C$DW$378, DW_AT_name("dummydesc")
    4231                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_dummydesc")
    4232                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    4233                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4234              $C$DW$379       .dwtag  DW_TAG_member
    4235                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
    4236                      .dwattr $C$DW$379, DW_AT_name("deviceQualifierDescr")
    4237                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_deviceQualifierDescr")
    4238                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
    4239                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4240              $C$DW$380       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$34)
    4242                      .dwattr $C$DW$380, DW_AT_name("deviceDescr")
    4243                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_deviceDescr")
    4244                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    4245                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4246              $C$DW$381       .dwtag  DW_TAG_member
    4247                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$35)
    4248                      .dwattr $C$DW$381, DW_AT_name("confDescr")
    4249                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_confDescr")
    4250                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4251                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4252              $C$DW$382       .dwtag  DW_TAG_member
    4253                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$31)
    4254                      .dwattr $C$DW$382, DW_AT_name("audioClassIntDescr")
    4255                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_audioClassIntDescr")
    4256                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x141]
    4257                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4258              $C$DW$383       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$36)
    4260                      .dwattr $C$DW$383, DW_AT_name("audioClassIsoOutEndptDescr")
    4261                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_audioClassIsoOutEndptDescr")
    4262                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
    4263                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4264              $C$DW$384       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
    4266                      .dwattr $C$DW$384, DW_AT_name("audioClassInterfcLnk")
    4267                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_audioClassInterfcLnk")
    4268                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x152]
    4269                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4270              $C$DW$385       .dwtag  DW_TAG_member
    4271                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$36)
    4272                      .dwattr $C$DW$385, DW_AT_name("audioClassIsoInEndptDescr")
    4273                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_audioClassIsoInEndptDescr")
    4274                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    4275                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4276              $C$DW$386       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$37)
    4278                      .dwattr $C$DW$386, DW_AT_name("audioClassIsoOutEndptLnk")
    4279                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_audioClassIsoOutEndptLnk")
    4280                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15e]
    4281                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4282              $C$DW$387       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   95

    4284                      .dwattr $C$DW$387, DW_AT_name("stringDescrLangid")
    4285                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_stringDescrLangid")
    4286                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4287                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4288              $C$DW$388       .dwtag  DW_TAG_member
    4289                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
    4290                      .dwattr $C$DW$388, DW_AT_name("curConfigStat")
    4291                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_curConfigStat")
    4292                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    4293                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4294              $C$DW$389       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$37)
    4296                      .dwattr $C$DW$389, DW_AT_name("audioClassIsoInEndptLnk")
    4297                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_audioClassIsoInEndptLnk")
    4298                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x172]
    4299                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4300              $C$DW$390       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$36)
    4302                      .dwattr $C$DW$390, DW_AT_name("ctrlBuffer")
    4303                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ctrlBuffer")
    4304                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    4305                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$391       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$37)
    4308                      .dwattr $C$DW$391, DW_AT_name("configDescrLnk")
    4309                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_configDescrLnk")
    4310                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x17e]
    4311                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4312              $C$DW$392       .dwtag  DW_TAG_member
    4313                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$40)
    4314                      .dwattr $C$DW$392, DW_AT_name("strDescr")
    4315                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_strDescr")
    4316                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    4317                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4318              $C$DW$393       .dwtag  DW_TAG_member
    4319                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$42)
    4320                      .dwattr $C$DW$393, DW_AT_name("acReqTable")
    4321                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_acReqTable")
    4322                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x186]
    4323                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4324              $C$DW$394       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
    4326                      .dwattr $C$DW$394, DW_AT_name("fpRequestHandler")
    4327                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_fpRequestHandler")
    4328                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    4329                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4330                      .dwendtag $C$DW$T$48
    4331              
    4332              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcCtrlObject")
    4333                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
    4334                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4335              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    4336                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$19)
    4337                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
    4338              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   96

    4339              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4340                      .dwattr $C$DW$T$67, DW_AT_name("CSL_AcInitStructApp")
    4341                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x22)
    4342              $C$DW$395       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
    4344                      .dwattr $C$DW$395, DW_AT_name("pAcObj")
    4345                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_pAcObj")
    4346                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4347                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4348              $C$DW$396       .dwtag  DW_TAG_member
    4349                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4350                      .dwattr $C$DW$396, DW_AT_name("pId")
    4351                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_pId")
    4352                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4353                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4354              $C$DW$397       .dwtag  DW_TAG_member
    4355                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4356                      .dwattr $C$DW$397, DW_AT_name("vId")
    4357                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_vId")
    4358                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4359                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4360              $C$DW$398       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4362                      .dwattr $C$DW$398, DW_AT_name("numLun")
    4363                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_numLun")
    4364                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4365                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4366              $C$DW$399       .dwtag  DW_TAG_member
    4367                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4368                      .dwattr $C$DW$399, DW_AT_name("txPktSize")
    4369                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_txPktSize")
    4370                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4371                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4372              $C$DW$400       .dwtag  DW_TAG_member
    4373                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4374                      .dwattr $C$DW$400, DW_AT_name("rxPktSize")
    4375                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rxPktSize")
    4376                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4377                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4378              $C$DW$401       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$40)
    4380                      .dwattr $C$DW$401, DW_AT_name("strDescrApp")
    4381                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_strDescrApp")
    4382                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4383                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4384              $C$DW$402       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$49)
    4386                      .dwattr $C$DW$402, DW_AT_name("lbaBufferApp")
    4387                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_lbaBufferApp")
    4388                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4389                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4390              $C$DW$403       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$42)
    4392                      .dwattr $C$DW$403, DW_AT_name("acReqTableApp")
    4393                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_acReqTableApp")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   97

    4394                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4395                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4396              $C$DW$404       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
    4398                      .dwattr $C$DW$404, DW_AT_name("isoHandler")
    4399                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_isoHandler")
    4400                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4401                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4402              $C$DW$405       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
    4404                      .dwattr $C$DW$405, DW_AT_name("ctrlHandler")
    4405                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ctrlHandler")
    4406                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4407                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4408              $C$DW$406       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$55)
    4410                      .dwattr $C$DW$406, DW_AT_name("playAudioApp")
    4411                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_playAudioApp")
    4412                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4413                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$407       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$57)
    4416                      .dwattr $C$DW$407, DW_AT_name("stopAudioApp")
    4417                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_stopAudioApp")
    4418                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4419                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$408       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
    4422                      .dwattr $C$DW$408, DW_AT_name("recordAudioApp")
    4423                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_recordAudioApp")
    4424                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4425                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4426              $C$DW$409       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$59)
    4428                      .dwattr $C$DW$409, DW_AT_name("mediaGetPresentStateApp")
    4429                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
    4430                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4431                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4432              $C$DW$410       .dwtag  DW_TAG_member
    4433                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$59)
    4434                      .dwattr $C$DW$410, DW_AT_name("mediaInitApp")
    4435                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_mediaInitApp")
    4436                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4437                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$411       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$59)
    4440                      .dwattr $C$DW$411, DW_AT_name("mediaEjectApp")
    4441                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_mediaEjectApp")
    4442                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4443                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4444              $C$DW$412       .dwtag  DW_TAG_member
    4445                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$63)
    4446                      .dwattr $C$DW$412, DW_AT_name("mediaLockUnitApp")
    4447                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_mediaLockUnitApp")
    4448                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   98

    4449                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4450              $C$DW$413       .dwtag  DW_TAG_member
    4451                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$66)
    4452                      .dwattr $C$DW$413, DW_AT_name("getMediaSizeApp")
    4453                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_getMediaSizeApp")
    4454                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4455                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4456                      .dwendtag $C$DW$T$67
    4457              
    4458              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcInitStructApp")
    4459                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$67)
    4460                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4461              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    4462                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4463                      .dwattr $C$DW$T$98, DW_AT_address_class(0x17)
    4464              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("pAcAppClassHandle")
    4465                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    4466                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4467              
    4468              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4469                      .dwattr $C$DW$T$69, DW_AT_name("CSL_AcLogicalUnit")
    4470                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x3e)
    4471              $C$DW$414       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$68)
    4473                      .dwattr $C$DW$414, DW_AT_name("scsiInquiryData")
    4474                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_scsiInquiryData")
    4475                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4476                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4477              $C$DW$415       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$64)
    4479                      .dwattr $C$DW$415, DW_AT_name("mediaSize")
    4480                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_mediaSize")
    4481                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4482                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$416       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$64)
    4485                      .dwattr $C$DW$416, DW_AT_name("currLba")
    4486                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_currLba")
    4487                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4488                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$417       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$64)
    4491                      .dwattr $C$DW$417, DW_AT_name("lbaSize")
    4492                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_lbaSize")
    4493                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4494                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$418       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    4497                      .dwattr $C$DW$418, DW_AT_name("removeable")
    4498                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_removeable")
    4499                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4500                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4501              $C$DW$419       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    4503                      .dwattr $C$DW$419, DW_AT_name("mediaState")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   99

    4504                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_mediaState")
    4505                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4506                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4507              $C$DW$420       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    4509                      .dwattr $C$DW$420, DW_AT_name("readwrite")
    4510                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_readwrite")
    4511                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4512                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$421       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    4515                      .dwattr $C$DW$421, DW_AT_name("lbaCnt")
    4516                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_lbaCnt")
    4517                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4518                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$422       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    4521                      .dwattr $C$DW$422, DW_AT_name("verifyFlag")
    4522                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_verifyFlag")
    4523                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4524                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4525                      .dwendtag $C$DW$T$69
    4526              
    4527              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcLogicalUnit")
    4528                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4529                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4530              
    4531              $C$DW$T$71      .dwtag  DW_TAG_array_type
    4532                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4533                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4534                      .dwattr $C$DW$T$71, DW_AT_byte_size(0xf8)
    4535              $C$DW$423       .dwtag  DW_TAG_subrange_type
    4536                      .dwattr $C$DW$423, DW_AT_upper_bound(0x03)
    4537                      .dwendtag $C$DW$T$71
    4538              
    4539              
    4540              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4541                      .dwattr $C$DW$T$75, DW_AT_name("CSL_AcObject")
    4542                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x16c)
    4543              $C$DW$424       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
    4545                      .dwattr $C$DW$424, DW_AT_name("recordAudio")
    4546                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_recordAudio")
    4547                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4548                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$425       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$55)
    4551                      .dwattr $C$DW$425, DW_AT_name("playAudio")
    4552                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_playAudio")
    4553                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4554                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4555              $C$DW$426       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$57)
    4557                      .dwattr $C$DW$426, DW_AT_name("stopAudio")
    4558                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_stopAudio")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  100

    4559                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4560                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4561              $C$DW$427       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$59)
    4563                      .dwattr $C$DW$427, DW_AT_name("mediaGetPresentState")
    4564                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_mediaGetPresentState")
    4565                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4566                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$428       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
    4569                      .dwattr $C$DW$428, DW_AT_name("mediaInit")
    4570                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_mediaInit")
    4571                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4572                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$429       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$59)
    4575                      .dwattr $C$DW$429, DW_AT_name("mediaEject")
    4576                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_mediaEject")
    4577                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4578                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$430       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$63)
    4581                      .dwattr $C$DW$430, DW_AT_name("mediaLockUnit")
    4582                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_mediaLockUnit")
    4583                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4584                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4585              $C$DW$431       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$66)
    4587                      .dwattr $C$DW$431, DW_AT_name("getMediaSize")
    4588                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_getMediaSize")
    4589                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4590                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$432       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$49)
    4593                      .dwattr $C$DW$432, DW_AT_name("lbaBuffer")
    4594                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_lbaBuffer")
    4595                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4596                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$433       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$64)
    4599                      .dwattr $C$DW$433, DW_AT_name("cbwDataTransferLength")
    4600                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_cbwDataTransferLength")
    4601                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4602                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$434       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$71)
    4605                      .dwattr $C$DW$434, DW_AT_name("lun")
    4606                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_lun")
    4607                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4608                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$435       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$72)
    4611                      .dwattr $C$DW$435, DW_AT_name("senseData")
    4612                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_senseData")
    4613                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  101

    4614                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$436       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
    4617                      .dwattr $C$DW$436, DW_AT_name("activityPresentFlag")
    4618                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_activityPresentFlag")
    4619                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x11b]
    4620                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$437       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$73)
    4623                      .dwattr $C$DW$437, DW_AT_name("csw")
    4624                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_csw")
    4625                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    4626                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$438       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$30)
    4629                      .dwattr $C$DW$438, DW_AT_name("readCapacity")
    4630                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_readCapacity")
    4631                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4632                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$439       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$74)
    4635                      .dwattr $C$DW$439, DW_AT_name("cbw")
    4636                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cbw")
    4637                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
    4638                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$440       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    4641                      .dwattr $C$DW$440, DW_AT_name("isoInEpObj")
    4642                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_isoInEpObj")
    4643                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    4644                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$441       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    4647                      .dwattr $C$DW$441, DW_AT_name("isoOutEpObj")
    4648                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_isoOutEpObj")
    4649                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    4650                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$442       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$25)
    4653                      .dwattr $C$DW$442, DW_AT_name("noOfLun")
    4654                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_noOfLun")
    4655                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4656                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$443       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$25)
    4659                      .dwattr $C$DW$443, DW_AT_name("mediaState")
    4660                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_mediaState")
    4661                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x165]
    4662                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$444       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$25)
    4665                      .dwattr $C$DW$444, DW_AT_name("playBackActive")
    4666                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_playBackActive")
    4667                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x166]
    4668                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  102

    4669              $C$DW$445       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$25)
    4671                      .dwattr $C$DW$445, DW_AT_name("mediaInitDone")
    4672                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_mediaInitDone")
    4673                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x167]
    4674                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$446       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$32)
    4677                      .dwattr $C$DW$446, DW_AT_name("tempBuffer")
    4678                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_tempBuffer")
    4679                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    4680                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4681                      .dwendtag $C$DW$T$75
    4682              
    4683              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcObject")
    4684                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$75)
    4685                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4686              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4687                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$20)
    4688                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    4689              
    4690              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4691                      .dwattr $C$DW$T$77, DW_AT_name("CSL_AcRequestStruct")
    4692                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    4693              $C$DW$447       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$76)
    4695                      .dwattr $C$DW$447, DW_AT_name("request")
    4696                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_request")
    4697                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4698                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4699              $C$DW$448       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$47)
    4701                      .dwattr $C$DW$448, DW_AT_name("fpRequestHandler")
    4702                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_fpRequestHandler")
    4703                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4704                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4705                      .dwendtag $C$DW$T$77
    4706              
    4707              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcRequestStruct")
    4708                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$77)
    4709                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4710              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4711                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4712                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    4713              
    4714              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4715                      .dwattr $C$DW$T$79, DW_AT_name("CSL_UsbDataStruct")
    4716                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x06)
    4717              $C$DW$449       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
    4719                      .dwattr $C$DW$449, DW_AT_name("bytes")
    4720                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_bytes")
    4721                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$450       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  103

    4724                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$49)
    4725                      .dwattr $C$DW$450, DW_AT_name("pBuffer")
    4726                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pBuffer")
    4727                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4728                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$451       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$78)
    4731                      .dwattr $C$DW$451, DW_AT_name("pNextBuffer")
    4732                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_pNextBuffer")
    4733                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4734                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4735                      .dwendtag $C$DW$T$79
    4736              
    4737              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
    4738                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$79)
    4739                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4740              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4741                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
    4742                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    4743              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4744                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$79)
    4745                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    4746              
    4747              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4748                      .dwattr $C$DW$T$86, DW_AT_name("CSL_UsbEpObj")
    4749                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x14)
    4750              $C$DW$452       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$81)
    4752                      .dwattr $C$DW$452, DW_AT_name("epNum")
    4753                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_epNum")
    4754                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4755                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4756              $C$DW$453       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$83)
    4758                      .dwattr $C$DW$453, DW_AT_name("xferType")
    4759                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_xferType")
    4760                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4761                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$454       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$25)
    4764                      .dwattr $C$DW$454, DW_AT_name("maxPktSiz")
    4765                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_maxPktSiz")
    4766                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4767                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$455       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$25)
    4770                      .dwattr $C$DW$455, DW_AT_name("eventMask")
    4771                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_eventMask")
    4772                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4773                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$456       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$84)
    4776                      .dwattr $C$DW$456, DW_AT_name("fxn")
    4777                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fxn")
    4778                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  104

    4779                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4780              $C$DW$457       .dwtag  DW_TAG_member
    4781                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$25)
    4782                      .dwattr $C$DW$457, DW_AT_name("dataFlags")
    4783                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_dataFlags")
    4784                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4785                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4786              $C$DW$458       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$25)
    4788                      .dwattr $C$DW$458, DW_AT_name("status")
    4789                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_status")
    4790                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4791                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$459       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$25)
    4794                      .dwattr $C$DW$459, DW_AT_name("epDescRegSAddr")
    4795                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_epDescRegSAddr")
    4796                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4797                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$460       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$25)
    4800                      .dwattr $C$DW$460, DW_AT_name("dmaRegSAddr")
    4801                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_dmaRegSAddr")
    4802                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4803                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$461       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$25)
    4806                      .dwattr $C$DW$461, DW_AT_name("totByteCnt")
    4807                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_totByteCnt")
    4808                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4809                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4810              $C$DW$462       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
    4812                      .dwattr $C$DW$462, DW_AT_name("byteInThisSeg")
    4813                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_byteInThisSeg")
    4814                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4815                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4816              $C$DW$463       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$49)
    4818                      .dwattr $C$DW$463, DW_AT_name("xferBytCnt")
    4819                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_xferBytCnt")
    4820                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4821                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4822              $C$DW$464       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$49)
    4824                      .dwattr $C$DW$464, DW_AT_name("pBuffer")
    4825                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_pBuffer")
    4826                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4827                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4828              $C$DW$465       .dwtag  DW_TAG_member
    4829                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$85)
    4830                      .dwattr $C$DW$465, DW_AT_name("pNextBuffer")
    4831                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_pNextBuffer")
    4832                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4833                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  105

    4834              $C$DW$466       .dwtag  DW_TAG_member
    4835                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
    4836                      .dwattr $C$DW$466, DW_AT_name("eventFlag")
    4837                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_eventFlag")
    4838                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4839                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4840                      .dwendtag $C$DW$T$86
    4841              
    4842              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
    4843                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$86)
    4844                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4845              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4846                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
    4847                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    4848              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
    4849                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4850                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4851              
    4852              $C$DW$T$28      .dwtag  DW_TAG_array_type
    4853                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4854                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4855                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    4856              $C$DW$467       .dwtag  DW_TAG_subrange_type
    4857                      .dwattr $C$DW$467, DW_AT_upper_bound(0x04)
    4858                      .dwendtag $C$DW$T$28
    4859              
    4860              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4861                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$27)
    4862                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    4863              
    4864              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    4865                      .dwattr $C$DW$T$87, DW_AT_name("CSL_UsbSetupStruct")
    4866                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    4867              $C$DW$468       .dwtag  DW_TAG_member
    4868                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
    4869                      .dwattr $C$DW$468, DW_AT_name("newPacket")
    4870                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_newPacket")
    4871                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4872                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$469       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$25)
    4875                      .dwattr $C$DW$469, DW_AT_name("bmRequestType")
    4876                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_bmRequestType")
    4877                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4878                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4879              $C$DW$470       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$25)
    4881                      .dwattr $C$DW$470, DW_AT_name("bRequest")
    4882                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_bRequest")
    4883                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4884                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$471       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$25)
    4887                      .dwattr $C$DW$471, DW_AT_name("wValue")
    4888                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_wValue")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  106

    4889                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4890                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4891              $C$DW$472       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$25)
    4893                      .dwattr $C$DW$472, DW_AT_name("wIndex")
    4894                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_wIndex")
    4895                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4896                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$473       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$25)
    4899                      .dwattr $C$DW$473, DW_AT_name("wLength")
    4900                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_wLength")
    4901                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4902                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4903                      .dwendtag $C$DW$T$87
    4904              
    4905              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
    4906                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$87)
    4907                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4908              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4909                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$29)
    4910                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    4911              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4912                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4913              
    4914              $C$DW$T$50      .dwtag  DW_TAG_subroutine_type
    4915                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4916              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4917                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4918                      .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    4919              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
    4920                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$51)
    4921                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4922              $C$DW$474       .dwtag  DW_TAG_TI_far_type
    4923              $C$DW$T$103     .dwtag  DW_TAG_const_type
    4924                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$474)
    4925              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4926                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4927                      .dwattr $C$DW$T$104, DW_AT_address_class(0x17)
    4928              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4929                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4930                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4931                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4932              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4933                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4934                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4935                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4936              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4937                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4938                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4939                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4940              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4941                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4942                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4943                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  107

    4944              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4945                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4946                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4947                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4948              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    4949                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$8)
    4950                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4951              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    4952                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4953                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
