TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE    1

    6292              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:32:44 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3188                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    3189              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    3190              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    3191                      .dwendtag $C$DW$T$100
    3192              
    3193              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    3194                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    3195                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3196              
    3197              $C$DW$T$114     .dwtag  DW_TAG_enumeration_type
    3198                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
    3199              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    3200              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    3201              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    3202              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    3203              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    3204              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    3205              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    3206              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    3207              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    3208              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    3209              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    3210              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    3211              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    3212              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    3213              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    3214              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    3215                      .dwendtag $C$DW$T$114
    3216              
    3217              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    3218                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    3219                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3220              
    3221              $C$DW$T$116     .dwtag  DW_TAG_enumeration_type
    3222                      .dwattr $C$DW$T$116, DW_AT_byte_size(0x01)
    3223              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    3224              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    3225              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    3226              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    3227              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   78

    3228                      .dwendtag $C$DW$T$116
    3229              
    3230              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    3231                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    3232                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3233              
    3234              $C$DW$T$132     .dwtag  DW_TAG_enumeration_type
    3235                      .dwattr $C$DW$T$132, DW_AT_byte_size(0x01)
    3236              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DONE"), DW_AT_const_value(0x00)
    3237              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_STALL"), DW_AT_const_value(0x01)
    3238              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_SEND_ACK"), DW_AT_const_value(0x02)
    3239              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_GET_ACK"), DW_AT_const_value(0x03)
    3240              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_IN"), DW_AT_const_value(0x04)
    3241              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_OUT"), DW_AT_const_value(0x05)
    3242                      .dwendtag $C$DW$T$132
    3243              
    3244              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcRequestRet")
    3245                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    3246                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    3247              
    3248              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3249                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
    3250              $C$DW$270       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3252                      .dwattr $C$DW$270, DW_AT_name("dwBaudRate")
    3253                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_dwBaudRate")
    3254                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3255                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3256              $C$DW$271       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    3258                      .dwattr $C$DW$271, DW_AT_name("wCharFormat")
    3259                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_wCharFormat")
    3260                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3261                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$272       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    3264                      .dwattr $C$DW$272, DW_AT_name("wParityType")
    3265                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_wParityType")
    3266                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3267                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3268              $C$DW$273       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    3270                      .dwattr $C$DW$273, DW_AT_name("wDataBits")
    3271                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_wDataBits")
    3272                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3273                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3274                      .dwendtag $C$DW$T$21
    3275              
    3276              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcLineCoding")
    3277                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$21)
    3278                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3279              
    3280              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3281                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    3282              $C$DW$274       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   79

    3283                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$22)
    3284                      .dwattr $C$DW$274, DW_AT_name("TXFUNCADDR")
    3285                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_TXFUNCADDR")
    3286                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3287                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$275       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$22)
    3290                      .dwattr $C$DW$275, DW_AT_name("TXHUBADDR_TXHUBPORT")
    3291                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    3292                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3293                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$276       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    3296                      .dwattr $C$DW$276, DW_AT_name("RSVD0")
    3297                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_RSVD0")
    3298                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3299                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$277       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$22)
    3302                      .dwattr $C$DW$277, DW_AT_name("RXFUNCADDR")
    3303                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_RXFUNCADDR")
    3304                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3305                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$278       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$22)
    3308                      .dwattr $C$DW$278, DW_AT_name("RXHUBADDR_RXHUBPORT")
    3309                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    3310                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3311                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$279       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
    3314                      .dwattr $C$DW$279, DW_AT_name("RSVD36")
    3315                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD36")
    3316                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3317                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3318                      .dwendtag $C$DW$T$24
    3319              
    3320              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    3321                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$24)
    3322                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3323              
    3324              $C$DW$T$42      .dwtag  DW_TAG_array_type
    3325                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3326                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3327                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x28)
    3328              $C$DW$280       .dwtag  DW_TAG_subrange_type
    3329                      .dwattr $C$DW$280, DW_AT_upper_bound(0x04)
    3330                      .dwendtag $C$DW$T$42
    3331              
    3332              
    3333              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3334                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    3335              $C$DW$281       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    3337                      .dwattr $C$DW$281, DW_AT_name("TXMAXP")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   80

    3338                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_TXMAXP")
    3339                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3340                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$282       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    3343                      .dwattr $C$DW$282, DW_AT_name("PERI_TXCSR")
    3344                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_PERI_TXCSR")
    3345                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3346                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$283       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
    3349                      .dwattr $C$DW$283, DW_AT_name("RSVD0")
    3350                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_RSVD0")
    3351                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3352                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$284       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    3355                      .dwattr $C$DW$284, DW_AT_name("RXMAXP")
    3356                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RXMAXP")
    3357                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3358                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$285       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
    3361                      .dwattr $C$DW$285, DW_AT_name("PERI_RXCSR")
    3362                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_PERI_RXCSR")
    3363                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3364                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$286       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    3367                      .dwattr $C$DW$286, DW_AT_name("RSVD1")
    3368                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_RSVD1")
    3369                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3370                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$287       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$22)
    3373                      .dwattr $C$DW$287, DW_AT_name("RXCOUNT")
    3374                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RXCOUNT")
    3375                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3376                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$288       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    3379                      .dwattr $C$DW$288, DW_AT_name("RSVD41")
    3380                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_RSVD41")
    3381                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3382                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3383                      .dwendtag $C$DW$T$26
    3384              
    3385              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    3386                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$26)
    3387                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3388              
    3389              $C$DW$T$45      .dwtag  DW_TAG_array_type
    3390                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3391                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3392                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   81

    3393              $C$DW$289       .dwtag  DW_TAG_subrange_type
    3394                      .dwattr $C$DW$289, DW_AT_upper_bound(0x03)
    3395                      .dwendtag $C$DW$T$45
    3396              
    3397              
    3398              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3399                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x20)
    3400              $C$DW$290       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$22)
    3402                      .dwattr $C$DW$290, DW_AT_name("TXGCR1")
    3403                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_TXGCR1")
    3404                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3405                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$291       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    3408                      .dwattr $C$DW$291, DW_AT_name("TXGCR2")
    3409                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_TXGCR2")
    3410                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3411                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$292       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    3414                      .dwattr $C$DW$292, DW_AT_name("RSVD0")
    3415                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_RSVD0")
    3416                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3417                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$293       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$22)
    3420                      .dwattr $C$DW$293, DW_AT_name("RXGCR1")
    3421                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RXGCR1")
    3422                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3423                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$294       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$22)
    3426                      .dwattr $C$DW$294, DW_AT_name("RXGCR2")
    3427                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_RXGCR2")
    3428                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3429                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3430              $C$DW$295       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    3432                      .dwattr $C$DW$295, DW_AT_name("RSVD1")
    3433                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD1")
    3434                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3435                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$296       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
    3438                      .dwattr $C$DW$296, DW_AT_name("RXHPCR1A")
    3439                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_RXHPCR1A")
    3440                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3441                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$297       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$22)
    3444                      .dwattr $C$DW$297, DW_AT_name("RXHPCR2A")
    3445                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RXHPCR2A")
    3446                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3447                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   82

    3448              $C$DW$298       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$23)
    3450                      .dwattr $C$DW$298, DW_AT_name("RSVD2")
    3451                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_RSVD2")
    3452                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3453                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$299       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    3456                      .dwattr $C$DW$299, DW_AT_name("RXHPCR1B")
    3457                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RXHPCR1B")
    3458                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3459                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$300       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    3462                      .dwattr $C$DW$300, DW_AT_name("RXHPCR2B")
    3463                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_RXHPCR2B")
    3464                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3465                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3466              $C$DW$301       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$28)
    3468                      .dwattr $C$DW$301, DW_AT_name("RSVD46")
    3469                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD46")
    3470                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3471                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3472                      .dwendtag $C$DW$T$29
    3473              
    3474              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    3475                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
    3476                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3477              
    3478              $C$DW$T$49      .dwtag  DW_TAG_array_type
    3479                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3480                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3481                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x80)
    3482              $C$DW$302       .dwtag  DW_TAG_subrange_type
    3483                      .dwattr $C$DW$302, DW_AT_upper_bound(0x03)
    3484                      .dwendtag $C$DW$T$49
    3485              
    3486              
    3487              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3488                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    3489              $C$DW$303       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$22)
    3491                      .dwattr $C$DW$303, DW_AT_name("ENTRYLSW")
    3492                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_ENTRYLSW")
    3493                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3494                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$304       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$22)
    3497                      .dwattr $C$DW$304, DW_AT_name("ENTRYMSW")
    3498                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ENTRYMSW")
    3499                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3500                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$305       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   83

    3503                      .dwattr $C$DW$305, DW_AT_name("RSVD49")
    3504                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD49")
    3505                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3506                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3507                      .dwendtag $C$DW$T$30
    3508              
    3509              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    3510                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$30)
    3511                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3512              
    3513              $C$DW$T$53      .dwtag  DW_TAG_array_type
    3514                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3515                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3516                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x100)
    3517              $C$DW$306       .dwtag  DW_TAG_subrange_type
    3518                      .dwattr $C$DW$306, DW_AT_upper_bound(0x3f)
    3519                      .dwendtag $C$DW$T$53
    3520              
    3521              
    3522              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3523                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    3524              $C$DW$307       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    3526                      .dwattr $C$DW$307, DW_AT_name("QMEMRBASE1")
    3527                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_QMEMRBASE1")
    3528                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3529                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3530              $C$DW$308       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    3532                      .dwattr $C$DW$308, DW_AT_name("QMEMRBASE2")
    3533                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_QMEMRBASE2")
    3534                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3535                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3536              $C$DW$309       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
    3538                      .dwattr $C$DW$309, DW_AT_name("RSVD0")
    3539                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD0")
    3540                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3541                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3542              $C$DW$310       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$22)
    3544                      .dwattr $C$DW$310, DW_AT_name("QMEMRCTRL1")
    3545                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    3546                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3547                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3548              $C$DW$311       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    3550                      .dwattr $C$DW$311, DW_AT_name("QMEMRCTRL2")
    3551                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    3552                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3553                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3554              $C$DW$312       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$31)
    3556                      .dwattr $C$DW$312, DW_AT_name("RSVD63")
    3557                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD63")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   84

    3558                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3559                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3560                      .dwendtag $C$DW$T$32
    3561              
    3562              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    3563                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$32)
    3564                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3565              
    3566              $C$DW$T$59      .dwtag  DW_TAG_array_type
    3567                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3568                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3569                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x100)
    3570              $C$DW$313       .dwtag  DW_TAG_subrange_type
    3571                      .dwattr $C$DW$313, DW_AT_upper_bound(0x0f)
    3572                      .dwendtag $C$DW$T$59
    3573              
    3574              
    3575              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3576                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    3577              $C$DW$314       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$33)
    3579                      .dwattr $C$DW$314, DW_AT_name("RSVD0")
    3580                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD0")
    3581                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3582                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3583              $C$DW$315       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
    3585                      .dwattr $C$DW$315, DW_AT_name("CTRL1D")
    3586                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_CTRL1D")
    3587                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3588                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3589              $C$DW$316       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$22)
    3591                      .dwattr $C$DW$316, DW_AT_name("CTRL2D")
    3592                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_CTRL2D")
    3593                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3594                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3595              $C$DW$317       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$23)
    3597                      .dwattr $C$DW$317, DW_AT_name("RSVD65")
    3598                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD65")
    3599                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3600                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3601                      .dwendtag $C$DW$T$34
    3602              
    3603              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    3604                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    3605                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3606              
    3607              $C$DW$T$62      .dwtag  DW_TAG_array_type
    3608                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3609                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3610                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x400)
    3611              $C$DW$318       .dwtag  DW_TAG_subrange_type
    3612                      .dwattr $C$DW$318, DW_AT_upper_bound(0x3f)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   85

    3613                      .dwendtag $C$DW$T$62
    3614              
    3615              
    3616              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3617                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    3618              $C$DW$319       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    3620                      .dwattr $C$DW$319, DW_AT_name("QSTATA")
    3621                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_QSTATA")
    3622                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3623                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$320       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$35)
    3626                      .dwattr $C$DW$320, DW_AT_name("RSVD0")
    3627                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD0")
    3628                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3629                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$321       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    3632                      .dwattr $C$DW$321, DW_AT_name("QSTAT1B")
    3633                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_QSTAT1B")
    3634                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3635                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$322       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    3638                      .dwattr $C$DW$322, DW_AT_name("QSTAT2B")
    3639                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_QSTAT2B")
    3640                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3641                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$323       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$23)
    3644                      .dwattr $C$DW$323, DW_AT_name("RSVD1")
    3645                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD1")
    3646                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3647                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$324       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    3650                      .dwattr $C$DW$324, DW_AT_name("QSTAT1C")
    3651                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_QSTAT1C")
    3652                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3653                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$325       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$25)
    3656                      .dwattr $C$DW$325, DW_AT_name("RSVD67")
    3657                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_RSVD67")
    3658                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3659                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3660                      .dwendtag $C$DW$T$36
    3661              
    3662              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    3663                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$36)
    3664                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3665              
    3666              $C$DW$T$65      .dwtag  DW_TAG_array_type
    3667                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   86

    3668                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3669                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x400)
    3670              $C$DW$326       .dwtag  DW_TAG_subrange_type
    3671                      .dwattr $C$DW$326, DW_AT_upper_bound(0x3f)
    3672                      .dwendtag $C$DW$T$65
    3673              
    3674              
    3675              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3676                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x6c00)
    3677              $C$DW$327       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    3679                      .dwattr $C$DW$327, DW_AT_name("REVID1")
    3680                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_REVID1")
    3681                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3682                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3683              $C$DW$328       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
    3685                      .dwattr $C$DW$328, DW_AT_name("REVID2")
    3686                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_REVID2")
    3687                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3688                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3689              $C$DW$329       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
    3691                      .dwattr $C$DW$329, DW_AT_name("RSVD0")
    3692                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_RSVD0")
    3693                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3694                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$330       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$22)
    3697                      .dwattr $C$DW$330, DW_AT_name("CTRLR")
    3698                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_CTRLR")
    3699                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3700                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$331       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$35)
    3703                      .dwattr $C$DW$331, DW_AT_name("RSVD1")
    3704                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD1")
    3705                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3706                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$332       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
    3709                      .dwattr $C$DW$332, DW_AT_name("STATR")
    3710                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_STATR")
    3711                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3712                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$333       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$35)
    3715                      .dwattr $C$DW$333, DW_AT_name("RSVD2")
    3716                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD2")
    3717                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3718                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$334       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
    3721                      .dwattr $C$DW$334, DW_AT_name("EMUR")
    3722                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_EMUR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   87

    3723                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3724                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$335       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$35)
    3727                      .dwattr $C$DW$335, DW_AT_name("RSVD3")
    3728                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD3")
    3729                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3730                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$336       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$22)
    3733                      .dwattr $C$DW$336, DW_AT_name("MODE1")
    3734                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_MODE1")
    3735                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3736                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3737              $C$DW$337       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$22)
    3739                      .dwattr $C$DW$337, DW_AT_name("MODE2")
    3740                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_MODE2")
    3741                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3742                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3743              $C$DW$338       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3745                      .dwattr $C$DW$338, DW_AT_name("RSVD4")
    3746                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD4")
    3747                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3748                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3749              $C$DW$339       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$22)
    3751                      .dwattr $C$DW$339, DW_AT_name("AUTOREQ")
    3752                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_AUTOREQ")
    3753                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3754                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3755              $C$DW$340       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$35)
    3757                      .dwattr $C$DW$340, DW_AT_name("RSVD5")
    3758                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD5")
    3759                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3760                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3761              $C$DW$341       .dwtag  DW_TAG_member
    3762                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    3763                      .dwattr $C$DW$341, DW_AT_name("SPRFIXTIME1")
    3764                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    3765                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3766                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3767              $C$DW$342       .dwtag  DW_TAG_member
    3768                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
    3769                      .dwattr $C$DW$342, DW_AT_name("SPRFIXTIME2")
    3770                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    3771                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3772                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3773              $C$DW$343       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3775                      .dwattr $C$DW$343, DW_AT_name("RSVD6")
    3776                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD6")
    3777                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   88

    3778                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3779              $C$DW$344       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    3781                      .dwattr $C$DW$344, DW_AT_name("TEARDOWN1")
    3782                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_TEARDOWN1")
    3783                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3784                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3785              $C$DW$345       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    3787                      .dwattr $C$DW$345, DW_AT_name("TEARDOWN2")
    3788                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_TEARDOWN2")
    3789                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3790                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$346       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3793                      .dwattr $C$DW$346, DW_AT_name("RSVD7")
    3794                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD7")
    3795                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3796                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3797              $C$DW$347       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    3799                      .dwattr $C$DW$347, DW_AT_name("INTSRCR1")
    3800                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_INTSRCR1")
    3801                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3802                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3803              $C$DW$348       .dwtag  DW_TAG_member
    3804                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    3805                      .dwattr $C$DW$348, DW_AT_name("INTSRCR2")
    3806                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_INTSRCR2")
    3807                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3808                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3809              $C$DW$349       .dwtag  DW_TAG_member
    3810                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3811                      .dwattr $C$DW$349, DW_AT_name("RSVD8")
    3812                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD8")
    3813                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3814                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3815              $C$DW$350       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3817                      .dwattr $C$DW$350, DW_AT_name("INTSETR1")
    3818                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_INTSETR1")
    3819                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3820                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3821              $C$DW$351       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$22)
    3823                      .dwattr $C$DW$351, DW_AT_name("INTSETR2")
    3824                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_INTSETR2")
    3825                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3826                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$352       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3829                      .dwattr $C$DW$352, DW_AT_name("RSVD9")
    3830                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD9")
    3831                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3832                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   89

    3833              $C$DW$353       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$22)
    3835                      .dwattr $C$DW$353, DW_AT_name("INTCLRR1")
    3836                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_INTCLRR1")
    3837                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3838                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3839              $C$DW$354       .dwtag  DW_TAG_member
    3840                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$22)
    3841                      .dwattr $C$DW$354, DW_AT_name("INTCLRR2")
    3842                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_INTCLRR2")
    3843                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3844                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3845              $C$DW$355       .dwtag  DW_TAG_member
    3846                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3847                      .dwattr $C$DW$355, DW_AT_name("RSVD10")
    3848                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD10")
    3849                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3850                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3851              $C$DW$356       .dwtag  DW_TAG_member
    3852                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
    3853                      .dwattr $C$DW$356, DW_AT_name("INTMSKR1")
    3854                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_INTMSKR1")
    3855                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3856                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3857              $C$DW$357       .dwtag  DW_TAG_member
    3858                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
    3859                      .dwattr $C$DW$357, DW_AT_name("INTMSKR2")
    3860                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_INTMSKR2")
    3861                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3862                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3863              $C$DW$358       .dwtag  DW_TAG_member
    3864                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3865                      .dwattr $C$DW$358, DW_AT_name("RSVD11")
    3866                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD11")
    3867                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3868                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3869              $C$DW$359       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$22)
    3871                      .dwattr $C$DW$359, DW_AT_name("INTMSKSETR1")
    3872                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_INTMSKSETR1")
    3873                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3874                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3875              $C$DW$360       .dwtag  DW_TAG_member
    3876                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$22)
    3877                      .dwattr $C$DW$360, DW_AT_name("INTMSKSETR2")
    3878                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_INTMSKSETR2")
    3879                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3880                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3881              $C$DW$361       .dwtag  DW_TAG_member
    3882                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    3883                      .dwattr $C$DW$361, DW_AT_name("RSVD12")
    3884                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD12")
    3885                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3886                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3887              $C$DW$362       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   90

    3888                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
    3889                      .dwattr $C$DW$362, DW_AT_name("INTMSKCLRR1")
    3890                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    3891                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3892                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3893              $C$DW$363       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
    3895                      .dwattr $C$DW$363, DW_AT_name("INTMSKCLRR2")
    3896                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    3897                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3898                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3899              $C$DW$364       .dwtag  DW_TAG_member
    3900                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    3901                      .dwattr $C$DW$364, DW_AT_name("RSVD13")
    3902                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD13")
    3903                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3904                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3905              $C$DW$365       .dwtag  DW_TAG_member
    3906                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
    3907                      .dwattr $C$DW$365, DW_AT_name("INTMASKEDR1")
    3908                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_INTMASKEDR1")
    3909                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3910                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3911              $C$DW$366       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    3913                      .dwattr $C$DW$366, DW_AT_name("INTMASKEDR2")
    3914                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_INTMASKEDR2")
    3915                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3916                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3917              $C$DW$367       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    3919                      .dwattr $C$DW$367, DW_AT_name("RSVD14")
    3920                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RSVD14")
    3921                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3922                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3923              $C$DW$368       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    3925                      .dwattr $C$DW$368, DW_AT_name("EOIR")
    3926                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_EOIR")
    3927                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3928                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3929              $C$DW$369       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$35)
    3931                      .dwattr $C$DW$369, DW_AT_name("RSVD15")
    3932                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD15")
    3933                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    3934                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3935              $C$DW$370       .dwtag  DW_TAG_member
    3936                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$22)
    3937                      .dwattr $C$DW$370, DW_AT_name("INTVECTR1")
    3938                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_INTVECTR1")
    3939                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3940                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3941              $C$DW$371       .dwtag  DW_TAG_member
    3942                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   91

    3943                      .dwattr $C$DW$371, DW_AT_name("INTVECTR2")
    3944                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_INTVECTR2")
    3945                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3946                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3947              $C$DW$372       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
    3949                      .dwattr $C$DW$372, DW_AT_name("RSVD16")
    3950                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD16")
    3951                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3952                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3953              $C$DW$373       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    3955                      .dwattr $C$DW$373, DW_AT_name("GREP1SZR1")
    3956                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_GREP1SZR1")
    3957                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3958                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3959              $C$DW$374       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$22)
    3961                      .dwattr $C$DW$374, DW_AT_name("GREP1SZR2")
    3962                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_GREP1SZR2")
    3963                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    3964                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3965              $C$DW$375       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    3967                      .dwattr $C$DW$375, DW_AT_name("RSVD17")
    3968                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RSVD17")
    3969                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    3970                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3971              $C$DW$376       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$22)
    3973                      .dwattr $C$DW$376, DW_AT_name("GREP2SZR1")
    3974                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_GREP2SZR1")
    3975                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3976                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3977              $C$DW$377       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$22)
    3979                      .dwattr $C$DW$377, DW_AT_name("GREP2SZR2")
    3980                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_GREP2SZR2")
    3981                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    3982                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$378       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    3985                      .dwattr $C$DW$378, DW_AT_name("RSVD18")
    3986                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD18")
    3987                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3988                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$379       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$22)
    3991                      .dwattr $C$DW$379, DW_AT_name("GREP3SZR1")
    3992                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_GREP3SZR1")
    3993                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3994                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$380       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
    3997                      .dwattr $C$DW$380, DW_AT_name("GREP3SZR2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   92

    3998                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_GREP3SZR2")
    3999                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    4000                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$381       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    4003                      .dwattr $C$DW$381, DW_AT_name("RSVD19")
    4004                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD19")
    4005                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4006                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$382       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
    4009                      .dwattr $C$DW$382, DW_AT_name("GREP4SZR1")
    4010                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_GREP4SZR1")
    4011                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4012                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$383       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$22)
    4015                      .dwattr $C$DW$383, DW_AT_name("GREP4SZR2")
    4016                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_GREP4SZR2")
    4017                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    4018                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$384       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
    4021                      .dwattr $C$DW$384, DW_AT_name("RSVD20")
    4022                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD20")
    4023                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4024                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4025              $C$DW$385       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$22)
    4027                      .dwattr $C$DW$385, DW_AT_name("FADDR_POWER")
    4028                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_FADDR_POWER")
    4029                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    4030                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4031              $C$DW$386       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$22)
    4033                      .dwattr $C$DW$386, DW_AT_name("INTRTX")
    4034                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_INTRTX")
    4035                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    4036                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4037              $C$DW$387       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4039                      .dwattr $C$DW$387, DW_AT_name("RSVD21")
    4040                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RSVD21")
    4041                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    4042                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4043              $C$DW$388       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$22)
    4045                      .dwattr $C$DW$388, DW_AT_name("INTRRX")
    4046                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_INTRRX")
    4047                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    4048                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$389       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$22)
    4051                      .dwattr $C$DW$389, DW_AT_name("INTRTXE")
    4052                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_INTRTXE")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   93

    4053                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    4054                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$390       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4057                      .dwattr $C$DW$390, DW_AT_name("RSVD22")
    4058                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD22")
    4059                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    4060                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4061              $C$DW$391       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$22)
    4063                      .dwattr $C$DW$391, DW_AT_name("INTRRXE")
    4064                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_INTRRXE")
    4065                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    4066                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4067              $C$DW$392       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$22)
    4069                      .dwattr $C$DW$392, DW_AT_name("INTRUSB_INTRUSBE")
    4070                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    4071                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    4072                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$393       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4075                      .dwattr $C$DW$393, DW_AT_name("RSVD23")
    4076                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_RSVD23")
    4077                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    4078                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4079              $C$DW$394       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$22)
    4081                      .dwattr $C$DW$394, DW_AT_name("FRAME")
    4082                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_FRAME")
    4083                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    4084                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$395       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$22)
    4087                      .dwattr $C$DW$395, DW_AT_name("INDEX_TESTMODE")
    4088                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    4089                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    4090                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4091              $C$DW$396       .dwtag  DW_TAG_member
    4092                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
    4093                      .dwattr $C$DW$396, DW_AT_name("RSVD24")
    4094                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_RSVD24")
    4095                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    4096                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4097              $C$DW$397       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$22)
    4099                      .dwattr $C$DW$397, DW_AT_name("TXMAXP_INDX")
    4100                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    4101                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    4102                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$398       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$22)
    4105                      .dwattr $C$DW$398, DW_AT_name("PERI_CSR0_INDX")
    4106                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    4107                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   94

    4108                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$399       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4111                      .dwattr $C$DW$399, DW_AT_name("RSVD25")
    4112                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RSVD25")
    4113                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    4114                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$400       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$22)
    4117                      .dwattr $C$DW$400, DW_AT_name("RXMAXP_INDX")
    4118                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    4119                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    4120                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$401       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$22)
    4123                      .dwattr $C$DW$401, DW_AT_name("PERI_RXCSR_INDX")
    4124                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    4125                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    4126                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$402       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4129                      .dwattr $C$DW$402, DW_AT_name("RSVD26")
    4130                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_RSVD26")
    4131                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    4132                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$403       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$22)
    4135                      .dwattr $C$DW$403, DW_AT_name("COUNT0_INDX")
    4136                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_COUNT0_INDX")
    4137                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    4138                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$404       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$38)
    4141                      .dwattr $C$DW$404, DW_AT_name("RSVD27")
    4142                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_RSVD27")
    4143                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    4144                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$405       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$22)
    4147                      .dwattr $C$DW$405, DW_AT_name("CONFIGDATA_INDX")
    4148                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    4149                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    4150                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4151              $C$DW$406       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    4153                      .dwattr $C$DW$406, DW_AT_name("RSVD28")
    4154                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD28")
    4155                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    4156                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$407       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$22)
    4159                      .dwattr $C$DW$407, DW_AT_name("FIFO0R1")
    4160                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_FIFO0R1")
    4161                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    4162                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   95

    4163              $C$DW$408       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$22)
    4165                      .dwattr $C$DW$408, DW_AT_name("FIFO0R2")
    4166                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_FIFO0R2")
    4167                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    4168                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$409       .dwtag  DW_TAG_member
    4170                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    4171                      .dwattr $C$DW$409, DW_AT_name("RSVD29")
    4172                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD29")
    4173                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    4174                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$410       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$22)
    4177                      .dwattr $C$DW$410, DW_AT_name("FIFO1R1")
    4178                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_FIFO1R1")
    4179                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    4180                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4181              $C$DW$411       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
    4183                      .dwattr $C$DW$411, DW_AT_name("FIFO1R2")
    4184                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_FIFO1R2")
    4185                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    4186                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4187              $C$DW$412       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    4189                      .dwattr $C$DW$412, DW_AT_name("RSVD30")
    4190                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RSVD30")
    4191                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    4192                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4193              $C$DW$413       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
    4195                      .dwattr $C$DW$413, DW_AT_name("FIFO2R1")
    4196                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_FIFO2R1")
    4197                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    4198                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$414       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$22)
    4201                      .dwattr $C$DW$414, DW_AT_name("FIFO2R2")
    4202                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_FIFO2R2")
    4203                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    4204                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$415       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
    4207                      .dwattr $C$DW$415, DW_AT_name("RSVD31")
    4208                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RSVD31")
    4209                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    4210                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4211              $C$DW$416       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$22)
    4213                      .dwattr $C$DW$416, DW_AT_name("FIFO3R1")
    4214                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_FIFO3R1")
    4215                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    4216                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4217              $C$DW$417       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   96

    4218                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$22)
    4219                      .dwattr $C$DW$417, DW_AT_name("FIFO3R2")
    4220                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_FIFO3R2")
    4221                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    4222                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$418       .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
    4225                      .dwattr $C$DW$418, DW_AT_name("RSVD32")
    4226                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD32")
    4227                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    4228                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$419       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$22)
    4231                      .dwattr $C$DW$419, DW_AT_name("FIFO4R1")
    4232                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_FIFO4R1")
    4233                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    4234                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$420       .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$22)
    4237                      .dwattr $C$DW$420, DW_AT_name("FIFO4R2")
    4238                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_FIFO4R2")
    4239                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    4240                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$421       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$39)
    4243                      .dwattr $C$DW$421, DW_AT_name("RSVD33")
    4244                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_RSVD33")
    4245                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    4246                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$422       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$22)
    4249                      .dwattr $C$DW$422, DW_AT_name("DEVCTL")
    4250                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_DEVCTL")
    4251                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    4252                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$423       .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$22)
    4255                      .dwattr $C$DW$423, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    4256                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    4257                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    4258                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$424       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
    4261                      .dwattr $C$DW$424, DW_AT_name("RSVD34")
    4262                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_RSVD34")
    4263                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    4264                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4265              $C$DW$425       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$22)
    4267                      .dwattr $C$DW$425, DW_AT_name("TXFIFOADDR")
    4268                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_TXFIFOADDR")
    4269                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    4270                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$426       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   97

    4273                      .dwattr $C$DW$426, DW_AT_name("RXFIFOADDR")
    4274                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_RXFIFOADDR")
    4275                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    4276                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4277              $C$DW$427       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$27)
    4279                      .dwattr $C$DW$427, DW_AT_name("RSVD35")
    4280                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD35")
    4281                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    4282                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4283              $C$DW$428       .dwtag  DW_TAG_member
    4284                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$22)
    4285                      .dwattr $C$DW$428, DW_AT_name("HWVERS")
    4286                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_HWVERS")
    4287                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    4288                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4289              $C$DW$429       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$40)
    4291                      .dwattr $C$DW$429, DW_AT_name("RSVD37")
    4292                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_RSVD37")
    4293                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    4294                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4295              $C$DW$430       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$42)
    4297                      .dwattr $C$DW$430, DW_AT_name("EPTRG")
    4298                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_EPTRG")
    4299                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    4300                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4301              $C$DW$431       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$43)
    4303                      .dwattr $C$DW$431, DW_AT_name("RSVD38")
    4304                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RSVD38")
    4305                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    4306                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4307              $C$DW$432       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$22)
    4309                      .dwattr $C$DW$432, DW_AT_name("PERI_CSR0")
    4310                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_PERI_CSR0")
    4311                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    4312                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4313              $C$DW$433       .dwtag  DW_TAG_member
    4314                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$27)
    4315                      .dwattr $C$DW$433, DW_AT_name("RSVD39")
    4316                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD39")
    4317                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    4318                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4319              $C$DW$434       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$22)
    4321                      .dwattr $C$DW$434, DW_AT_name("COUNT0")
    4322                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_COUNT0")
    4323                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    4324                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4325              $C$DW$435       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$38)
    4327                      .dwattr $C$DW$435, DW_AT_name("RSVD40")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   98

    4328                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_RSVD40")
    4329                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    4330                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4331              $C$DW$436       .dwtag  DW_TAG_member
    4332                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
    4333                      .dwattr $C$DW$436, DW_AT_name("CONFIGDATA")
    4334                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_CONFIGDATA")
    4335                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    4336                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4337              $C$DW$437       .dwtag  DW_TAG_member
    4338                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    4339                      .dwattr $C$DW$437, DW_AT_name("RSVD42")
    4340                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD42")
    4341                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    4342                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4343              $C$DW$438       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$45)
    4345                      .dwattr $C$DW$438, DW_AT_name("EPCSR")
    4346                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_EPCSR")
    4347                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    4348                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4349              $C$DW$439       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$46)
    4351                      .dwattr $C$DW$439, DW_AT_name("RSVD43")
    4352                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_RSVD43")
    4353                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    4354                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4355              $C$DW$440       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    4357                      .dwattr $C$DW$440, DW_AT_name("DMAREVID1")
    4358                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMAREVID1")
    4359                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    4360                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4361              $C$DW$441       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    4363                      .dwattr $C$DW$441, DW_AT_name("DMAREVID2")
    4364                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMAREVID2")
    4365                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    4366                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4367              $C$DW$442       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$23)
    4369                      .dwattr $C$DW$442, DW_AT_name("RSVD44")
    4370                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_RSVD44")
    4371                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    4372                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4373              $C$DW$443       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    4375                      .dwattr $C$DW$443, DW_AT_name("TDFDQ")
    4376                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_TDFDQ")
    4377                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    4378                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4379              $C$DW$444       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$35)
    4381                      .dwattr $C$DW$444, DW_AT_name("RSVD45")
    4382                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD45")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:32:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_cdc.asm                                                          PAGE   99

    4383                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    4384                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4385              $C$DW$445       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    4387                      .dwattr $C$DW$445, DW_AT_name("DMAEMU")
    4388                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_DMAEMU")
    4389                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    4390                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4391              $C$DW$446       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$47)
    4393                      .dwattr $C$DW$446, DW_AT_name("RSVD47")
    4394                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD47")
    4395                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    4396                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4397              $C$DW$447       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$49)
    4399                      .dwattr $C$DW$447, DW_AT_name("CHANNEL")
    4400                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_CHANNEL")
    4401                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    4402                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
