TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE    1

    6060              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:20 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4381              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
    4382              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
    4383              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    4384                      .dwendtag $C$DW$T$42
    4385              
    4386              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    4387                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4388                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4389              
    4390              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    4391                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4392              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    4393              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    4394              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
    4395              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    4396              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    4397                      .dwendtag $C$DW$T$44
    4398              
    4399              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    4400                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4401                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4402              
    4403              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
    4404                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  101

    4405              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    4406              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    4407              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
    4408                      .dwendtag $C$DW$T$46
    4409              
    4410              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    4411                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4412                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4413              
    4414              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    4415                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    4416              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    4417              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    4418              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    4419                      .dwendtag $C$DW$T$48
    4420              
    4421              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    4422                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4423                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4424              
    4425              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    4426                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    4427              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    4428              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    4429              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    4430              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    4431                      .dwendtag $C$DW$T$50
    4432              
    4433              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    4434                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4435                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4436              
    4437              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    4438                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4439              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    4440              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    4441              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    4442              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    4443                      .dwendtag $C$DW$T$52
    4444              
    4445              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    4446                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4447                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4448              
    4449              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4450                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    4451              $C$DW$263       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    4453                      .dwattr $C$DW$263, DW_AT_name("REV")
    4454                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_REV")
    4455                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4456                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$264       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    4459                      .dwattr $C$DW$264, DW_AT_name("STATUS")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  102

    4460                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_STATUS")
    4461                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4462                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4463              $C$DW$265       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    4465                      .dwattr $C$DW$265, DW_AT_name("RSVD0")
    4466                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_RSVD0")
    4467                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4468                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4469              $C$DW$266       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    4471                      .dwattr $C$DW$266, DW_AT_name("AWCCR1")
    4472                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_AWCCR1")
    4473                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4474                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4475              $C$DW$267       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    4477                      .dwattr $C$DW$267, DW_AT_name("AWCCR2")
    4478                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_AWCCR2")
    4479                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4480                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4481              $C$DW$268       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    4483                      .dwattr $C$DW$268, DW_AT_name("RSVD1")
    4484                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_RSVD1")
    4485                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4486                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4487              $C$DW$269       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    4489                      .dwattr $C$DW$269, DW_AT_name("SDCR1")
    4490                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SDCR1")
    4491                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4492                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4493              $C$DW$270       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    4495                      .dwattr $C$DW$270, DW_AT_name("SDCR2")
    4496                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_SDCR2")
    4497                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4498                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4499              $C$DW$271       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    4501                      .dwattr $C$DW$271, DW_AT_name("RSVD2")
    4502                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_RSVD2")
    4503                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4504                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4505              $C$DW$272       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    4507                      .dwattr $C$DW$272, DW_AT_name("SDRCR")
    4508                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_SDRCR")
    4509                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4510                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$273       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$22)
    4513                      .dwattr $C$DW$273, DW_AT_name("RSVD3")
    4514                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_RSVD3")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  103

    4515                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4516                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4517              $C$DW$274       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    4519                      .dwattr $C$DW$274, DW_AT_name("ACS2CR1")
    4520                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_ACS2CR1")
    4521                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4522                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$275       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    4525                      .dwattr $C$DW$275, DW_AT_name("ACS2CR2")
    4526                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_ACS2CR2")
    4527                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4528                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4529              $C$DW$276       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    4531                      .dwattr $C$DW$276, DW_AT_name("RSVD4")
    4532                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_RSVD4")
    4533                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4534                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4535              $C$DW$277       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    4537                      .dwattr $C$DW$277, DW_AT_name("ACS3CR1")
    4538                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_ACS3CR1")
    4539                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4540                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4541              $C$DW$278       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    4543                      .dwattr $C$DW$278, DW_AT_name("ACS3CR2")
    4544                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_ACS3CR2")
    4545                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4546                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4547              $C$DW$279       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    4549                      .dwattr $C$DW$279, DW_AT_name("RSVD5")
    4550                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD5")
    4551                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4552                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$280       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    4555                      .dwattr $C$DW$280, DW_AT_name("ACS4CR1")
    4556                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ACS4CR1")
    4557                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4558                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$281       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    4561                      .dwattr $C$DW$281, DW_AT_name("ACS4CR2")
    4562                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_ACS4CR2")
    4563                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4564                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$282       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    4567                      .dwattr $C$DW$282, DW_AT_name("RSVD6")
    4568                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_RSVD6")
    4569                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  104

    4570                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$283       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    4573                      .dwattr $C$DW$283, DW_AT_name("ACS5CR1")
    4574                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_ACS5CR1")
    4575                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4576                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$284       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    4579                      .dwattr $C$DW$284, DW_AT_name("ACS5CR2")
    4580                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_ACS5CR2")
    4581                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4582                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$285       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    4585                      .dwattr $C$DW$285, DW_AT_name("RSVD7")
    4586                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RSVD7")
    4587                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4588                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$286       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    4591                      .dwattr $C$DW$286, DW_AT_name("SDTIMR1")
    4592                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_SDTIMR1")
    4593                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4594                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$287       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    4597                      .dwattr $C$DW$287, DW_AT_name("RSVD8")
    4598                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD8")
    4599                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4600                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$288       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    4603                      .dwattr $C$DW$288, DW_AT_name("SDSRETR")
    4604                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_SDSRETR")
    4605                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4606                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$289       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$22)
    4609                      .dwattr $C$DW$289, DW_AT_name("RSVD9")
    4610                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_RSVD9")
    4611                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    4612                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$290       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    4615                      .dwattr $C$DW$290, DW_AT_name("EIRR")
    4616                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_EIRR")
    4617                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4618                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$291       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    4621                      .dwattr $C$DW$291, DW_AT_name("RSVD10")
    4622                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD10")
    4623                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4624                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  105

    4625              $C$DW$292       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    4627                      .dwattr $C$DW$292, DW_AT_name("EIMR")
    4628                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_EIMR")
    4629                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4630                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4631              $C$DW$293       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$22)
    4633                      .dwattr $C$DW$293, DW_AT_name("RSVD11")
    4634                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD11")
    4635                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4636                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4637              $C$DW$294       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    4639                      .dwattr $C$DW$294, DW_AT_name("EIMSR")
    4640                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_EIMSR")
    4641                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4642                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4643              $C$DW$295       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$22)
    4645                      .dwattr $C$DW$295, DW_AT_name("RSVD12")
    4646                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD12")
    4647                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    4648                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$296       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    4651                      .dwattr $C$DW$296, DW_AT_name("EIMCR")
    4652                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_EIMCR")
    4653                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4654                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$297       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$24)
    4657                      .dwattr $C$DW$297, DW_AT_name("RSVD13")
    4658                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD13")
    4659                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    4660                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4661              $C$DW$298       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    4663                      .dwattr $C$DW$298, DW_AT_name("NANDFCR")
    4664                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_NANDFCR")
    4665                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4666                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4667              $C$DW$299       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    4669                      .dwattr $C$DW$299, DW_AT_name("RSVD14")
    4670                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD14")
    4671                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4672                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4673              $C$DW$300       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    4675                      .dwattr $C$DW$300, DW_AT_name("NANDFSR1")
    4676                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_NANDFSR1")
    4677                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4678                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4679              $C$DW$301       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  106

    4680                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    4681                      .dwattr $C$DW$301, DW_AT_name("NANDFSR2")
    4682                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_NANDFSR2")
    4683                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4684                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4685              $C$DW$302       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    4687                      .dwattr $C$DW$302, DW_AT_name("RSVD15")
    4688                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_RSVD15")
    4689                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    4690                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4691              $C$DW$303       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    4693                      .dwattr $C$DW$303, DW_AT_name("PAGEMODCTRL1")
    4694                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    4695                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4696                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4697              $C$DW$304       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    4699                      .dwattr $C$DW$304, DW_AT_name("PAGEMODCTRL2")
    4700                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    4701                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    4702                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4703              $C$DW$305       .dwtag  DW_TAG_member
    4704                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
    4705                      .dwattr $C$DW$305, DW_AT_name("RSVD16")
    4706                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD16")
    4707                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    4708                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4709              $C$DW$306       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4711                      .dwattr $C$DW$306, DW_AT_name("NCS2ECC1")
    4712                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_NCS2ECC1")
    4713                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4714                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4715              $C$DW$307       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    4717                      .dwattr $C$DW$307, DW_AT_name("NCS2ECC2")
    4718                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_NCS2ECC2")
    4719                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    4720                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4721              $C$DW$308       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    4723                      .dwattr $C$DW$308, DW_AT_name("RSVD17")
    4724                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_RSVD17")
    4725                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    4726                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4727              $C$DW$309       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    4729                      .dwattr $C$DW$309, DW_AT_name("NCS3ECC1")
    4730                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_NCS3ECC1")
    4731                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4732                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$310       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  107

    4735                      .dwattr $C$DW$310, DW_AT_name("NCS3ECC2")
    4736                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_NCS3ECC2")
    4737                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
    4738                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$311       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    4741                      .dwattr $C$DW$311, DW_AT_name("RSVD18")
    4742                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD18")
    4743                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    4744                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4745              $C$DW$312       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    4747                      .dwattr $C$DW$312, DW_AT_name("NCS4ECC1")
    4748                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_NCS4ECC1")
    4749                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4750                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$313       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    4753                      .dwattr $C$DW$313, DW_AT_name("NCS4ECC2")
    4754                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_NCS4ECC2")
    4755                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    4756                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4757              $C$DW$314       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    4759                      .dwattr $C$DW$314, DW_AT_name("RSVD19")
    4760                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD19")
    4761                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4762                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$315       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    4765                      .dwattr $C$DW$315, DW_AT_name("NCS5ECC1")
    4766                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_NCS5ECC1")
    4767                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4768                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$316       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    4771                      .dwattr $C$DW$316, DW_AT_name("NCS5ECC2")
    4772                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_NCS5ECC2")
    4773                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    4774                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$317       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$26)
    4777                      .dwattr $C$DW$317, DW_AT_name("RSVD20")
    4778                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD20")
    4779                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    4780                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$318       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    4783                      .dwattr $C$DW$318, DW_AT_name("NAND4BITECCLOAD")
    4784                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    4785                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4786                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4787              $C$DW$319       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    4789                      .dwattr $C$DW$319, DW_AT_name("RSVD21")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  108

    4790                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_RSVD21")
    4791                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    4792                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4793              $C$DW$320       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    4795                      .dwattr $C$DW$320, DW_AT_name("NAND4BITECC1")
    4796                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_NAND4BITECC1")
    4797                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4798                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4799              $C$DW$321       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    4801                      .dwattr $C$DW$321, DW_AT_name("NAND4BITECC2")
    4802                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_NAND4BITECC2")
    4803                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    4804                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4805              $C$DW$322       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    4807                      .dwattr $C$DW$322, DW_AT_name("RSVD22")
    4808                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_RSVD22")
    4809                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    4810                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4811              $C$DW$323       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    4813                      .dwattr $C$DW$323, DW_AT_name("NAND4BITECC3")
    4814                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_NAND4BITECC3")
    4815                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4816                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$324       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    4819                      .dwattr $C$DW$324, DW_AT_name("NAND4BITECC4")
    4820                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_NAND4BITECC4")
    4821                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4822                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4823              $C$DW$325       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    4825                      .dwattr $C$DW$325, DW_AT_name("RSVD23")
    4826                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_RSVD23")
    4827                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4828                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4829              $C$DW$326       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    4831                      .dwattr $C$DW$326, DW_AT_name("NAND4BITECC5")
    4832                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_NAND4BITECC5")
    4833                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4834                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4835              $C$DW$327       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    4837                      .dwattr $C$DW$327, DW_AT_name("NAND4BITECC6")
    4838                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_NAND4BITECC6")
    4839                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    4840                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$328       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    4843                      .dwattr $C$DW$328, DW_AT_name("RSVD24")
    4844                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD24")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  109

    4845                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4846                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$329       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    4849                      .dwattr $C$DW$329, DW_AT_name("NAND4BITECC7")
    4850                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_NAND4BITECC7")
    4851                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4852                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$330       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    4855                      .dwattr $C$DW$330, DW_AT_name("NAND4BITECC8")
    4856                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_NAND4BITECC8")
    4857                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    4858                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$331       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    4861                      .dwattr $C$DW$331, DW_AT_name("RSVD25")
    4862                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD25")
    4863                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4864                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4865              $C$DW$332       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    4867                      .dwattr $C$DW$332, DW_AT_name("NANDERRADD1")
    4868                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_NANDERRADD1")
    4869                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4870                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4871              $C$DW$333       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    4873                      .dwattr $C$DW$333, DW_AT_name("NANDERRADD2")
    4874                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_NANDERRADD2")
    4875                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    4876                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4877              $C$DW$334       .dwtag  DW_TAG_member
    4878                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    4879                      .dwattr $C$DW$334, DW_AT_name("RSVD26")
    4880                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_RSVD26")
    4881                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4882                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4883              $C$DW$335       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    4885                      .dwattr $C$DW$335, DW_AT_name("NANDERRADD3")
    4886                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_NANDERRADD3")
    4887                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4888                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4889              $C$DW$336       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    4891                      .dwattr $C$DW$336, DW_AT_name("NANDERRADD4")
    4892                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_NANDERRADD4")
    4893                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    4894                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4895              $C$DW$337       .dwtag  DW_TAG_member
    4896                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    4897                      .dwattr $C$DW$337, DW_AT_name("RSVD27")
    4898                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD27")
    4899                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  110

    4900                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4901              $C$DW$338       .dwtag  DW_TAG_member
    4902                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    4903                      .dwattr $C$DW$338, DW_AT_name("NANDERRVAL1")
    4904                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_NANDERRVAL1")
    4905                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4906                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4907              $C$DW$339       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    4909                      .dwattr $C$DW$339, DW_AT_name("NANDERRVAL2")
    4910                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_NANDERRVAL2")
    4911                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    4912                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$340       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$21)
    4915                      .dwattr $C$DW$340, DW_AT_name("RSVD28")
    4916                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD28")
    4917                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4918                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4919              $C$DW$341       .dwtag  DW_TAG_member
    4920                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    4921                      .dwattr $C$DW$341, DW_AT_name("NANDERRVAL3")
    4922                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_NANDERRVAL3")
    4923                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4924                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4925              $C$DW$342       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    4927                      .dwattr $C$DW$342, DW_AT_name("NANDERRVAL4")
    4928                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_NANDERRVAL4")
    4929                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    4930                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4931                      .dwendtag $C$DW$T$27
    4932              
    4933              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    4934                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$27)
    4935                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4936              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    4937                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$59)
    4938              $C$DW$344       .dwtag  DW_TAG_TI_ioport_type
    4939                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$343)
    4940              $C$DW$T$60      .dwtag  DW_TAG_volatile_type
    4941                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$344)
    4942              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    4943                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4944                      .dwattr $C$DW$T$61, DW_AT_address_class(0x10)
    4945              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    4946                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    4947                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4948              
    4949              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4950                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    4951              $C$DW$345       .dwtag  DW_TAG_member
    4952                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    4953                      .dwattr $C$DW$345, DW_AT_name("EBSR")
    4954                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_EBSR")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  111

    4955                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4956                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4957              $C$DW$346       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    4959                      .dwattr $C$DW$346, DW_AT_name("RSVD0")
    4960                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD0")
    4961                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4962                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4963              $C$DW$347       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    4965                      .dwattr $C$DW$347, DW_AT_name("PCGCR1")
    4966                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_PCGCR1")
    4967                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4968                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4969              $C$DW$348       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    4971                      .dwattr $C$DW$348, DW_AT_name("PCGCR2")
    4972                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_PCGCR2")
    4973                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4974                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4975              $C$DW$349       .dwtag  DW_TAG_member
    4976                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    4977                      .dwattr $C$DW$349, DW_AT_name("PSRCR")
    4978                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_PSRCR")
    4979                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4980                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4981              $C$DW$350       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    4983                      .dwattr $C$DW$350, DW_AT_name("PRCR")
    4984                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_PRCR")
    4985                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4986                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4987              $C$DW$351       .dwtag  DW_TAG_member
    4988                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$28)
    4989                      .dwattr $C$DW$351, DW_AT_name("RSVD1")
    4990                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RSVD1")
    4991                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4992                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4993              $C$DW$352       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    4995                      .dwattr $C$DW$352, DW_AT_name("TIAFR")
    4996                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_TIAFR")
    4997                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4998                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4999              $C$DW$353       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    5001                      .dwattr $C$DW$353, DW_AT_name("RSVD2")
    5002                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RSVD2")
    5003                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5004                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$354       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    5007                      .dwattr $C$DW$354, DW_AT_name("ODSCR")
    5008                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_ODSCR")
    5009                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  112

    5010                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$355       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    5013                      .dwattr $C$DW$355, DW_AT_name("PDINHIBR1")
    5014                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_PDINHIBR1")
    5015                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5016                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5017              $C$DW$356       .dwtag  DW_TAG_member
    5018                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    5019                      .dwattr $C$DW$356, DW_AT_name("PDINHIBR2")
    5020                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_PDINHIBR2")
    5021                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5022                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5023              $C$DW$357       .dwtag  DW_TAG_member
    5024                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    5025                      .dwattr $C$DW$357, DW_AT_name("PDINHIBR3")
    5026                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_PDINHIBR3")
    5027                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5028                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5029              $C$DW$358       .dwtag  DW_TAG_member
    5030                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    5031                      .dwattr $C$DW$358, DW_AT_name("DMA0CESR1")
    5032                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_DMA0CESR1")
    5033                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5034                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5035              $C$DW$359       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    5037                      .dwattr $C$DW$359, DW_AT_name("DMA0CESR2")
    5038                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_DMA0CESR2")
    5039                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5040                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5041              $C$DW$360       .dwtag  DW_TAG_member
    5042                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    5043                      .dwattr $C$DW$360, DW_AT_name("DMA1CESR1")
    5044                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_DMA1CESR1")
    5045                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5046                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5047              $C$DW$361       .dwtag  DW_TAG_member
    5048                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    5049                      .dwattr $C$DW$361, DW_AT_name("DMA1CESR2")
    5050                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DMA1CESR2")
    5051                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5052                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5053              $C$DW$362       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    5055                      .dwattr $C$DW$362, DW_AT_name("SDRAMCCR")
    5056                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_SDRAMCCR")
    5057                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5058                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5059              $C$DW$363       .dwtag  DW_TAG_member
    5060                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    5061                      .dwattr $C$DW$363, DW_AT_name("CCR2")
    5062                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_CCR2")
    5063                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5064                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  113

    5065              $C$DW$364       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    5067                      .dwattr $C$DW$364, DW_AT_name("CGCR1")
    5068                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_CGCR1")
    5069                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5070                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5071              $C$DW$365       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    5073                      .dwattr $C$DW$365, DW_AT_name("CGICR")
    5074                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_CGICR")
    5075                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5076                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5077              $C$DW$366       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    5079                      .dwattr $C$DW$366, DW_AT_name("CGCR2")
    5080                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_CGCR2")
    5081                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5082                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5083              $C$DW$367       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    5085                      .dwattr $C$DW$367, DW_AT_name("CGOCR")
    5086                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_CGOCR")
    5087                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5088                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$368       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    5091                      .dwattr $C$DW$368, DW_AT_name("CCSSR")
    5092                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_CCSSR")
    5093                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5094                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$369       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    5097                      .dwattr $C$DW$369, DW_AT_name("RSVD3")
    5098                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD3")
    5099                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5100                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$370       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    5103                      .dwattr $C$DW$370, DW_AT_name("ECDR")
    5104                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ECDR")
    5105                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5106                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5107              $C$DW$371       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    5109                      .dwattr $C$DW$371, DW_AT_name("RSVD4")
    5110                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_RSVD4")
    5111                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5112                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5113              $C$DW$372       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    5115                      .dwattr $C$DW$372, DW_AT_name("RAMSLPMDCNTLR1")
    5116                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    5117                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5118                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5119              $C$DW$373       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  114

    5120                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    5121                      .dwattr $C$DW$373, DW_AT_name("RSVD5")
    5122                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RSVD5")
    5123                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5124                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$374       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    5127                      .dwattr $C$DW$374, DW_AT_name("RAMSLPMDCNTLR2")
    5128                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    5129                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5130                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5131              $C$DW$375       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    5133                      .dwattr $C$DW$375, DW_AT_name("RAMSLPMDCNTLR3")
    5134                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    5135                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5136                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5137              $C$DW$376       .dwtag  DW_TAG_member
    5138                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    5139                      .dwattr $C$DW$376, DW_AT_name("RAMSLPMDCNTLR4")
    5140                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    5141                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5142                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5143              $C$DW$377       .dwtag  DW_TAG_member
    5144                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    5145                      .dwattr $C$DW$377, DW_AT_name("RAMSLPMDCNTLR5")
    5146                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    5147                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5148                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5149              $C$DW$378       .dwtag  DW_TAG_member
    5150                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    5151                      .dwattr $C$DW$378, DW_AT_name("RSVD6")
    5152                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD6")
    5153                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5154                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5155              $C$DW$379       .dwtag  DW_TAG_member
    5156                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    5157                      .dwattr $C$DW$379, DW_AT_name("DMAIFR")
    5158                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_DMAIFR")
    5159                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5160                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5161              $C$DW$380       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    5163                      .dwattr $C$DW$380, DW_AT_name("DMAIER")
    5164                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_DMAIER")
    5165                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    5166                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5167              $C$DW$381       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    5169                      .dwattr $C$DW$381, DW_AT_name("USBSCR")
    5170                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_USBSCR")
    5171                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5172                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5173              $C$DW$382       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  115

    5175                      .dwattr $C$DW$382, DW_AT_name("ESCR")
    5176                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ESCR")
    5177                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    5178                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5179              $C$DW$383       .dwtag  DW_TAG_member
    5180                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    5181                      .dwattr $C$DW$383, DW_AT_name("RSVD7")
    5182                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD7")
    5183                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5184                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5185              $C$DW$384       .dwtag  DW_TAG_member
    5186                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    5187                      .dwattr $C$DW$384, DW_AT_name("DMA2CESR1")
    5188                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DMA2CESR1")
    5189                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5190                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5191              $C$DW$385       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    5193                      .dwattr $C$DW$385, DW_AT_name("DMA2CESR2")
    5194                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DMA2CESR2")
    5195                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    5196                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5197              $C$DW$386       .dwtag  DW_TAG_member
    5198                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    5199                      .dwattr $C$DW$386, DW_AT_name("DMA3CESR1")
    5200                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DMA3CESR1")
    5201                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5202                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5203              $C$DW$387       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    5205                      .dwattr $C$DW$387, DW_AT_name("DMA3CESR2")
    5206                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DMA3CESR2")
    5207                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5208                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5209              $C$DW$388       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    5211                      .dwattr $C$DW$388, DW_AT_name("CLKSTOP")
    5212                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_CLKSTOP")
    5213                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5214                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5215              $C$DW$389       .dwtag  DW_TAG_member
    5216                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    5217                      .dwattr $C$DW$389, DW_AT_name("RSVD8")
    5218                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RSVD8")
    5219                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    5220                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5221              $C$DW$390       .dwtag  DW_TAG_member
    5222                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    5223                      .dwattr $C$DW$390, DW_AT_name("DIEIDR0")
    5224                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DIEIDR0")
    5225                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5226                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5227              $C$DW$391       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    5229                      .dwattr $C$DW$391, DW_AT_name("DIEIDR1")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  116

    5230                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DIEIDR1")
    5231                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5232                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5233              $C$DW$392       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    5235                      .dwattr $C$DW$392, DW_AT_name("DIEIDR2")
    5236                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DIEIDR2")
    5237                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5238                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5239              $C$DW$393       .dwtag  DW_TAG_member
    5240                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    5241                      .dwattr $C$DW$393, DW_AT_name("DIEIDR3")
    5242                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DIEIDR3")
    5243                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    5244                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5245              $C$DW$394       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    5247                      .dwattr $C$DW$394, DW_AT_name("DIEIDR4")
    5248                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DIEIDR4")
    5249                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5250                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5251              $C$DW$395       .dwtag  DW_TAG_member
    5252                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    5253                      .dwattr $C$DW$395, DW_AT_name("DIEIDR5")
    5254                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DIEIDR5")
    5255                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    5256                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5257              $C$DW$396       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    5259                      .dwattr $C$DW$396, DW_AT_name("DIEIDR6")
    5260                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DIEIDR6")
    5261                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5262                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5263              $C$DW$397       .dwtag  DW_TAG_member
    5264                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    5265                      .dwattr $C$DW$397, DW_AT_name("DIEIDR7")
    5266                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DIEIDR7")
    5267                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    5268                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5269                      .dwendtag $C$DW$T$30
    5270              
    5271              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    5272                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$30)
    5273                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5274              $C$DW$398       .dwtag  DW_TAG_TI_far_type
    5275                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$63)
    5276              $C$DW$399       .dwtag  DW_TAG_TI_ioport_type
    5277                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$398)
    5278              $C$DW$T$64      .dwtag  DW_TAG_volatile_type
    5279                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$399)
    5280              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    5281                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    5282                      .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    5283              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    5284                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  117

    5285                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    5286              
    5287              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5288                      .dwattr $C$DW$T$33, DW_AT_name("CSL_NandAsyncBank")
    5289                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    5290              $C$DW$400       .dwtag  DW_TAG_member
    5291                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$32)
    5292                      .dwattr $C$DW$400, DW_AT_name("CExDATA")
    5293                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CExDATA")
    5294                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5295                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5296              $C$DW$401       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$32)
    5298                      .dwattr $C$DW$401, DW_AT_name("CExALE")
    5299                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_CExALE")
    5300                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5301                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5302              $C$DW$402       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$32)
    5304                      .dwattr $C$DW$402, DW_AT_name("CExCLE")
    5305                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_CExCLE")
    5306                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5307                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5308              $C$DW$403       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$32)
    5310                      .dwattr $C$DW$403, DW_AT_name("CExNUM")
    5311                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_CExNUM")
    5312                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5313                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5314                      .dwendtag $C$DW$T$33
    5315              
    5316              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncBank")
    5317                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$33)
    5318                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5319              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    5320                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$68)
    5321                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    5322              
    5323              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5324                      .dwattr $C$DW$T$34, DW_AT_name("CSL_NandAsyncCfg")
    5325                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    5326              $C$DW$404       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    5328                      .dwattr $C$DW$404, DW_AT_name("selectStrobe")
    5329                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_selectStrobe")
    5330                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5331                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5332              $C$DW$405       .dwtag  DW_TAG_member
    5333                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    5334                      .dwattr $C$DW$405, DW_AT_name("ewMode")
    5335                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ewMode")
    5336                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5337                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5338              $C$DW$406       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  118

    5340                      .dwattr $C$DW$406, DW_AT_name("w_setup")
    5341                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_w_setup")
    5342                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5343                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5344              $C$DW$407       .dwtag  DW_TAG_member
    5345                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    5346                      .dwattr $C$DW$407, DW_AT_name("w_strobe")
    5347                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_w_strobe")
    5348                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5349                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5350              $C$DW$408       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    5352                      .dwattr $C$DW$408, DW_AT_name("w_hold")
    5353                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_w_hold")
    5354                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5355                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5356              $C$DW$409       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    5358                      .dwattr $C$DW$409, DW_AT_name("r_setup")
    5359                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_r_setup")
    5360                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5361                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5362              $C$DW$410       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    5364                      .dwattr $C$DW$410, DW_AT_name("r_strobe")
    5365                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_r_strobe")
    5366                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5367                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5368              $C$DW$411       .dwtag  DW_TAG_member
    5369                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    5370                      .dwattr $C$DW$411, DW_AT_name("r_hold")
    5371                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_r_hold")
    5372                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5373                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5374              $C$DW$412       .dwtag  DW_TAG_member
    5375                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    5376                      .dwattr $C$DW$412, DW_AT_name("turnAround")
    5377                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_turnAround")
    5378                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5379                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5380              $C$DW$413       .dwtag  DW_TAG_member
    5381                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    5382                      .dwattr $C$DW$413, DW_AT_name("aSize")
    5383                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_aSize")
    5384                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5385                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5386                      .dwendtag $C$DW$T$34
    5387              
    5388              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncCfg")
    5389                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$34)
    5390                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5391              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    5392                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5393                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    5394              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  119

    5395              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5396                      .dwattr $C$DW$T$39, DW_AT_name("CSL_NandAsyncWaitCfg")
    5397                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x03)
    5398              $C$DW$414       .dwtag  DW_TAG_member
    5399                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$36)
    5400                      .dwattr $C$DW$414, DW_AT_name("waitPol")
    5401                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_waitPol")
    5402                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5403                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5404              $C$DW$415       .dwtag  DW_TAG_member
    5405                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$38)
    5406                      .dwattr $C$DW$415, DW_AT_name("nandPort")
    5407                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_nandPort")
    5408                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5409                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5410              $C$DW$416       .dwtag  DW_TAG_member
    5411                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    5412                      .dwattr $C$DW$416, DW_AT_name("waitCycles")
    5413                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_waitCycles")
    5414                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5415                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5416                      .dwendtag $C$DW$T$39
    5417              
    5418              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncWaitCfg")
    5419                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$39)
    5420                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5421              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    5422                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    5423                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    5424              
    5425              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5426                      .dwattr $C$DW$T$58, DW_AT_name("CSL_NandConfig")
    5427                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x0c)
    5428              $C$DW$417       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$41)
    5430                      .dwattr $C$DW$417, DW_AT_name("nandWidth")
    5431                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_nandWidth")
    5432                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5433                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$418       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$43)
    5436                      .dwattr $C$DW$418, DW_AT_name("nandPageSize")
    5437                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_nandPageSize")
    5438                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5439                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$419       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$45)
    5442                      .dwattr $C$DW$419, DW_AT_name("nandBankNo")
    5443                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_nandBankNo")
    5444                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5445                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5446              $C$DW$420       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$47)
    5448                      .dwattr $C$DW$420, DW_AT_name("emifAccess")
    5449                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_emifAccess")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  120

    5450                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5451                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5452              $C$DW$421       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$49)
    5454                      .dwattr $C$DW$421, DW_AT_name("nandOpMode")
    5455                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_nandOpMode")
    5456                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5457                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5458              $C$DW$422       .dwtag  DW_TAG_member
    5459                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$51)
    5460                      .dwattr $C$DW$422, DW_AT_name("nandType")
    5461                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_nandType")
    5462                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5463                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5464              $C$DW$423       .dwtag  DW_TAG_member
    5465                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$53)
    5466                      .dwattr $C$DW$423, DW_AT_name("chipSelect")
    5467                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_chipSelect")
    5468                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5469                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5470              $C$DW$424       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
    5472                      .dwattr $C$DW$424, DW_AT_name("asyncWaitCfg")
    5473                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_asyncWaitCfg")
    5474                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5475                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5476              $C$DW$425       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$57)
    5478                      .dwattr $C$DW$425, DW_AT_name("asyncCfg")
    5479                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_asyncCfg")
    5480                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5481                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5482                      .dwendtag $C$DW$T$58
    5483              
    5484              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandConfig")
    5485                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$58)
    5486                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5487              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    5488                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    5489                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    5490              
    5491              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    5492                      .dwattr $C$DW$T$70, DW_AT_name("CSL_NandObj")
    5493                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x14)
    5494              $C$DW$426       .dwtag  DW_TAG_member
    5495                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$62)
    5496                      .dwattr $C$DW$426, DW_AT_name("regs")
    5497                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_regs")
    5498                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5499                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5500              $C$DW$427       .dwtag  DW_TAG_member
    5501                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$66)
    5502                      .dwattr $C$DW$427, DW_AT_name("sysCtrlRegs")
    5503                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_sysCtrlRegs")
    5504                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  121

    5505                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5506              $C$DW$428       .dwtag  DW_TAG_member
    5507                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    5508                      .dwattr $C$DW$428, DW_AT_name("instId")
    5509                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_instId")
    5510                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5511                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5512              $C$DW$429       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$41)
    5514                      .dwattr $C$DW$429, DW_AT_name("nandWidth")
    5515                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_nandWidth")
    5516                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5517                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5518              $C$DW$430       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$67)
    5520                      .dwattr $C$DW$430, DW_AT_name("intrNumNand")
    5521                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_intrNumNand")
    5522                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5523                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5524              $C$DW$431       .dwtag  DW_TAG_member
    5525                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$68)
    5526                      .dwattr $C$DW$431, DW_AT_name("bank")
    5527                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_bank")
    5528                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5529                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5530              $C$DW$432       .dwtag  DW_TAG_member
    5531                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$43)
    5532                      .dwattr $C$DW$432, DW_AT_name("nandPageSize")
    5533                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_nandPageSize")
    5534                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5535                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5536              $C$DW$433       .dwtag  DW_TAG_member
    5537                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    5538                      .dwattr $C$DW$433, DW_AT_name("addrCycles")
    5539                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_addrCycles")
    5540                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5541                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5542              $C$DW$434       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$49)
    5544                      .dwattr $C$DW$434, DW_AT_name("nandOpMode")
    5545                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_nandOpMode")
    5546                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5547                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5548              $C$DW$435       .dwtag  DW_TAG_member
    5549                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$51)
    5550                      .dwattr $C$DW$435, DW_AT_name("nandType")
    5551                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_nandType")
    5552                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5553                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5554              $C$DW$436       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    5556                      .dwattr $C$DW$436, DW_AT_name("chipSelect")
    5557                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_chipSelect")
    5558                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5559                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  122

    5560              $C$DW$437       .dwtag  DW_TAG_member
    5561                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$69)
    5562                      .dwattr $C$DW$437, DW_AT_name("waitPin")
    5563                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_waitPin")
    5564                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5565                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5566                      .dwendtag $C$DW$T$70
    5567              
    5568              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandObj")
    5569                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$70)
    5570                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5571              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    5572                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    5573                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    5574              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandHandle")
    5575                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    5576                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5577              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5578                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5579                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5580                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5581              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5582                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5583                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5584                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5585              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5586                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5587                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5588                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
