TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE    1

    2758              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:32 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1841                      .dwendtag $C$DW$T$50
    1842              
    1843              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataDelay")
    1844                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1845                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1846              
    1847              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    1848                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1849              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
    1850              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
    1851                      .dwendtag $C$DW$T$52
    1852              
    1853              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
    1854                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1855                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1856              
    1857              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    1858                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1859              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
    1860              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
    1861                      .dwendtag $C$DW$T$54
    1862              
    1863              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
    1864                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1865                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1866              
    1867              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   47

    1868                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    1869              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
    1870              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
    1871                      .dwendtag $C$DW$T$56
    1872              
    1873              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
    1874                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1875                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1876              
    1877              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    1878                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    1879              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
    1880              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
    1881              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
    1882              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
    1883              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
    1884              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
    1885              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
    1886              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
    1887                      .dwendtag $C$DW$T$58
    1888              
    1889              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
    1890                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1891                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1892              
    1893              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    1894                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
    1895              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
    1896              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
    1897                      .dwendtag $C$DW$T$60
    1898              
    1899              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
    1900                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1901                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1902              
    1903              $C$DW$T$62      .dwtag  DW_TAG_enumeration_type
    1904                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
    1905              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
    1906              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
    1907                      .dwendtag $C$DW$T$62
    1908              
    1909              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
    1910                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1911                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1912              
    1913              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1914                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x2e)
    1915              $C$DW$172       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$172, DW_AT_name("I2SSCTRL")
    1918                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_I2SSCTRL")
    1919                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$173       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   48

    1923                      .dwattr $C$DW$173, DW_AT_name("RSVD0")
    1924                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD0")
    1925                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1926                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$174       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1929                      .dwattr $C$DW$174, DW_AT_name("I2SSRATE")
    1930                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_I2SSRATE")
    1931                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1932                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$175       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1935                      .dwattr $C$DW$175, DW_AT_name("RSVD1")
    1936                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD1")
    1937                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1938                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$176       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1941                      .dwattr $C$DW$176, DW_AT_name("I2STXLT0")
    1942                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_I2STXLT0")
    1943                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1944                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$177       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1947                      .dwattr $C$DW$177, DW_AT_name("I2STXLT1")
    1948                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_I2STXLT1")
    1949                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1950                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$178       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    1953                      .dwattr $C$DW$178, DW_AT_name("RSVD2")
    1954                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD2")
    1955                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1956                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$179       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1959                      .dwattr $C$DW$179, DW_AT_name("I2STXRT0")
    1960                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_I2STXRT0")
    1961                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1962                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$180       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1965                      .dwattr $C$DW$180, DW_AT_name("I2STXRT1")
    1966                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_I2STXRT1")
    1967                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1968                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$181       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    1971                      .dwattr $C$DW$181, DW_AT_name("RSVD3")
    1972                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RSVD3")
    1973                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1974                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$182       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1977                      .dwattr $C$DW$182, DW_AT_name("I2SINTFL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   49

    1978                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_I2SINTFL")
    1979                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1980                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$183       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1983                      .dwattr $C$DW$183, DW_AT_name("RSVD4")
    1984                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RSVD4")
    1985                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1986                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$184       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1989                      .dwattr $C$DW$184, DW_AT_name("I2SINTMASK")
    1990                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_I2SINTMASK")
    1991                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1992                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$185       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    1995                      .dwattr $C$DW$185, DW_AT_name("RSVD5")
    1996                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_RSVD5")
    1997                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1998                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$186       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    2001                      .dwattr $C$DW$186, DW_AT_name("I2SRXLT0")
    2002                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_I2SRXLT0")
    2003                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2004                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$187       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2007                      .dwattr $C$DW$187, DW_AT_name("I2SRXLT1")
    2008                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_I2SRXLT1")
    2009                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2010                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$188       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2013                      .dwattr $C$DW$188, DW_AT_name("RSVD6")
    2014                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD6")
    2015                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2016                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$189       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2019                      .dwattr $C$DW$189, DW_AT_name("I2SRXRT0")
    2020                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_I2SRXRT0")
    2021                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2022                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$190       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2025                      .dwattr $C$DW$190, DW_AT_name("I2SRXRT1")
    2026                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_I2SRXRT1")
    2027                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2028                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2029                      .dwendtag $C$DW$T$24
    2030              
    2031              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
    2032                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   50

    2033                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2034              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    2035                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    2036              $C$DW$192       .dwtag  DW_TAG_TI_ioport_type
    2037                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$191)
    2038              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    2039                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$192)
    2040              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2041                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2042                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    2043              
    2044              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2045                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    2046              $C$DW$193       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$26)
    2048                      .dwattr $C$DW$193, DW_AT_name("i2sNum")
    2049                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_i2sNum")
    2050                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$194       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    2054                      .dwattr $C$DW$194, DW_AT_name("opMode")
    2055                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_opMode")
    2056                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2057                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$195       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$30)
    2060                      .dwattr $C$DW$195, DW_AT_name("chType")
    2061                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_chType")
    2062                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2063                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2064              $C$DW$196       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$33)
    2066                      .dwattr $C$DW$196, DW_AT_name("hwRegs")
    2067                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_hwRegs")
    2068                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2069                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$197       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$197, DW_AT_name("configured")
    2073                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_configured")
    2074                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2075                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2076              $C$DW$198       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$35)
    2078                      .dwattr $C$DW$198, DW_AT_name("datapack")
    2079                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_datapack")
    2080                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2081                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$199       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$37)
    2084                      .dwattr $C$DW$199, DW_AT_name("fsDiv")
    2085                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_fsDiv")
    2086                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2087                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   51

    2088              $C$DW$200       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$39)
    2090                      .dwattr $C$DW$200, DW_AT_name("wordLen")
    2091                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_wordLen")
    2092                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2093                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$201       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$41)
    2096                      .dwattr $C$DW$201, DW_AT_name("loopBackMode")
    2097                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_loopBackMode")
    2098                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2099                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$202       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$42)
    2102                      .dwattr $C$DW$202, DW_AT_name("firstRead")
    2103                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_firstRead")
    2104                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2105                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2106                      .dwendtag $C$DW$T$43
    2107              
    2108              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
    2109                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$43)
    2110                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2111              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2112                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2113                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    2114              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
    2115                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2116                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2117              
    2118              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    2119                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    2120              $C$DW$203       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$45)
    2122                      .dwattr $C$DW$203, DW_AT_name("dataType")
    2123                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_dataType")
    2124                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$204       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$41)
    2128                      .dwattr $C$DW$204, DW_AT_name("loopBackMode")
    2129                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_loopBackMode")
    2130                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2131                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$205       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$47)
    2134                      .dwattr $C$DW$205, DW_AT_name("fsPol")
    2135                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_fsPol")
    2136                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2137                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$206       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$49)
    2140                      .dwattr $C$DW$206, DW_AT_name("clkPol")
    2141                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_clkPol")
    2142                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   52

    2143                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$207       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$51)
    2146                      .dwattr $C$DW$207, DW_AT_name("datadelay")
    2147                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_datadelay")
    2148                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2149                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$208       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$35)
    2152                      .dwattr $C$DW$208, DW_AT_name("datapack")
    2153                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_datapack")
    2154                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2155                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$209       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$53)
    2158                      .dwattr $C$DW$209, DW_AT_name("signext")
    2159                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_signext")
    2160                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2161                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2162              $C$DW$210       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$39)
    2164                      .dwattr $C$DW$210, DW_AT_name("wordLen")
    2165                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_wordLen")
    2166                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2167                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$211       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$55)
    2170                      .dwattr $C$DW$211, DW_AT_name("i2sMode")
    2171                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_i2sMode")
    2172                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2173                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$212       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$57)
    2176                      .dwattr $C$DW$212, DW_AT_name("dataFormat")
    2177                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_dataFormat")
    2178                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2179                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$213       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$37)
    2182                      .dwattr $C$DW$213, DW_AT_name("fsDiv")
    2183                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_fsDiv")
    2184                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2185                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$214       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$59)
    2188                      .dwattr $C$DW$214, DW_AT_name("clkDiv")
    2189                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_clkDiv")
    2190                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2191                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$215       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$61)
    2194                      .dwattr $C$DW$215, DW_AT_name("FError")
    2195                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_FError")
    2196                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2197                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   53

    2198              $C$DW$216       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$63)
    2200                      .dwattr $C$DW$216, DW_AT_name("OuError")
    2201                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_OuError")
    2202                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2203                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2204                      .dwendtag $C$DW$T$64
    2205              
    2206              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    2207                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$64)
    2208                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2209              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    2210                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2211                      .dwattr $C$DW$T$81, DW_AT_address_class(0x17)
    2212              
    2213              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    2214                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    2215              $C$DW$217       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$67)
    2217                      .dwattr $C$DW$217, DW_AT_name("funcAddr")
    2218                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_funcAddr")
    2219                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$218       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$68)
    2223                      .dwattr $C$DW$218, DW_AT_name("funcArg")
    2224                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_funcArg")
    2225                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2226                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$219       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$68)
    2229                      .dwattr $C$DW$219, DW_AT_name("ierMask")
    2230                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_ierMask")
    2231                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2232                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2233              $C$DW$220       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$68)
    2235                      .dwattr $C$DW$220, DW_AT_name("cacheCtrl")
    2236                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_cacheCtrl")
    2237                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2238                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2239                      .dwendtag $C$DW$T$69
    2240              
    2241              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Dispatch")
    2242                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2243                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2244              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2245                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2246                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    2247              
    2248              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    2249                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x84)
    2250              $C$DW$221       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$71)
    2252                      .dwattr $C$DW$221, DW_AT_name("IrqDispatchTable")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   54

    2253                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_IrqDispatchTable")
    2254                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$222       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$72)
    2258                      .dwattr $C$DW$222, DW_AT_name("IrqIntTable")
    2259                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_IrqIntTable")
    2260                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2261                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$223       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$72)
    2264                      .dwattr $C$DW$223, DW_AT_name("IrqEventTable")
    2265                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_IrqEventTable")
    2266                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2267                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$224       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2270                      .dwattr $C$DW$224, DW_AT_name("biosPresent")
    2271                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_biosPresent")
    2272                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2273                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2274                      .dwendtag $C$DW$T$73
    2275              
    2276              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IrqDataObj")
    2277                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$73)
    2278                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2279              
    2280              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    2281                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x08)
    2282              $C$DW$225       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$67)
    2284                      .dwattr $C$DW$225, DW_AT_name("funcAddr")
    2285                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_funcAddr")
    2286                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2288              $C$DW$226       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$68)
    2290                      .dwattr $C$DW$226, DW_AT_name("funcArg")
    2291                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_funcArg")
    2292                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2293                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2294              $C$DW$227       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$68)
    2296                      .dwattr $C$DW$227, DW_AT_name("ierMask")
    2297                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ierMask")
    2298                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2299                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2300              $C$DW$228       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$68)
    2302                      .dwattr $C$DW$228, DW_AT_name("cacheCtrl")
    2303                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_cacheCtrl")
    2304                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2305                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2306                      .dwendtag $C$DW$T$74
    2307              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
CSL_I2S_IntcExample.asm                                              PAGE   55

    2308              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Config")
    2309                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$74)
    2310                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2311              
    2312              $C$DW$T$65      .dwtag  DW_TAG_subroutine_type
    2313                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2314              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2315                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2316                      .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    2317              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2318                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2319                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2320              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2321                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2322                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2323                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2324              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2325                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2326                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2327                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2328              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2329                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2330                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2331                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2332              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2333                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2334                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2335                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2336              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2337                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2338                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2339                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2340              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2341                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$8)
    2342                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2343              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2344                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2345                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2346              $C$DW$229       .dwtag  DW_TAG_TI_far_type
    2347                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$86)
    2348              $C$DW$T$99      .dwtag  DW_TAG_volatile_type
    2349                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$229)
    2350              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2351                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2352                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2353                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2354              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2355                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2356                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
