TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE    1

    2264              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:00 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1273              
    1274              
    1275              $C$DW$133       .dwtag  DW_TAG_TI_loop
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   29

    1276                      .dwattr $C$DW$133, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\ata_ext_func.asm:$C$L24:1:153828
    1277                      .dwattr $C$DW$133, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mm
    1278                      .dwattr $C$DW$133, DW_AT_TI_begin_line(0xb2)
    1279                      .dwattr $C$DW$133, DW_AT_TI_end_line(0xb5)
    1280              $C$DW$134       .dwtag  DW_TAG_TI_loop_range
    1281                      .dwattr $C$DW$134, DW_AT_low_pc($C$DW$L$_CD$4$B)
    1282                      .dwattr $C$DW$134, DW_AT_high_pc($C$DW$L$_CD$4$E)
    1283                      .dwendtag $C$DW$133
    1284              
    1285                      .dwattr $C$DW$108, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_
    1286                      .dwattr $C$DW$108, DW_AT_TI_end_line(0xce)
    1287                      .dwattr $C$DW$108, DW_AT_TI_end_column(0x01)
    1288                      .dwendentry
    1289                      .dwendtag $C$DW$108
    1290              
    1291              ;*******************************************************************************
    1292              ;* FAR STRINGS                                                                 *
    1293              ;*******************************************************************************
    1294 000000               .sect   ".const:.string"
    1295                      .align  2
    1296 000000 000A  $C$FSL1:        .string 10,"ATA_delete of %s successful",10,0
         000001 0041 
         000002 0054 
         000003 0041 
         000004 005F 
         000005 0064 
         000006 0065 
         000007 006C 
         000008 0065 
         000009 0074 
         00000a 0065 
         00000b 0020 
         00000c 006F 
         00000d 0066 
         00000e 0020 
         00000f 0025 
         000010 0073 
         000011 0020 
         000012 0073 
         000013 0075 
         000014 0063 
         000015 0063 
         000016 0065 
         000017 0073 
         000018 0073 
         000019 0066 
         00001a 0075 
         00001b 006C 
         00001c 000A 
         00001d 0000 
    1297                      .align  2
    1298 00001e 000A  $C$FSL2:        .string 10,"ATA_delete of %s unsuccessful",10,0
         00001f 0041 
         000020 0054 
         000021 0041 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   30

         000022 005F 
         000023 0064 
         000024 0065 
         000025 006C 
         000026 0065 
         000027 0074 
         000028 0065 
         000029 0020 
         00002a 006F 
         00002b 0066 
         00002c 0020 
         00002d 0025 
         00002e 0073 
         00002f 0020 
         000030 0075 
         000031 006E 
         000032 0073 
         000033 0075 
         000034 0063 
         000035 0063 
         000036 0065 
         000037 0073 
         000038 0073 
         000039 0066 
         00003a 0075 
         00003b 006C 
         00003c 000A 
         00003d 0000 
    1299                      .align  2
    1300 00003e 000A  $C$FSL3:        .string 10,"file not found",10,0
         00003f 0066 
         000040 0069 
         000041 006C 
         000042 0065 
         000043 0020 
         000044 006E 
         000045 006F 
         000046 0074 
         000047 0020 
         000048 0066 
         000049 006F 
         00004a 0075 
         00004b 006E 
         00004c 0064 
         00004d 000A 
         00004e 0000 
    1301              ;******************************************************************************
    1302              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1303              ;******************************************************************************
    1304                      .global _ATA_cd
    1305                      .global _ATA_findFirst
    1306                      .global _ATA_findNext
    1307                      .global _ATA_getLongName
    1308                      .global _ATA_create
    1309                      .global _ATA_delete
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   31

    1310                      .global _ATA_setFileName
    1311                      .global _strlen
    1312                      .global _toupper
    1313                      .global _strncmp
    1314                      .global _strcmp
    1315                      .global _printf
    1316              
    1317              ;*******************************************************************************
    1318              ;* TYPE INFORMATION                                                            *
    1319              ;*******************************************************************************
    1320              
    1321              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1322                      .dwattr $C$DW$T$32, DW_AT_name("AtaFileStruct")
    1323                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2a)
    1324              $C$DW$135       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$135, DW_AT_name("Filename")
    1327                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Filename")
    1328                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$136       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1332                      .dwattr $C$DW$136, DW_AT_name("Ext")
    1333                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Ext")
    1334                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1335                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$137       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    1338                      .dwattr $C$DW$137, DW_AT_name("Attributes")
    1339                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_Attributes")
    1340                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1341                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$138       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    1344                      .dwattr $C$DW$138, DW_AT_name("Time")
    1345                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Time")
    1346                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1347                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$139       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    1350                      .dwattr $C$DW$139, DW_AT_name("Date")
    1351                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Date")
    1352                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1353                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$140       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    1356                      .dwattr $C$DW$140, DW_AT_name("reserved1")
    1357                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_reserved1")
    1358                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1359                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$141       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$26)
    1362                      .dwattr $C$DW$141, DW_AT_name("StartCluster")
    1363                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_StartCluster")
    1364                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   32

    1365                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$142       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    1368                      .dwattr $C$DW$142, DW_AT_name("Size")
    1369                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_Size")
    1370                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1371                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$143       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$26)
    1374                      .dwattr $C$DW$143, DW_AT_name("Cluster")
    1375                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_Cluster")
    1376                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1377                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$144       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
    1380                      .dwattr $C$DW$144, DW_AT_name("WordInCluster")
    1381                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_WordInCluster")
    1382                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1383                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$145       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
    1386                      .dwattr $C$DW$145, DW_AT_name("NextBrokenCluster")
    1387                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_NextBrokenCluster")
    1388                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1389                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$146       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$26)
    1392                      .dwattr $C$DW$146, DW_AT_name("PrevBrokenCluster")
    1393                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PrevBrokenCluster")
    1394                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1395                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$147       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$28)
    1398                      .dwattr $C$DW$147, DW_AT_name("CurrentDirSector")
    1399                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CurrentDirSector")
    1400                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1401                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$148       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1404                      .dwattr $C$DW$148, DW_AT_name("CurrentDirEntry")
    1405                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_CurrentDirEntry")
    1406                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1407                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$149       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    1410                      .dwattr $C$DW$149, DW_AT_name("CurrentDirSectorTag")
    1411                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_CurrentDirSectorTag")
    1412                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1413                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$150       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$26)
    1416                      .dwattr $C$DW$150, DW_AT_name("StartDirCluster")
    1417                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_StartDirCluster")
    1418                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1419                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   33

    1420              $C$DW$151       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    1422                      .dwattr $C$DW$151, DW_AT_name("CurrentByte")
    1423                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CurrentByte")
    1424                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1425                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$152       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1428                      .dwattr $C$DW$152, DW_AT_name("pDrive")
    1429                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_pDrive")
    1430                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1431                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1432                      .dwendtag $C$DW$T$32
    1433              
    1434              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("AtaFile")
    1435                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    1436                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1437              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1438                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1439                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    1440              
    1441              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1442                      .dwattr $C$DW$T$58, DW_AT_name("AtaStateStruct")
    1443                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x44)
    1444              $C$DW$153       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$28)
    1446                      .dwattr $C$DW$153, DW_AT_name("BootPhySector")
    1447                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_BootPhySector")
    1448                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$154       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    1452                      .dwattr $C$DW$154, DW_AT_name("FatType")
    1453                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_FatType")
    1454                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1455                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$155       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    1458                      .dwattr $C$DW$155, DW_AT_name("WordsPerLogSector")
    1459                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_WordsPerLogSector")
    1460                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1461                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$156       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    1464                      .dwattr $C$DW$156, DW_AT_name("LogSectorsPerCluster")
    1465                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
    1466                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1467                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$157       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    1470                      .dwattr $C$DW$157, DW_AT_name("RootDirEntries")
    1471                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RootDirEntries")
    1472                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1473                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$158       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   34

    1475                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$25)
    1476                      .dwattr $C$DW$158, DW_AT_name("LogSectorsPerFat")
    1477                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LogSectorsPerFat")
    1478                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1479                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$159       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$28)
    1482                      .dwattr $C$DW$159, DW_AT_name("FirstFatSector")
    1483                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_FirstFatSector")
    1484                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1485                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$160       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$28)
    1488                      .dwattr $C$DW$160, DW_AT_name("RootDirSector")
    1489                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_RootDirSector")
    1490                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1491                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1492              $C$DW$161       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$28)
    1494                      .dwattr $C$DW$161, DW_AT_name("FirstDataSector")
    1495                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_FirstDataSector")
    1496                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1497                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$162       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$28)
    1500                      .dwattr $C$DW$162, DW_AT_name("TotalSectors")
    1501                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_TotalSectors")
    1502                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1503                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1504              $C$DW$163       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    1506                      .dwattr $C$DW$163, DW_AT_name("Data")
    1507                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Data")
    1508                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1509                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$164       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    1512                      .dwattr $C$DW$164, DW_AT_name("CurrentWord")
    1513                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CurrentWord")
    1514                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1515                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1516              $C$DW$165       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    1518                      .dwattr $C$DW$165, DW_AT_name("CurrentPhySector")
    1519                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CurrentPhySector")
    1520                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1521                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1522              $C$DW$166       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    1524                      .dwattr $C$DW$166, DW_AT_name("WordsPerCluster")
    1525                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_WordsPerCluster")
    1526                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1527                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$167       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   35

    1530                      .dwattr $C$DW$167, DW_AT_name("NumberOfFats")
    1531                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_NumberOfFats")
    1532                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1533                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$168       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    1536                      .dwattr $C$DW$168, DW_AT_name("MFWFlag")
    1537                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_MFWFlag")
    1538                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1539                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$169       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$33)
    1542                      .dwattr $C$DW$169, DW_AT_name("Err_Status")
    1543                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Err_Status")
    1544                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1545                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$170       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$3)
    1548                      .dwattr $C$DW$170, DW_AT_name("pAtaMediaState")
    1549                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_pAtaMediaState")
    1550                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1551                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$171       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$35)
    1554                      .dwattr $C$DW$171, DW_AT_name("AtaReset")
    1555                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_AtaReset")
    1556                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1557                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$172       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$37)
    1560                      .dwattr $C$DW$172, DW_AT_name("AtaCommandReadyStatusCheck")
    1561                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
    1562                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1563                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$173       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$35)
    1566                      .dwattr $C$DW$173, DW_AT_name("AtaBusyStatusCheck")
    1567                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
    1568                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1569                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$174       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$42)
    1572                      .dwattr $C$DW$174, DW_AT_name("AtaGetSerialID")
    1573                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_AtaGetSerialID")
    1574                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1575                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$175       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$44)
    1578                      .dwattr $C$DW$175, DW_AT_name("AtaIssueReadCommand")
    1579                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
    1580                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1581                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$176       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$35)
    1584                      .dwattr $C$DW$176, DW_AT_name("AtaDataReadyStatusCheck")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   36

    1585                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
    1586                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1587                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$177       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$47)
    1590                      .dwattr $C$DW$177, DW_AT_name("AtaReadNextWord")
    1591                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_AtaReadNextWord")
    1592                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1593                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$178       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$49)
    1596                      .dwattr $C$DW$178, DW_AT_name("AtaReadNextWord1")
    1597                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_AtaReadNextWord1")
    1598                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1599                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$179       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$49)
    1602                      .dwattr $C$DW$179, DW_AT_name("AtaReadNextNWords")
    1603                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_AtaReadNextNWords")
    1604                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1605                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$180       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$51)
    1608                      .dwattr $C$DW$180, DW_AT_name("AtaWriteSector")
    1609                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_AtaWriteSector")
    1610                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1611                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$181       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$35)
    1614                      .dwattr $C$DW$181, DW_AT_name("AtaWriteSectorFlush")
    1615                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
    1616                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1617                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$182       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$35)
    1620                      .dwattr $C$DW$182, DW_AT_name("AtaInitAtaMediaState")
    1621                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
    1622                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1623                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1624              $C$DW$183       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$35)
    1626                      .dwattr $C$DW$183, DW_AT_name("AtaFlushFat")
    1627                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_AtaFlushFat")
    1628                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1629                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$184       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$53)
    1632                      .dwattr $C$DW$184, DW_AT_name("AtaErrorCallback")
    1633                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_AtaErrorCallback")
    1634                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1635                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$185       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$55)
    1638                      .dwattr $C$DW$185, DW_AT_name("AtaFileSystemType")
    1639                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_AtaFileSystemType")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   37

    1640                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1641                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$186       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$57)
    1644                      .dwattr $C$DW$186, DW_AT_name("get_mod_time")
    1645                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_get_mod_time")
    1646                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1647                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$187       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$57)
    1650                      .dwattr $C$DW$187, DW_AT_name("get_mod_date")
    1651                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_get_mod_date")
    1652                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1653                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1654              $C$DW$188       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$57)
    1656                      .dwattr $C$DW$188, DW_AT_name("get_time")
    1657                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_get_time")
    1658                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1659                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$189       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$57)
    1662                      .dwattr $C$DW$189, DW_AT_name("get_date")
    1663                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_get_date")
    1664                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1665                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$190       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$45)
    1668                      .dwattr $C$DW$190, DW_AT_name("_AtaWriteBuffer")
    1669                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("__AtaWriteBuffer")
    1670                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1671                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$191       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
    1674                      .dwattr $C$DW$191, DW_AT_name("_AtaWriteCurrentPhySector")
    1675                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
    1676                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1677                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwendtag $C$DW$T$58
    1679              
    1680              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
    1681                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$58)
    1682                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1683              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1684                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1685                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    1686              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1687                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    1688              
    1689              $C$DW$T$52      .dwtag  DW_TAG_subroutine_type
    1690                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1691              $C$DW$192       .dwtag  DW_TAG_formal_parameter
    1692                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$9)
    1693                      .dwendtag $C$DW$T$52
    1694              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ata_ext_func.asm                                                     PAGE   38

    1695              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1696                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1697                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    1698              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1699                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1700                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1701                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1702              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1703                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1704                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1705                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1706              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1707                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1708                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1709                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1710              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1711                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1712                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1713                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1714              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1715                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1716                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1717                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1718              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1719                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1720                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1721                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1722              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1723                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    1724                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1725              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
    1726                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1727                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1728              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("AtaError")
    1729                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
