TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE    1

    8312              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:34 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4989                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4990                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4991              
    4992              $C$DW$T$97      .dwtag  DW_TAG_enumeration_type
    4993                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
    4994              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
    4995              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
    4996              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
    4997              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
    4998                      .dwendtag $C$DW$T$97
    4999              
    5000              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
    5001                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    5002                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    5003              
    5004              $C$DW$T$99      .dwtag  DW_TAG_enumeration_type
    5005                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
    5006              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    5007              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    5008                      .dwendtag $C$DW$T$99
    5009              
    5010              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    5011                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    5012                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    5013              
    5014              $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    5015                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    5016              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    5017              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    5018              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    5019              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    5020              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    5021              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    5022              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    5023              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    5024              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    5025              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    5026              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    5027              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    5028              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    5029              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    5030              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    5031              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    5032                      .dwendtag $C$DW$T$111
    5033              
    5034              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    5035                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    5036                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    5037              
    5038              $C$DW$T$113     .dwtag  DW_TAG_enumeration_type
    5039                      .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  128

    5040              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    5041              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    5042              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    5043              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    5044              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    5045                      .dwendtag $C$DW$T$113
    5046              
    5047              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    5048                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    5049                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    5050              
    5051              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5052                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    5053              $C$DW$369       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    5055                      .dwattr $C$DW$369, DW_AT_name("TXFUNCADDR")
    5056                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_TXFUNCADDR")
    5057                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5058                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5059              $C$DW$370       .dwtag  DW_TAG_member
    5060                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    5061                      .dwattr $C$DW$370, DW_AT_name("TXHUBADDR_TXHUBPORT")
    5062                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    5063                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5064                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5065              $C$DW$371       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    5067                      .dwattr $C$DW$371, DW_AT_name("RSVD0")
    5068                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_RSVD0")
    5069                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5070                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5071              $C$DW$372       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    5073                      .dwattr $C$DW$372, DW_AT_name("RXFUNCADDR")
    5074                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RXFUNCADDR")
    5075                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5076                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5077              $C$DW$373       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    5079                      .dwattr $C$DW$373, DW_AT_name("RXHUBADDR_RXHUBPORT")
    5080                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    5081                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5082                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5083              $C$DW$374       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    5085                      .dwattr $C$DW$374, DW_AT_name("RSVD36")
    5086                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RSVD36")
    5087                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5088                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5089                      .dwendtag $C$DW$T$22
    5090              
    5091              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    5092                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    5093                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    5094              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  129

    5095              $C$DW$T$40      .dwtag  DW_TAG_array_type
    5096                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    5097                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    5098                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    5099              $C$DW$375       .dwtag  DW_TAG_subrange_type
    5100                      .dwattr $C$DW$375, DW_AT_upper_bound(0x04)
    5101                      .dwendtag $C$DW$T$40
    5102              
    5103              
    5104              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5105                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    5106              $C$DW$376       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    5108                      .dwattr $C$DW$376, DW_AT_name("TXMAXP")
    5109                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_TXMAXP")
    5110                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5111                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5112              $C$DW$377       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    5114                      .dwattr $C$DW$377, DW_AT_name("PERI_TXCSR")
    5115                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_PERI_TXCSR")
    5116                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5117                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5118              $C$DW$378       .dwtag  DW_TAG_member
    5119                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    5120                      .dwattr $C$DW$378, DW_AT_name("RSVD0")
    5121                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD0")
    5122                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5123                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5124              $C$DW$379       .dwtag  DW_TAG_member
    5125                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    5126                      .dwattr $C$DW$379, DW_AT_name("RXMAXP")
    5127                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RXMAXP")
    5128                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5129                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5130              $C$DW$380       .dwtag  DW_TAG_member
    5131                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    5132                      .dwattr $C$DW$380, DW_AT_name("PERI_RXCSR")
    5133                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_PERI_RXCSR")
    5134                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5135                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5136              $C$DW$381       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    5138                      .dwattr $C$DW$381, DW_AT_name("RSVD1")
    5139                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD1")
    5140                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5141                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5142              $C$DW$382       .dwtag  DW_TAG_member
    5143                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    5144                      .dwattr $C$DW$382, DW_AT_name("RXCOUNT")
    5145                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RXCOUNT")
    5146                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5147                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5148              $C$DW$383       .dwtag  DW_TAG_member
    5149                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  130

    5150                      .dwattr $C$DW$383, DW_AT_name("RSVD41")
    5151                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD41")
    5152                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5153                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5154                      .dwendtag $C$DW$T$24
    5155              
    5156              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    5157                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    5158                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5159              
    5160              $C$DW$T$43      .dwtag  DW_TAG_array_type
    5161                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5162                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5163                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    5164              $C$DW$384       .dwtag  DW_TAG_subrange_type
    5165                      .dwattr $C$DW$384, DW_AT_upper_bound(0x03)
    5166                      .dwendtag $C$DW$T$43
    5167              
    5168              
    5169              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5170                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    5171              $C$DW$385       .dwtag  DW_TAG_member
    5172                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    5173                      .dwattr $C$DW$385, DW_AT_name("TXGCR1")
    5174                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_TXGCR1")
    5175                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5176                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5177              $C$DW$386       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    5179                      .dwattr $C$DW$386, DW_AT_name("TXGCR2")
    5180                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_TXGCR2")
    5181                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5182                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5183              $C$DW$387       .dwtag  DW_TAG_member
    5184                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$25)
    5185                      .dwattr $C$DW$387, DW_AT_name("RSVD0")
    5186                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RSVD0")
    5187                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5188                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5189              $C$DW$388       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    5191                      .dwattr $C$DW$388, DW_AT_name("RXGCR1")
    5192                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_RXGCR1")
    5193                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5194                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5195              $C$DW$389       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    5197                      .dwattr $C$DW$389, DW_AT_name("RXGCR2")
    5198                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RXGCR2")
    5199                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5200                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5201              $C$DW$390       .dwtag  DW_TAG_member
    5202                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
    5203                      .dwattr $C$DW$390, DW_AT_name("RSVD1")
    5204                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  131

    5205                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5206                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5207              $C$DW$391       .dwtag  DW_TAG_member
    5208                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    5209                      .dwattr $C$DW$391, DW_AT_name("RXHPCR1A")
    5210                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_RXHPCR1A")
    5211                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5212                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5213              $C$DW$392       .dwtag  DW_TAG_member
    5214                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    5215                      .dwattr $C$DW$392, DW_AT_name("RXHPCR2A")
    5216                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_RXHPCR2A")
    5217                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5218                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5219              $C$DW$393       .dwtag  DW_TAG_member
    5220                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    5221                      .dwattr $C$DW$393, DW_AT_name("RSVD2")
    5222                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_RSVD2")
    5223                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5224                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5225              $C$DW$394       .dwtag  DW_TAG_member
    5226                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    5227                      .dwattr $C$DW$394, DW_AT_name("RXHPCR1B")
    5228                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_RXHPCR1B")
    5229                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5230                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5231              $C$DW$395       .dwtag  DW_TAG_member
    5232                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    5233                      .dwattr $C$DW$395, DW_AT_name("RXHPCR2B")
    5234                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_RXHPCR2B")
    5235                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5236                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5237              $C$DW$396       .dwtag  DW_TAG_member
    5238                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$26)
    5239                      .dwattr $C$DW$396, DW_AT_name("RSVD46")
    5240                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_RSVD46")
    5241                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5242                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5243                      .dwendtag $C$DW$T$27
    5244              
    5245              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    5246                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    5247                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5248              
    5249              $C$DW$T$47      .dwtag  DW_TAG_array_type
    5250                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    5251                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5252                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    5253              $C$DW$397       .dwtag  DW_TAG_subrange_type
    5254                      .dwattr $C$DW$397, DW_AT_upper_bound(0x03)
    5255                      .dwendtag $C$DW$T$47
    5256              
    5257              
    5258              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5259                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  132

    5260              $C$DW$398       .dwtag  DW_TAG_member
    5261                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    5262                      .dwattr $C$DW$398, DW_AT_name("ENTRYLSW")
    5263                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_ENTRYLSW")
    5264                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5265                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5266              $C$DW$399       .dwtag  DW_TAG_member
    5267                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    5268                      .dwattr $C$DW$399, DW_AT_name("ENTRYMSW")
    5269                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_ENTRYMSW")
    5270                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5271                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5272              $C$DW$400       .dwtag  DW_TAG_member
    5273                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    5274                      .dwattr $C$DW$400, DW_AT_name("RSVD49")
    5275                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_RSVD49")
    5276                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5277                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5278                      .dwendtag $C$DW$T$28
    5279              
    5280              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    5281                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    5282                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5283              
    5284              $C$DW$T$51      .dwtag  DW_TAG_array_type
    5285                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    5286                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5287                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    5288              $C$DW$401       .dwtag  DW_TAG_subrange_type
    5289                      .dwattr $C$DW$401, DW_AT_upper_bound(0x3f)
    5290                      .dwendtag $C$DW$T$51
    5291              
    5292              
    5293              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5294                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    5295              $C$DW$402       .dwtag  DW_TAG_member
    5296                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    5297                      .dwattr $C$DW$402, DW_AT_name("QMEMRBASE1")
    5298                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_QMEMRBASE1")
    5299                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5300                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5301              $C$DW$403       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    5303                      .dwattr $C$DW$403, DW_AT_name("QMEMRBASE2")
    5304                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_QMEMRBASE2")
    5305                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5306                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5307              $C$DW$404       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    5309                      .dwattr $C$DW$404, DW_AT_name("RSVD0")
    5310                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_RSVD0")
    5311                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5312                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5313              $C$DW$405       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  133

    5315                      .dwattr $C$DW$405, DW_AT_name("QMEMRCTRL1")
    5316                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    5317                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5318                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5319              $C$DW$406       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    5321                      .dwattr $C$DW$406, DW_AT_name("QMEMRCTRL2")
    5322                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    5323                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5324                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5325              $C$DW$407       .dwtag  DW_TAG_member
    5326                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$29)
    5327                      .dwattr $C$DW$407, DW_AT_name("RSVD63")
    5328                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_RSVD63")
    5329                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5330                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5331                      .dwendtag $C$DW$T$30
    5332              
    5333              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    5334                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
    5335                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5336              
    5337              $C$DW$T$57      .dwtag  DW_TAG_array_type
    5338                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5339                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    5340                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
    5341              $C$DW$408       .dwtag  DW_TAG_subrange_type
    5342                      .dwattr $C$DW$408, DW_AT_upper_bound(0x0f)
    5343                      .dwendtag $C$DW$T$57
    5344              
    5345              
    5346              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5347                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    5348              $C$DW$409       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$31)
    5350                      .dwattr $C$DW$409, DW_AT_name("RSVD0")
    5351                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD0")
    5352                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5353                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5354              $C$DW$410       .dwtag  DW_TAG_member
    5355                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    5356                      .dwattr $C$DW$410, DW_AT_name("CTRL1D")
    5357                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_CTRL1D")
    5358                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5359                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5360              $C$DW$411       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    5362                      .dwattr $C$DW$411, DW_AT_name("CTRL2D")
    5363                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_CTRL2D")
    5364                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5365                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5366              $C$DW$412       .dwtag  DW_TAG_member
    5367                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$21)
    5368                      .dwattr $C$DW$412, DW_AT_name("RSVD65")
    5369                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RSVD65")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  134

    5370                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5371                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5372                      .dwendtag $C$DW$T$32
    5373              
    5374              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    5375                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    5376                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    5377              
    5378              $C$DW$T$60      .dwtag  DW_TAG_array_type
    5379                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    5380                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5381                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
    5382              $C$DW$413       .dwtag  DW_TAG_subrange_type
    5383                      .dwattr $C$DW$413, DW_AT_upper_bound(0x3f)
    5384                      .dwendtag $C$DW$T$60
    5385              
    5386              
    5387              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5388                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    5389              $C$DW$414       .dwtag  DW_TAG_member
    5390                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    5391                      .dwattr $C$DW$414, DW_AT_name("QSTATA")
    5392                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_QSTATA")
    5393                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5394                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5395              $C$DW$415       .dwtag  DW_TAG_member
    5396                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$33)
    5397                      .dwattr $C$DW$415, DW_AT_name("RSVD0")
    5398                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RSVD0")
    5399                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5400                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5401              $C$DW$416       .dwtag  DW_TAG_member
    5402                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    5403                      .dwattr $C$DW$416, DW_AT_name("QSTAT1B")
    5404                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_QSTAT1B")
    5405                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5406                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5407              $C$DW$417       .dwtag  DW_TAG_member
    5408                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    5409                      .dwattr $C$DW$417, DW_AT_name("QSTAT2B")
    5410                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_QSTAT2B")
    5411                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5412                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5413              $C$DW$418       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    5415                      .dwattr $C$DW$418, DW_AT_name("RSVD1")
    5416                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD1")
    5417                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5418                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5419              $C$DW$419       .dwtag  DW_TAG_member
    5420                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    5421                      .dwattr $C$DW$419, DW_AT_name("QSTAT1C")
    5422                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_QSTAT1C")
    5423                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5424                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  135

    5425              $C$DW$420       .dwtag  DW_TAG_member
    5426                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
    5427                      .dwattr $C$DW$420, DW_AT_name("RSVD67")
    5428                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_RSVD67")
    5429                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5430                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5431                      .dwendtag $C$DW$T$34
    5432              
    5433              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    5434                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    5435                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5436              
    5437              $C$DW$T$63      .dwtag  DW_TAG_array_type
    5438                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    5439                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5440                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
    5441              $C$DW$421       .dwtag  DW_TAG_subrange_type
    5442                      .dwattr $C$DW$421, DW_AT_upper_bound(0x3f)
    5443                      .dwendtag $C$DW$T$63
    5444              
    5445              
    5446              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    5447                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
    5448              $C$DW$422       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    5450                      .dwattr $C$DW$422, DW_AT_name("REVID1")
    5451                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_REVID1")
    5452                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5453                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5454              $C$DW$423       .dwtag  DW_TAG_member
    5455                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    5456                      .dwattr $C$DW$423, DW_AT_name("REVID2")
    5457                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_REVID2")
    5458                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5459                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5460              $C$DW$424       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$21)
    5462                      .dwattr $C$DW$424, DW_AT_name("RSVD0")
    5463                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_RSVD0")
    5464                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5465                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5466              $C$DW$425       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    5468                      .dwattr $C$DW$425, DW_AT_name("CTRLR")
    5469                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CTRLR")
    5470                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5471                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5472              $C$DW$426       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$33)
    5474                      .dwattr $C$DW$426, DW_AT_name("RSVD1")
    5475                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_RSVD1")
    5476                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5477                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5478              $C$DW$427       .dwtag  DW_TAG_member
    5479                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  136

    5480                      .dwattr $C$DW$427, DW_AT_name("STATR")
    5481                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_STATR")
    5482                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5483                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5484              $C$DW$428       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$33)
    5486                      .dwattr $C$DW$428, DW_AT_name("RSVD2")
    5487                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_RSVD2")
    5488                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5489                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5490              $C$DW$429       .dwtag  DW_TAG_member
    5491                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    5492                      .dwattr $C$DW$429, DW_AT_name("EMUR")
    5493                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_EMUR")
    5494                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5495                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5496              $C$DW$430       .dwtag  DW_TAG_member
    5497                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$33)
    5498                      .dwattr $C$DW$430, DW_AT_name("RSVD3")
    5499                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_RSVD3")
    5500                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5501                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5502              $C$DW$431       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    5504                      .dwattr $C$DW$431, DW_AT_name("MODE1")
    5505                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_MODE1")
    5506                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5507                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5508              $C$DW$432       .dwtag  DW_TAG_member
    5509                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    5510                      .dwattr $C$DW$432, DW_AT_name("MODE2")
    5511                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_MODE2")
    5512                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5513                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5514              $C$DW$433       .dwtag  DW_TAG_member
    5515                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
    5516                      .dwattr $C$DW$433, DW_AT_name("RSVD4")
    5517                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD4")
    5518                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5519                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5520              $C$DW$434       .dwtag  DW_TAG_member
    5521                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    5522                      .dwattr $C$DW$434, DW_AT_name("AUTOREQ")
    5523                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_AUTOREQ")
    5524                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5525                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5526              $C$DW$435       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$33)
    5528                      .dwattr $C$DW$435, DW_AT_name("RSVD5")
    5529                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_RSVD5")
    5530                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5531                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5532              $C$DW$436       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    5534                      .dwattr $C$DW$436, DW_AT_name("SPRFIXTIME1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  137

    5535                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    5536                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5537                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5538              $C$DW$437       .dwtag  DW_TAG_member
    5539                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    5540                      .dwattr $C$DW$437, DW_AT_name("SPRFIXTIME2")
    5541                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    5542                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5543                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5544              $C$DW$438       .dwtag  DW_TAG_member
    5545                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$21)
    5546                      .dwattr $C$DW$438, DW_AT_name("RSVD6")
    5547                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_RSVD6")
    5548                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5549                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5550              $C$DW$439       .dwtag  DW_TAG_member
    5551                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    5552                      .dwattr $C$DW$439, DW_AT_name("TEARDOWN1")
    5553                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_TEARDOWN1")
    5554                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5555                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5556              $C$DW$440       .dwtag  DW_TAG_member
    5557                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    5558                      .dwattr $C$DW$440, DW_AT_name("TEARDOWN2")
    5559                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_TEARDOWN2")
    5560                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5561                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5562              $C$DW$441       .dwtag  DW_TAG_member
    5563                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    5564                      .dwattr $C$DW$441, DW_AT_name("RSVD7")
    5565                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD7")
    5566                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5567                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5568              $C$DW$442       .dwtag  DW_TAG_member
    5569                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    5570                      .dwattr $C$DW$442, DW_AT_name("INTSRCR1")
    5571                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_INTSRCR1")
    5572                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5573                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5574              $C$DW$443       .dwtag  DW_TAG_member
    5575                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    5576                      .dwattr $C$DW$443, DW_AT_name("INTSRCR2")
    5577                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_INTSRCR2")
    5578                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5579                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5580              $C$DW$444       .dwtag  DW_TAG_member
    5581                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    5582                      .dwattr $C$DW$444, DW_AT_name("RSVD8")
    5583                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD8")
    5584                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5585                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5586              $C$DW$445       .dwtag  DW_TAG_member
    5587                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    5588                      .dwattr $C$DW$445, DW_AT_name("INTSETR1")
    5589                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_INTSETR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  138

    5590                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5591                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5592              $C$DW$446       .dwtag  DW_TAG_member
    5593                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    5594                      .dwattr $C$DW$446, DW_AT_name("INTSETR2")
    5595                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_INTSETR2")
    5596                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5597                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5598              $C$DW$447       .dwtag  DW_TAG_member
    5599                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$21)
    5600                      .dwattr $C$DW$447, DW_AT_name("RSVD9")
    5601                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_RSVD9")
    5602                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5603                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5604              $C$DW$448       .dwtag  DW_TAG_member
    5605                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    5606                      .dwattr $C$DW$448, DW_AT_name("INTCLRR1")
    5607                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_INTCLRR1")
    5608                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5609                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5610              $C$DW$449       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    5612                      .dwattr $C$DW$449, DW_AT_name("INTCLRR2")
    5613                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_INTCLRR2")
    5614                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5615                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5616              $C$DW$450       .dwtag  DW_TAG_member
    5617                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$21)
    5618                      .dwattr $C$DW$450, DW_AT_name("RSVD10")
    5619                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD10")
    5620                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5621                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5622              $C$DW$451       .dwtag  DW_TAG_member
    5623                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    5624                      .dwattr $C$DW$451, DW_AT_name("INTMSKR1")
    5625                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_INTMSKR1")
    5626                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5627                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5628              $C$DW$452       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    5630                      .dwattr $C$DW$452, DW_AT_name("INTMSKR2")
    5631                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_INTMSKR2")
    5632                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5633                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5634              $C$DW$453       .dwtag  DW_TAG_member
    5635                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    5636                      .dwattr $C$DW$453, DW_AT_name("RSVD11")
    5637                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD11")
    5638                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5639                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5640              $C$DW$454       .dwtag  DW_TAG_member
    5641                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    5642                      .dwattr $C$DW$454, DW_AT_name("INTMSKSETR1")
    5643                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_INTMSKSETR1")
    5644                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  139

    5645                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5646              $C$DW$455       .dwtag  DW_TAG_member
    5647                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    5648                      .dwattr $C$DW$455, DW_AT_name("INTMSKSETR2")
    5649                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_INTMSKSETR2")
    5650                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    5651                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5652              $C$DW$456       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    5654                      .dwattr $C$DW$456, DW_AT_name("RSVD12")
    5655                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD12")
    5656                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5657                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5658              $C$DW$457       .dwtag  DW_TAG_member
    5659                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    5660                      .dwattr $C$DW$457, DW_AT_name("INTMSKCLRR1")
    5661                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    5662                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5663                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5664              $C$DW$458       .dwtag  DW_TAG_member
    5665                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    5666                      .dwattr $C$DW$458, DW_AT_name("INTMSKCLRR2")
    5667                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    5668                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    5669                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5670              $C$DW$459       .dwtag  DW_TAG_member
    5671                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    5672                      .dwattr $C$DW$459, DW_AT_name("RSVD13")
    5673                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD13")
    5674                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5675                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5676              $C$DW$460       .dwtag  DW_TAG_member
    5677                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    5678                      .dwattr $C$DW$460, DW_AT_name("INTMASKEDR1")
    5679                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_INTMASKEDR1")
    5680                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5681                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5682              $C$DW$461       .dwtag  DW_TAG_member
    5683                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    5684                      .dwattr $C$DW$461, DW_AT_name("INTMASKEDR2")
    5685                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_INTMASKEDR2")
    5686                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5687                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5688              $C$DW$462       .dwtag  DW_TAG_member
    5689                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$21)
    5690                      .dwattr $C$DW$462, DW_AT_name("RSVD14")
    5691                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_RSVD14")
    5692                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5693                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5694              $C$DW$463       .dwtag  DW_TAG_member
    5695                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    5696                      .dwattr $C$DW$463, DW_AT_name("EOIR")
    5697                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_EOIR")
    5698                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5699                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  140

    5700              $C$DW$464       .dwtag  DW_TAG_member
    5701                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$33)
    5702                      .dwattr $C$DW$464, DW_AT_name("RSVD15")
    5703                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_RSVD15")
    5704                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    5705                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5706              $C$DW$465       .dwtag  DW_TAG_member
    5707                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    5708                      .dwattr $C$DW$465, DW_AT_name("INTVECTR1")
    5709                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_INTVECTR1")
    5710                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5711                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5712              $C$DW$466       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    5714                      .dwattr $C$DW$466, DW_AT_name("INTVECTR2")
    5715                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_INTVECTR2")
    5716                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5717                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5718              $C$DW$467       .dwtag  DW_TAG_member
    5719                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$26)
    5720                      .dwattr $C$DW$467, DW_AT_name("RSVD16")
    5721                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD16")
    5722                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5723                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5724              $C$DW$468       .dwtag  DW_TAG_member
    5725                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    5726                      .dwattr $C$DW$468, DW_AT_name("GREP1SZR1")
    5727                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_GREP1SZR1")
    5728                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5729                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5730              $C$DW$469       .dwtag  DW_TAG_member
    5731                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    5732                      .dwattr $C$DW$469, DW_AT_name("GREP1SZR2")
    5733                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_GREP1SZR2")
    5734                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    5735                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5736              $C$DW$470       .dwtag  DW_TAG_member
    5737                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$21)
    5738                      .dwattr $C$DW$470, DW_AT_name("RSVD17")
    5739                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD17")
    5740                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    5741                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5742              $C$DW$471       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    5744                      .dwattr $C$DW$471, DW_AT_name("GREP2SZR1")
    5745                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_GREP2SZR1")
    5746                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    5747                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5748              $C$DW$472       .dwtag  DW_TAG_member
    5749                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    5750                      .dwattr $C$DW$472, DW_AT_name("GREP2SZR2")
    5751                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_GREP2SZR2")
    5752                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    5753                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5754              $C$DW$473       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  141

    5755                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$21)
    5756                      .dwattr $C$DW$473, DW_AT_name("RSVD18")
    5757                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_RSVD18")
    5758                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5759                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5760              $C$DW$474       .dwtag  DW_TAG_member
    5761                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    5762                      .dwattr $C$DW$474, DW_AT_name("GREP3SZR1")
    5763                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_GREP3SZR1")
    5764                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5765                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5766              $C$DW$475       .dwtag  DW_TAG_member
    5767                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    5768                      .dwattr $C$DW$475, DW_AT_name("GREP3SZR2")
    5769                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_GREP3SZR2")
    5770                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    5771                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5772              $C$DW$476       .dwtag  DW_TAG_member
    5773                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$21)
    5774                      .dwattr $C$DW$476, DW_AT_name("RSVD19")
    5775                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_RSVD19")
    5776                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5777                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5778              $C$DW$477       .dwtag  DW_TAG_member
    5779                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    5780                      .dwattr $C$DW$477, DW_AT_name("GREP4SZR1")
    5781                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_GREP4SZR1")
    5782                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5783                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5784              $C$DW$478       .dwtag  DW_TAG_member
    5785                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    5786                      .dwattr $C$DW$478, DW_AT_name("GREP4SZR2")
    5787                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_GREP4SZR2")
    5788                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    5789                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5790              $C$DW$479       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$35)
    5792                      .dwattr $C$DW$479, DW_AT_name("RSVD20")
    5793                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSVD20")
    5794                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5795                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5796              $C$DW$480       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    5798                      .dwattr $C$DW$480, DW_AT_name("FADDR_POWER")
    5799                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_FADDR_POWER")
    5800                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    5801                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5802              $C$DW$481       .dwtag  DW_TAG_member
    5803                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    5804                      .dwattr $C$DW$481, DW_AT_name("INTRTX")
    5805                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_INTRTX")
    5806                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    5807                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5808              $C$DW$482       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  142

    5810                      .dwattr $C$DW$482, DW_AT_name("RSVD21")
    5811                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_RSVD21")
    5812                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    5813                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5814              $C$DW$483       .dwtag  DW_TAG_member
    5815                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    5816                      .dwattr $C$DW$483, DW_AT_name("INTRRX")
    5817                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_INTRRX")
    5818                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    5819                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5820              $C$DW$484       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    5822                      .dwattr $C$DW$484, DW_AT_name("INTRTXE")
    5823                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_INTRTXE")
    5824                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    5825                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5826              $C$DW$485       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$21)
    5828                      .dwattr $C$DW$485, DW_AT_name("RSVD22")
    5829                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_RSVD22")
    5830                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    5831                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5832              $C$DW$486       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    5834                      .dwattr $C$DW$486, DW_AT_name("INTRRXE")
    5835                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_INTRRXE")
    5836                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    5837                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5838              $C$DW$487       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    5840                      .dwattr $C$DW$487, DW_AT_name("INTRUSB_INTRUSBE")
    5841                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    5842                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    5843                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5844              $C$DW$488       .dwtag  DW_TAG_member
    5845                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$21)
    5846                      .dwattr $C$DW$488, DW_AT_name("RSVD23")
    5847                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD23")
    5848                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    5849                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5850              $C$DW$489       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
    5852                      .dwattr $C$DW$489, DW_AT_name("FRAME")
    5853                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_FRAME")
    5854                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    5855                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5856              $C$DW$490       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    5858                      .dwattr $C$DW$490, DW_AT_name("INDEX_TESTMODE")
    5859                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    5860                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    5861                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5862              $C$DW$491       .dwtag  DW_TAG_member
    5863                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$21)
    5864                      .dwattr $C$DW$491, DW_AT_name("RSVD24")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  143

    5865                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD24")
    5866                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    5867                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5868              $C$DW$492       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    5870                      .dwattr $C$DW$492, DW_AT_name("TXMAXP_INDX")
    5871                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    5872                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    5873                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5874              $C$DW$493       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    5876                      .dwattr $C$DW$493, DW_AT_name("PERI_CSR0_INDX")
    5877                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    5878                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    5879                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5880              $C$DW$494       .dwtag  DW_TAG_member
    5881                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$21)
    5882                      .dwattr $C$DW$494, DW_AT_name("RSVD25")
    5883                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD25")
    5884                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    5885                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5886              $C$DW$495       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    5888                      .dwattr $C$DW$495, DW_AT_name("RXMAXP_INDX")
    5889                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    5890                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    5891                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5892              $C$DW$496       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
    5894                      .dwattr $C$DW$496, DW_AT_name("PERI_RXCSR_INDX")
    5895                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    5896                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    5897                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5898              $C$DW$497       .dwtag  DW_TAG_member
    5899                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$21)
    5900                      .dwattr $C$DW$497, DW_AT_name("RSVD26")
    5901                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_RSVD26")
    5902                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    5903                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5904              $C$DW$498       .dwtag  DW_TAG_member
    5905                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    5906                      .dwattr $C$DW$498, DW_AT_name("COUNT0_INDX")
    5907                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_COUNT0_INDX")
    5908                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    5909                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5910              $C$DW$499       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$36)
    5912                      .dwattr $C$DW$499, DW_AT_name("RSVD27")
    5913                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_RSVD27")
    5914                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    5915                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5916              $C$DW$500       .dwtag  DW_TAG_member
    5917                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    5918                      .dwattr $C$DW$500, DW_AT_name("CONFIGDATA_INDX")
    5919                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  144

    5920                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    5921                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5922              $C$DW$501       .dwtag  DW_TAG_member
    5923                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$21)
    5924                      .dwattr $C$DW$501, DW_AT_name("RSVD28")
    5925                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD28")
    5926                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    5927                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5928              $C$DW$502       .dwtag  DW_TAG_member
    5929                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
    5930                      .dwattr $C$DW$502, DW_AT_name("FIFO0R1")
    5931                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_FIFO0R1")
    5932                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    5933                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5934              $C$DW$503       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    5936                      .dwattr $C$DW$503, DW_AT_name("FIFO0R2")
    5937                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_FIFO0R2")
    5938                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    5939                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5940              $C$DW$504       .dwtag  DW_TAG_member
    5941                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
    5942                      .dwattr $C$DW$504, DW_AT_name("RSVD29")
    5943                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD29")
    5944                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    5945                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5946              $C$DW$505       .dwtag  DW_TAG_member
    5947                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
    5948                      .dwattr $C$DW$505, DW_AT_name("FIFO1R1")
    5949                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_FIFO1R1")
    5950                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    5951                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5952              $C$DW$506       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    5954                      .dwattr $C$DW$506, DW_AT_name("FIFO1R2")
    5955                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_FIFO1R2")
    5956                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    5957                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5958              $C$DW$507       .dwtag  DW_TAG_member
    5959                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    5960                      .dwattr $C$DW$507, DW_AT_name("RSVD30")
    5961                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD30")
    5962                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    5963                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5964              $C$DW$508       .dwtag  DW_TAG_member
    5965                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
    5966                      .dwattr $C$DW$508, DW_AT_name("FIFO2R1")
    5967                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_FIFO2R1")
    5968                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    5969                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5970              $C$DW$509       .dwtag  DW_TAG_member
    5971                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
    5972                      .dwattr $C$DW$509, DW_AT_name("FIFO2R2")
    5973                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_FIFO2R2")
    5974                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  145

    5975                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5976              $C$DW$510       .dwtag  DW_TAG_member
    5977                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
    5978                      .dwattr $C$DW$510, DW_AT_name("RSVD31")
    5979                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD31")
    5980                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    5981                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5982              $C$DW$511       .dwtag  DW_TAG_member
    5983                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    5984                      .dwattr $C$DW$511, DW_AT_name("FIFO3R1")
    5985                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_FIFO3R1")
    5986                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    5987                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5988              $C$DW$512       .dwtag  DW_TAG_member
    5989                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
    5990                      .dwattr $C$DW$512, DW_AT_name("FIFO3R2")
    5991                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_FIFO3R2")
    5992                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    5993                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5994              $C$DW$513       .dwtag  DW_TAG_member
    5995                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
    5996                      .dwattr $C$DW$513, DW_AT_name("RSVD32")
    5997                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_RSVD32")
    5998                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    5999                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6000              $C$DW$514       .dwtag  DW_TAG_member
    6001                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
    6002                      .dwattr $C$DW$514, DW_AT_name("FIFO4R1")
    6003                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_FIFO4R1")
    6004                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    6005                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6006              $C$DW$515       .dwtag  DW_TAG_member
    6007                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
    6008                      .dwattr $C$DW$515, DW_AT_name("FIFO4R2")
    6009                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_FIFO4R2")
    6010                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    6011                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6012              $C$DW$516       .dwtag  DW_TAG_member
    6013                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$37)
    6014                      .dwattr $C$DW$516, DW_AT_name("RSVD33")
    6015                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD33")
    6016                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    6017                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6018              $C$DW$517       .dwtag  DW_TAG_member
    6019                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
    6020                      .dwattr $C$DW$517, DW_AT_name("DEVCTL")
    6021                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_DEVCTL")
    6022                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    6023                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6024              $C$DW$518       .dwtag  DW_TAG_member
    6025                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
    6026                      .dwattr $C$DW$518, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    6027                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    6028                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    6029                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  146

    6030              $C$DW$519       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    6032                      .dwattr $C$DW$519, DW_AT_name("RSVD34")
    6033                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_RSVD34")
    6034                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    6035                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6036              $C$DW$520       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    6038                      .dwattr $C$DW$520, DW_AT_name("TXFIFOADDR")
    6039                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_TXFIFOADDR")
    6040                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    6041                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6042              $C$DW$521       .dwtag  DW_TAG_member
    6043                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$20)
    6044                      .dwattr $C$DW$521, DW_AT_name("RXFIFOADDR")
    6045                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_RXFIFOADDR")
    6046                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    6047                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6048              $C$DW$522       .dwtag  DW_TAG_member
    6049                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$25)
    6050                      .dwattr $C$DW$522, DW_AT_name("RSVD35")
    6051                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD35")
    6052                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    6053                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6054              $C$DW$523       .dwtag  DW_TAG_member
    6055                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    6056                      .dwattr $C$DW$523, DW_AT_name("HWVERS")
    6057                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_HWVERS")
    6058                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    6059                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6060              $C$DW$524       .dwtag  DW_TAG_member
    6061                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$38)
    6062                      .dwattr $C$DW$524, DW_AT_name("RSVD37")
    6063                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_RSVD37")
    6064                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    6065                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6066              $C$DW$525       .dwtag  DW_TAG_member
    6067                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$40)
    6068                      .dwattr $C$DW$525, DW_AT_name("EPTRG")
    6069                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_EPTRG")
    6070                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    6071                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6072              $C$DW$526       .dwtag  DW_TAG_member
    6073                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$41)
    6074                      .dwattr $C$DW$526, DW_AT_name("RSVD38")
    6075                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_RSVD38")
    6076                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    6077                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6078              $C$DW$527       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$20)
    6080                      .dwattr $C$DW$527, DW_AT_name("PERI_CSR0")
    6081                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_PERI_CSR0")
    6082                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    6083                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6084              $C$DW$528       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  147

    6085                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$25)
    6086                      .dwattr $C$DW$528, DW_AT_name("RSVD39")
    6087                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_RSVD39")
    6088                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    6089                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6090              $C$DW$529       .dwtag  DW_TAG_member
    6091                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    6092                      .dwattr $C$DW$529, DW_AT_name("COUNT0")
    6093                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_COUNT0")
    6094                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    6095                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6096              $C$DW$530       .dwtag  DW_TAG_member
    6097                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$36)
    6098                      .dwattr $C$DW$530, DW_AT_name("RSVD40")
    6099                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD40")
    6100                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    6101                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6102              $C$DW$531       .dwtag  DW_TAG_member
    6103                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    6104                      .dwattr $C$DW$531, DW_AT_name("CONFIGDATA")
    6105                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_CONFIGDATA")
    6106                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    6107                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6108              $C$DW$532       .dwtag  DW_TAG_member
    6109                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$21)
    6110                      .dwattr $C$DW$532, DW_AT_name("RSVD42")
    6111                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_RSVD42")
    6112                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    6113                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6114              $C$DW$533       .dwtag  DW_TAG_member
    6115                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$43)
    6116                      .dwattr $C$DW$533, DW_AT_name("EPCSR")
    6117                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_EPCSR")
    6118                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    6119                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6120              $C$DW$534       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$44)
    6122                      .dwattr $C$DW$534, DW_AT_name("RSVD43")
    6123                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_RSVD43")
    6124                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    6125                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6126              $C$DW$535       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
    6128                      .dwattr $C$DW$535, DW_AT_name("DMAREVID1")
    6129                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_DMAREVID1")
    6130                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    6131                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6132              $C$DW$536       .dwtag  DW_TAG_member
    6133                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$20)
    6134                      .dwattr $C$DW$536, DW_AT_name("DMAREVID2")
    6135                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_DMAREVID2")
    6136                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    6137                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6138              $C$DW$537       .dwtag  DW_TAG_member
    6139                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  148

    6140                      .dwattr $C$DW$537, DW_AT_name("RSVD44")
    6141                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_RSVD44")
    6142                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    6143                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6144              $C$DW$538       .dwtag  DW_TAG_member
    6145                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
    6146                      .dwattr $C$DW$538, DW_AT_name("TDFDQ")
    6147                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_TDFDQ")
    6148                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    6149                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6150              $C$DW$539       .dwtag  DW_TAG_member
    6151                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$33)
    6152                      .dwattr $C$DW$539, DW_AT_name("RSVD45")
    6153                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_RSVD45")
    6154                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    6155                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6156              $C$DW$540       .dwtag  DW_TAG_member
    6157                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
    6158                      .dwattr $C$DW$540, DW_AT_name("DMAEMU")
    6159                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_DMAEMU")
    6160                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    6161                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6162              $C$DW$541       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$45)
    6164                      .dwattr $C$DW$541, DW_AT_name("RSVD47")
    6165                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_RSVD47")
    6166                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    6167                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6168              $C$DW$542       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$47)
    6170                      .dwattr $C$DW$542, DW_AT_name("CHANNEL")
    6171                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_CHANNEL")
    6172                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    6173                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6174              $C$DW$543       .dwtag  DW_TAG_member
    6175                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$48)
    6176                      .dwattr $C$DW$543, DW_AT_name("RSVD48")
    6177                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_RSVD48")
    6178                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
    6179                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6180              $C$DW$544       .dwtag  DW_TAG_member
    6181                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
    6182                      .dwattr $C$DW$544, DW_AT_name("DMA_SCHED_CTRL1")
    6183                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
    6184                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
    6185                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6186              $C$DW$545       .dwtag  DW_TAG_member
    6187                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
    6188                      .dwattr $C$DW$545, DW_AT_name("DMA_SCHED_CTRL2")
    6189                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
    6190                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
    6191                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6192              $C$DW$546       .dwtag  DW_TAG_member
    6193                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$49)
    6194                      .dwattr $C$DW$546, DW_AT_name("RSVD50")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_intc_example.asm                                             PAGE  149

    6195                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_RSVD50")
    6196                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
    6197                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6198              $C$DW$547       .dwtag  DW_TAG_member
    6199                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$51)
    6200                      .dwattr $C$DW$547, DW_AT_name("CDMASCHETBLWORD")
    6201                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
    6202                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
    6203                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
