TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE    1

    3286              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:27 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1849                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1850                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1851              
    1852              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1853                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1854              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1855              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1856              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1857              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1858              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1859                      .dwendtag $C$DW$T$32
    1860              
    1861              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1862                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1863                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1864              
    1865              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1866                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1867              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1868              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1869                      .dwendtag $C$DW$T$38
    1870              
    1871              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1872                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1873                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1874              
    1875              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1876                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1877              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1878              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1879              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1880              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1881              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1882                      .dwendtag $C$DW$T$41
    1883              
    1884              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1885                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1886                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1887              
    1888              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1889                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1890              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1891              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1892                      .dwendtag $C$DW$T$43
    1893              
    1894              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1895                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1896                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1897              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   50

    1898              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1899                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1900              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1901              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1902                      .dwendtag $C$DW$T$45
    1903              
    1904              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1905                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1906                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1907              
    1908              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1909                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1910              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
    1911              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1912                      .dwendtag $C$DW$T$47
    1913              
    1914              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1915                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1916                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1917              
    1918              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1919                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1920              $C$DW$176       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1922                      .dwattr $C$DW$176, DW_AT_name("LCDREVMIN")
    1923                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_LCDREVMIN")
    1924                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$177       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1928                      .dwattr $C$DW$177, DW_AT_name("LCDREVMAJ")
    1929                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1930                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1931                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$178       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1934                      .dwattr $C$DW$178, DW_AT_name("RSVD0")
    1935                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD0")
    1936                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1937                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$179       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1940                      .dwattr $C$DW$179, DW_AT_name("LCDCR")
    1941                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_LCDCR")
    1942                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1943                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$180       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    1946                      .dwattr $C$DW$180, DW_AT_name("RSVD1")
    1947                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD1")
    1948                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1949                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$181       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1952                      .dwattr $C$DW$181, DW_AT_name("LCDSR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   51

    1953                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LCDSR")
    1954                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1955                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$182       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    1958                      .dwattr $C$DW$182, DW_AT_name("RSVD2")
    1959                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD2")
    1960                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1961                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$183       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1964                      .dwattr $C$DW$183, DW_AT_name("LCDLIDDCR")
    1965                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1966                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1967                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1968              $C$DW$184       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    1970                      .dwattr $C$DW$184, DW_AT_name("RSVD3")
    1971                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_RSVD3")
    1972                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1973                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$185       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1976                      .dwattr $C$DW$185, DW_AT_name("LCDLIDDCS0CONFIG0")
    1977                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1978                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1979                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1980              $C$DW$186       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1982                      .dwattr $C$DW$186, DW_AT_name("LCDLIDDCS0CONFIG1")
    1983                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1984                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1985                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1986              $C$DW$187       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    1988                      .dwattr $C$DW$187, DW_AT_name("RSVD4")
    1989                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_RSVD4")
    1990                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1991                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$188       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1994                      .dwattr $C$DW$188, DW_AT_name("LCDLIDDCS0ADDR")
    1995                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1996                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1997                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$189       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2000                      .dwattr $C$DW$189, DW_AT_name("RSVD5")
    2001                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RSVD5")
    2002                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2003                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$190       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2006                      .dwattr $C$DW$190, DW_AT_name("LCDLIDDCS0DATA")
    2007                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   52

    2008                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2009                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$191       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2012                      .dwattr $C$DW$191, DW_AT_name("RSVD6")
    2013                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD6")
    2014                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2015                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$192       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2018                      .dwattr $C$DW$192, DW_AT_name("LCDLIDDCS1CONFIG0")
    2019                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    2020                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2021                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$193       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2024                      .dwattr $C$DW$193, DW_AT_name("LCDLIDDCS1CONFIG1")
    2025                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    2026                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2027                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$194       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2030                      .dwattr $C$DW$194, DW_AT_name("RSVD7")
    2031                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD7")
    2032                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2033                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$195       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2036                      .dwattr $C$DW$195, DW_AT_name("LCDLIDDCS1ADDR")
    2037                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    2038                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2039                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$196       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2042                      .dwattr $C$DW$196, DW_AT_name("RSVD8")
    2043                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSVD8")
    2044                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2045                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2046              $C$DW$197       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    2048                      .dwattr $C$DW$197, DW_AT_name("LCDLIDDCS1DATA")
    2049                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    2050                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2051                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$198       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    2054                      .dwattr $C$DW$198, DW_AT_name("RSVD9")
    2055                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSVD9")
    2056                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2057                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$199       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2060                      .dwattr $C$DW$199, DW_AT_name("LCDDMACR")
    2061                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_LCDDMACR")
    2062                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   53

    2063                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2064              $C$DW$200       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2066                      .dwattr $C$DW$200, DW_AT_name("RSVD10")
    2067                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD10")
    2068                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2069                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$201       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2072                      .dwattr $C$DW$201, DW_AT_name("LCDDMAFB0BAR0")
    2073                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    2074                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2075                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2076              $C$DW$202       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2078                      .dwattr $C$DW$202, DW_AT_name("LCDDMAFB0BAR1")
    2079                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    2080                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2081                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$203       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2084                      .dwattr $C$DW$203, DW_AT_name("RSVD11")
    2085                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RSVD11")
    2086                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2087                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$204       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2090                      .dwattr $C$DW$204, DW_AT_name("LCDDMAFB0CAR0")
    2091                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    2092                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2093                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$205       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    2096                      .dwattr $C$DW$205, DW_AT_name("LCDDMAFB0CAR1")
    2097                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    2098                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2099                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$206       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    2102                      .dwattr $C$DW$206, DW_AT_name("RSVD12")
    2103                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD12")
    2104                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2105                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2106              $C$DW$207       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    2108                      .dwattr $C$DW$207, DW_AT_name("LCDDMAFB1BAR0")
    2109                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    2110                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2111                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$208       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2114                      .dwattr $C$DW$208, DW_AT_name("LCDDMAFB1BAR1")
    2115                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    2116                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    2117                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   54

    2118              $C$DW$209       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2120                      .dwattr $C$DW$209, DW_AT_name("RSVD13")
    2121                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD13")
    2122                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2123                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$210       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    2126                      .dwattr $C$DW$210, DW_AT_name("LCDDMAFB1CAR0")
    2127                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    2128                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2129                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2130              $C$DW$211       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2132                      .dwattr $C$DW$211, DW_AT_name("LCDDMAFB1CAR1")
    2133                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    2134                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    2135                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2136                      .dwendtag $C$DW$T$24
    2137              
    2138              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    2139                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$24)
    2140                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2141              $C$DW$212       .dwtag  DW_TAG_TI_far_type
    2142                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$56)
    2143              $C$DW$213       .dwtag  DW_TAG_TI_ioport_type
    2144                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$212)
    2145              $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    2146                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$213)
    2147              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2148                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2149                      .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    2150              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    2151                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2152                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2153              
    2154              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2155                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2156              $C$DW$214       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$214, DW_AT_name("clkDiv")
    2159                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_clkDiv")
    2160                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2162              $C$DW$215       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$26)
    2164                      .dwattr $C$DW$215, DW_AT_name("fdoneIntEn")
    2165                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_fdoneIntEn")
    2166                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2167                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$216       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$28)
    2170                      .dwattr $C$DW$216, DW_AT_name("dmaCs0Cs1")
    2171                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    2172                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   55

    2173                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$217       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$30)
    2176                      .dwattr $C$DW$217, DW_AT_name("dmaEnable")
    2177                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_dmaEnable")
    2178                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2179                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$218       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    2182                      .dwattr $C$DW$218, DW_AT_name("polControl")
    2183                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_polControl")
    2184                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2185                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$219       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$33)
    2188                      .dwattr $C$DW$219, DW_AT_name("modeSel")
    2189                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_modeSel")
    2190                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2191                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2192                      .dwendtag $C$DW$T$34
    2193              
    2194              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    2195                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    2196                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2197              
    2198              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2199                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    2200              $C$DW$220       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$220, DW_AT_name("wSu")
    2203                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_wSu")
    2204                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$221       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$221, DW_AT_name("wStrobe")
    2209                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_wStrobe")
    2210                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2211                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$222       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$222, DW_AT_name("wHold")
    2215                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_wHold")
    2216                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2217                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$223       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$223, DW_AT_name("rSu")
    2221                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rSu")
    2222                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2223                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$224       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$224, DW_AT_name("rStrobe")
    2227                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rStrobe")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   56

    2228                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2229                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$225       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$225, DW_AT_name("rHold")
    2233                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rHold")
    2234                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2235                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$226       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$226, DW_AT_name("ta")
    2239                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_ta")
    2240                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2241                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2242                      .dwendtag $C$DW$T$35
    2243              
    2244              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    2245                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    2246                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2247              
    2248              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2249                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    2250              $C$DW$227       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$3)
    2252                      .dwattr $C$DW$227, DW_AT_name("extendSetup")
    2253                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_extendSetup")
    2254                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$228       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$36)
    2258                      .dwattr $C$DW$228, DW_AT_name("config")
    2259                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_config")
    2260                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2261                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$229       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$37)
    2264                      .dwattr $C$DW$229, DW_AT_name("timingCs0")
    2265                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_timingCs0")
    2266                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2267                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$230       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$39)
    2270                      .dwattr $C$DW$230, DW_AT_name("useCs1")
    2271                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_useCs1")
    2272                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2273                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$231       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$37)
    2276                      .dwattr $C$DW$231, DW_AT_name("timingCs1")
    2277                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_timingCs1")
    2278                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2279                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2280                      .dwendtag $C$DW$T$40
    2281              
    2282              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   57

    2283                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$40)
    2284                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2285              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2286                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2287                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    2288              
    2289              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2290                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2291              $C$DW$232       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$42)
    2293                      .dwattr $C$DW$232, DW_AT_name("burstSize")
    2294                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_burstSize")
    2295                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2297              $C$DW$233       .dwtag  DW_TAG_member
    2298                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$44)
    2299                      .dwattr $C$DW$233, DW_AT_name("eofIntEn")
    2300                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_eofIntEn")
    2301                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2302                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2303              $C$DW$234       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$46)
    2305                      .dwattr $C$DW$234, DW_AT_name("bigEndian")
    2306                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bigEndian")
    2307                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2308                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2309              $C$DW$235       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$48)
    2311                      .dwattr $C$DW$235, DW_AT_name("frameMode")
    2312                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_frameMode")
    2313                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2314                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$236       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$49)
    2317                      .dwattr $C$DW$236, DW_AT_name("fb0Base")
    2318                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_fb0Base")
    2319                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2320                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$237       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$49)
    2323                      .dwattr $C$DW$237, DW_AT_name("fb0Ceil")
    2324                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_fb0Ceil")
    2325                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2326                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2327              $C$DW$238       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$49)
    2329                      .dwattr $C$DW$238, DW_AT_name("fb1Base")
    2330                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_fb1Base")
    2331                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2332                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2333              $C$DW$239       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$49)
    2335                      .dwattr $C$DW$239, DW_AT_name("fb1Ceil")
    2336                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_fb1Ceil")
    2337                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   58

    2338                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2339                      .dwendtag $C$DW$T$50
    2340              
    2341              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    2342                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$50)
    2343                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2344              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2345                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2346                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    2347              
    2348              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2349                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    2350              $C$DW$240       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2352                      .dwattr $C$DW$240, DW_AT_name("EBSR")
    2353                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_EBSR")
    2354                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2356              $C$DW$241       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2358                      .dwattr $C$DW$241, DW_AT_name("RSVD0")
    2359                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RSVD0")
    2360                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2361                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$242       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2364                      .dwattr $C$DW$242, DW_AT_name("PCGCR1")
    2365                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCGCR1")
    2366                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2367                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2368              $C$DW$243       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2370                      .dwattr $C$DW$243, DW_AT_name("PCGCR2")
    2371                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PCGCR2")
    2372                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2373                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2374              $C$DW$244       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2376                      .dwattr $C$DW$244, DW_AT_name("PSRCR")
    2377                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PSRCR")
    2378                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2379                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$245       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2382                      .dwattr $C$DW$245, DW_AT_name("PRCR")
    2383                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_PRCR")
    2384                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2385                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$246       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$51)
    2388                      .dwattr $C$DW$246, DW_AT_name("RSVD1")
    2389                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD1")
    2390                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2391                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2392              $C$DW$247       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   59

    2393                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2394                      .dwattr $C$DW$247, DW_AT_name("TIAFR")
    2395                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_TIAFR")
    2396                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2397                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2398              $C$DW$248       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2400                      .dwattr $C$DW$248, DW_AT_name("RSVD2")
    2401                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_RSVD2")
    2402                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2403                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2404              $C$DW$249       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2406                      .dwattr $C$DW$249, DW_AT_name("ODSCR")
    2407                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_ODSCR")
    2408                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2409                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2410              $C$DW$250       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2412                      .dwattr $C$DW$250, DW_AT_name("PDINHIBR1")
    2413                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_PDINHIBR1")
    2414                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2415                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2416              $C$DW$251       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2418                      .dwattr $C$DW$251, DW_AT_name("PDINHIBR2")
    2419                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_PDINHIBR2")
    2420                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2421                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2422              $C$DW$252       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2424                      .dwattr $C$DW$252, DW_AT_name("PDINHIBR3")
    2425                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_PDINHIBR3")
    2426                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2427                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$253       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2430                      .dwattr $C$DW$253, DW_AT_name("DMA0CESR1")
    2431                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DMA0CESR1")
    2432                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2433                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2434              $C$DW$254       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2436                      .dwattr $C$DW$254, DW_AT_name("DMA0CESR2")
    2437                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DMA0CESR2")
    2438                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2439                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$255       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2442                      .dwattr $C$DW$255, DW_AT_name("DMA1CESR1")
    2443                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DMA1CESR1")
    2444                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2445                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2446              $C$DW$256       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   60

    2448                      .dwattr $C$DW$256, DW_AT_name("DMA1CESR2")
    2449                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DMA1CESR2")
    2450                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2451                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2452              $C$DW$257       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2454                      .dwattr $C$DW$257, DW_AT_name("SDRAMCCR")
    2455                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_SDRAMCCR")
    2456                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2457                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$258       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2460                      .dwattr $C$DW$258, DW_AT_name("CCR2")
    2461                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_CCR2")
    2462                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2463                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$259       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2466                      .dwattr $C$DW$259, DW_AT_name("CGCR1")
    2467                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_CGCR1")
    2468                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2469                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$260       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2472                      .dwattr $C$DW$260, DW_AT_name("CGICR")
    2473                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_CGICR")
    2474                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2475                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2476              $C$DW$261       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2478                      .dwattr $C$DW$261, DW_AT_name("CGCR2")
    2479                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_CGCR2")
    2480                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2481                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$262       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2484                      .dwattr $C$DW$262, DW_AT_name("CGOCR")
    2485                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_CGOCR")
    2486                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2487                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$263       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2490                      .dwattr $C$DW$263, DW_AT_name("CCSSR")
    2491                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_CCSSR")
    2492                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2493                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$264       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2496                      .dwattr $C$DW$264, DW_AT_name("RSVD3")
    2497                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_RSVD3")
    2498                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2499                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2500              $C$DW$265       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2502                      .dwattr $C$DW$265, DW_AT_name("ECDR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   61

    2503                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_ECDR")
    2504                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2505                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$266       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2508                      .dwattr $C$DW$266, DW_AT_name("RSVD4")
    2509                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_RSVD4")
    2510                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2511                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$267       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2514                      .dwattr $C$DW$267, DW_AT_name("RAMSLPMDCNTLR1")
    2515                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2516                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2517                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$268       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2520                      .dwattr $C$DW$268, DW_AT_name("RSVD5")
    2521                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_RSVD5")
    2522                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2523                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$269       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2526                      .dwattr $C$DW$269, DW_AT_name("RAMSLPMDCNTLR2")
    2527                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2528                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2529                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$270       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    2532                      .dwattr $C$DW$270, DW_AT_name("RAMSLPMDCNTLR3")
    2533                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2534                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2535                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$271       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2538                      .dwattr $C$DW$271, DW_AT_name("RAMSLPMDCNTLR4")
    2539                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2540                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2541                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$272       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2544                      .dwattr $C$DW$272, DW_AT_name("RAMSLPMDCNTLR5")
    2545                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2546                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2547                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$273       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    2550                      .dwattr $C$DW$273, DW_AT_name("RSVD6")
    2551                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_RSVD6")
    2552                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2553                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$274       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2556                      .dwattr $C$DW$274, DW_AT_name("DMAIFR")
    2557                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_DMAIFR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   62

    2558                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2559                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$275       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2562                      .dwattr $C$DW$275, DW_AT_name("DMAIER")
    2563                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_DMAIER")
    2564                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2565                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$276       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2568                      .dwattr $C$DW$276, DW_AT_name("USBSCR")
    2569                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_USBSCR")
    2570                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2571                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$277       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2574                      .dwattr $C$DW$277, DW_AT_name("ESCR")
    2575                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_ESCR")
    2576                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2577                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$278       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    2580                      .dwattr $C$DW$278, DW_AT_name("RSVD7")
    2581                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_RSVD7")
    2582                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2583                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$279       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2586                      .dwattr $C$DW$279, DW_AT_name("DMA2CESR1")
    2587                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DMA2CESR1")
    2588                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2589                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$280       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2592                      .dwattr $C$DW$280, DW_AT_name("DMA2CESR2")
    2593                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_DMA2CESR2")
    2594                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2595                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2596              $C$DW$281       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2598                      .dwattr $C$DW$281, DW_AT_name("DMA3CESR1")
    2599                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DMA3CESR1")
    2600                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2601                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$282       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2604                      .dwattr $C$DW$282, DW_AT_name("DMA3CESR2")
    2605                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_DMA3CESR2")
    2606                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2607                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$283       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2610                      .dwattr $C$DW$283, DW_AT_name("CLKSTOP")
    2611                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_CLKSTOP")
    2612                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   63

    2613                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2614              $C$DW$284       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$52)
    2616                      .dwattr $C$DW$284, DW_AT_name("RSVD8")
    2617                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RSVD8")
    2618                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2619                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$285       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    2622                      .dwattr $C$DW$285, DW_AT_name("DIEIDR0")
    2623                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_DIEIDR0")
    2624                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2625                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$286       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2628                      .dwattr $C$DW$286, DW_AT_name("DIEIDR1")
    2629                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_DIEIDR1")
    2630                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2631                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$287       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    2634                      .dwattr $C$DW$287, DW_AT_name("DIEIDR2")
    2635                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_DIEIDR2")
    2636                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2637                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$288       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2640                      .dwattr $C$DW$288, DW_AT_name("DIEIDR3")
    2641                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_DIEIDR3")
    2642                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2643                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$289       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2646                      .dwattr $C$DW$289, DW_AT_name("DIEIDR4")
    2647                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_DIEIDR4")
    2648                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2649                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$290       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2652                      .dwattr $C$DW$290, DW_AT_name("DIEIDR5")
    2653                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_DIEIDR5")
    2654                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2655                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$291       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    2658                      .dwattr $C$DW$291, DW_AT_name("DIEIDR6")
    2659                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_DIEIDR6")
    2660                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2661                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$292       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2664                      .dwattr $C$DW$292, DW_AT_name("DIEIDR7")
    2665                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_DIEIDR7")
    2666                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2667                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   64

    2668                      .dwendtag $C$DW$T$53
    2669              
    2670              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2671                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$53)
    2672                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2673              $C$DW$293       .dwtag  DW_TAG_TI_far_type
    2674                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$67)
    2675              $C$DW$294       .dwtag  DW_TAG_TI_ioport_type
    2676                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$293)
    2677              $C$DW$T$68      .dwtag  DW_TAG_volatile_type
    2678                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$294)
    2679              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2680                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2681                      .dwattr $C$DW$T$69, DW_AT_address_class(0x10)
    2682              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2683                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2684                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2685              
    2686              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2687                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
    2688              $C$DW$295       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$54)
    2690                      .dwattr $C$DW$295, DW_AT_name("RSVD0")
    2691                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD0")
    2692                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2694              $C$DW$296       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2696                      .dwattr $C$DW$296, DW_AT_name("IODIR1")
    2697                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_IODIR1")
    2698                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2699                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$297       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2702                      .dwattr $C$DW$297, DW_AT_name("IODIR2")
    2703                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_IODIR2")
    2704                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2705                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$298       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2708                      .dwattr $C$DW$298, DW_AT_name("IOINDATA1")
    2709                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_IOINDATA1")
    2710                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2711                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$299       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    2714                      .dwattr $C$DW$299, DW_AT_name("IOINDATA2")
    2715                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_IOINDATA2")
    2716                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2717                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$300       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2720                      .dwattr $C$DW$300, DW_AT_name("IOOUTDATA1")
    2721                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_IOOUTDATA1")
    2722                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   65

    2723                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2724              $C$DW$301       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    2726                      .dwattr $C$DW$301, DW_AT_name("IOOUTDATA2")
    2727                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_IOOUTDATA2")
    2728                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2729                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$302       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    2732                      .dwattr $C$DW$302, DW_AT_name("IOINTEDG1")
    2733                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_IOINTEDG1")
    2734                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2735                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2736              $C$DW$303       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    2738                      .dwattr $C$DW$303, DW_AT_name("IOINTEDG2")
    2739                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_IOINTEDG2")
    2740                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2741                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$304       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2744                      .dwattr $C$DW$304, DW_AT_name("IOINTEN1")
    2745                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_IOINTEN1")
    2746                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2747                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$305       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    2750                      .dwattr $C$DW$305, DW_AT_name("IOINTEN2")
    2751                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_IOINTEN2")
    2752                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2753                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$306       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2756                      .dwattr $C$DW$306, DW_AT_name("IOINTFLG1")
    2757                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_IOINTFLG1")
    2758                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2759                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2760              $C$DW$307       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    2762                      .dwattr $C$DW$307, DW_AT_name("IOINTFLG2")
    2763                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_IOINTFLG2")
    2764                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2765                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2766                      .dwendtag $C$DW$T$55
    2767              
    2768              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    2769                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$55)
    2770                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2771              $C$DW$308       .dwtag  DW_TAG_TI_far_type
    2772                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$71)
    2773              $C$DW$309       .dwtag  DW_TAG_TI_ioport_type
    2774                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$308)
    2775              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2776                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$309)
    2777              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   66

    2778                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2779                      .dwattr $C$DW$T$73, DW_AT_address_class(0x10)
    2780              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    2781                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2782                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2783              
    2784              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2785                      .dwattr $C$DW$T$62, DW_AT_name("CSL_LcdcObj")
    2786                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2787              $C$DW$310       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$59)
    2789                      .dwattr $C$DW$310, DW_AT_name("regs")
    2790                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_regs")
    2791                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2792                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2793              $C$DW$311       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$61)
    2795                      .dwattr $C$DW$311, DW_AT_name("perNum")
    2796                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_perNum")
    2797                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2798                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2799                      .dwendtag $C$DW$T$62
    2800              
    2801              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2802                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$62)
    2803                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2804              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2805                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2806                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    2807              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2808                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2809                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2810              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2811                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2812              
    2813              $C$DW$T$92      .dwtag  DW_TAG_subroutine_type
    2814                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2815              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    2816                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2817                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    2818              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2819                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2820                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2821              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2822                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2823                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2824                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2825              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2826                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2827                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2828                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2829              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2830                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2831                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2832                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_262kColorModeExample.asm                                    PAGE   67

    2833              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2834                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2835                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2836                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2837              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2838                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2839                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2840                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2841              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2842                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2843                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2844              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2845                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2846                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2847              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2848                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$60)
