TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE    1

   12990              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:28 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

   12219                      .dwattr $C$DW$770, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lc
   12220                      .dwattr $C$DW$770, DW_AT_TI_begin_line(0x52d)
   12221                      .dwattr $C$DW$770, DW_AT_TI_end_line(0x546)
   12222              $C$DW$771       .dwtag  DW_TAG_TI_loop_range
   12223                      .dwattr $C$DW$771, DW_AT_low_pc($C$DW$L$_draw_font$3$B)
   12224                      .dwattr $C$DW$771, DW_AT_high_pc($C$DW$L$_draw_font$3$E)
   12225              $C$DW$772       .dwtag  DW_TAG_TI_loop_range
   12226                      .dwattr $C$DW$772, DW_AT_low_pc($C$DW$L$_draw_font$4$B)
   12227                      .dwattr $C$DW$772, DW_AT_high_pc($C$DW$L$_draw_font$4$E)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  242

   12228              $C$DW$773       .dwtag  DW_TAG_TI_loop_range
   12229                      .dwattr $C$DW$773, DW_AT_low_pc($C$DW$L$_draw_font$5$B)
   12230                      .dwattr $C$DW$773, DW_AT_high_pc($C$DW$L$_draw_font$5$E)
   12231              $C$DW$774       .dwtag  DW_TAG_TI_loop_range
   12232                      .dwattr $C$DW$774, DW_AT_low_pc($C$DW$L$_draw_font$6$B)
   12233                      .dwattr $C$DW$774, DW_AT_high_pc($C$DW$L$_draw_font$6$E)
   12234                      .dwendtag $C$DW$770
   12235              
   12236                      .dwendtag $C$DW$767
   12237              
   12238                      .dwattr $C$DW$731, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lcd/
   12239                      .dwattr $C$DW$731, DW_AT_TI_end_line(0x548)
   12240                      .dwattr $C$DW$731, DW_AT_TI_end_column(0x01)
   12241                      .dwendentry
   12242                      .dwendtag $C$DW$731
   12243              
   12244              ;******************************************************************************
   12245              ;* UNDEFINED EXTERNAL REFERENCES                                              *
   12246              ;******************************************************************************
   12247                      .global _strlen
   12248                      .global _hLcdc
   12249              
   12250              ;*******************************************************************************
   12251              ;* TYPE INFORMATION                                                            *
   12252              ;*******************************************************************************
   12253              
   12254              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
   12255                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
   12256              $C$DW$775       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
   12257              $C$DW$776       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
   12258                      .dwendtag $C$DW$T$32
   12259              
   12260              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
   12261                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
   12262                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
   12263              
   12264              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
   12265                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   12266              $C$DW$777       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_256"), DW_AT_const_value(0x00)
   12267              $C$DW$778       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_65K"), DW_AT_const_value(0x01)
   12268              $C$DW$779       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_1ST"), DW_AT_const_value(0x02)
   12269              $C$DW$780       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_2ND"), DW_AT_const_value(0x03)
   12270                      .dwendtag $C$DW$T$34
   12271              
   12272              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("eColourMode")
   12273                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
   12274                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
   12275              
   12276              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
   12277                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
   12278              $C$DW$781       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_NP"), DW_AT_const_value(0x00)
   12279              $C$DW$782       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_PS"), DW_AT_const_value(0x12)
   12280              $C$DW$783       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_NP"), DW_AT_const_value(0x05)
   12281              $C$DW$784       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_PS"), DW_AT_const_value(0x15)
   12282                      .dwendtag $C$DW$T$36
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  243

   12283              
   12284              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("ePowerSaveMode")
   12285                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   12286                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   12287              
   12288              $C$DW$T$24      .dwtag  DW_TAG_structure_type
   12289                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
   12290              $C$DW$785       .dwtag  DW_TAG_member
   12291                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$20)
   12292                      .dwattr $C$DW$785, DW_AT_name("LCDREVMIN")
   12293                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_LCDREVMIN")
   12294                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12295                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
   12296              $C$DW$786       .dwtag  DW_TAG_member
   12297                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$20)
   12298                      .dwattr $C$DW$786, DW_AT_name("LCDREVMAJ")
   12299                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_LCDREVMAJ")
   12300                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12301                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
   12302              $C$DW$787       .dwtag  DW_TAG_member
   12303                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$21)
   12304                      .dwattr $C$DW$787, DW_AT_name("RSVD0")
   12305                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_RSVD0")
   12306                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12307                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
   12308              $C$DW$788       .dwtag  DW_TAG_member
   12309                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
   12310                      .dwattr $C$DW$788, DW_AT_name("LCDCR")
   12311                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_LCDCR")
   12312                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12313                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
   12314              $C$DW$789       .dwtag  DW_TAG_member
   12315                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$22)
   12316                      .dwattr $C$DW$789, DW_AT_name("RSVD1")
   12317                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_RSVD1")
   12318                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12319                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
   12320              $C$DW$790       .dwtag  DW_TAG_member
   12321                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$20)
   12322                      .dwattr $C$DW$790, DW_AT_name("LCDSR")
   12323                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_LCDSR")
   12324                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12325                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
   12326              $C$DW$791       .dwtag  DW_TAG_member
   12327                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$22)
   12328                      .dwattr $C$DW$791, DW_AT_name("RSVD2")
   12329                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_RSVD2")
   12330                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12331                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
   12332              $C$DW$792       .dwtag  DW_TAG_member
   12333                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$20)
   12334                      .dwattr $C$DW$792, DW_AT_name("LCDLIDDCR")
   12335                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_LCDLIDDCR")
   12336                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12337                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  244

   12338              $C$DW$793       .dwtag  DW_TAG_member
   12339                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$22)
   12340                      .dwattr $C$DW$793, DW_AT_name("RSVD3")
   12341                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_RSVD3")
   12342                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12343                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
   12344              $C$DW$794       .dwtag  DW_TAG_member
   12345                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$20)
   12346                      .dwattr $C$DW$794, DW_AT_name("LCDLIDDCS0CONFIG0")
   12347                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
   12348                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12349                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
   12350              $C$DW$795       .dwtag  DW_TAG_member
   12351                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$20)
   12352                      .dwattr $C$DW$795, DW_AT_name("LCDLIDDCS0CONFIG1")
   12353                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
   12354                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   12355                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
   12356              $C$DW$796       .dwtag  DW_TAG_member
   12357                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$21)
   12358                      .dwattr $C$DW$796, DW_AT_name("RSVD4")
   12359                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_RSVD4")
   12360                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12361                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
   12362              $C$DW$797       .dwtag  DW_TAG_member
   12363                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
   12364                      .dwattr $C$DW$797, DW_AT_name("LCDLIDDCS0ADDR")
   12365                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
   12366                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12367                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
   12368              $C$DW$798       .dwtag  DW_TAG_member
   12369                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$22)
   12370                      .dwattr $C$DW$798, DW_AT_name("RSVD5")
   12371                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_RSVD5")
   12372                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12373                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
   12374              $C$DW$799       .dwtag  DW_TAG_member
   12375                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
   12376                      .dwattr $C$DW$799, DW_AT_name("LCDLIDDCS0DATA")
   12377                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
   12378                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12379                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
   12380              $C$DW$800       .dwtag  DW_TAG_member
   12381                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$22)
   12382                      .dwattr $C$DW$800, DW_AT_name("RSVD6")
   12383                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_RSVD6")
   12384                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12385                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
   12386              $C$DW$801       .dwtag  DW_TAG_member
   12387                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
   12388                      .dwattr $C$DW$801, DW_AT_name("LCDLIDDCS1CONFIG0")
   12389                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
   12390                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12391                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
   12392              $C$DW$802       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  245

   12393                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
   12394                      .dwattr $C$DW$802, DW_AT_name("LCDLIDDCS1CONFIG1")
   12395                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
   12396                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   12397                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
   12398              $C$DW$803       .dwtag  DW_TAG_member
   12399                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$21)
   12400                      .dwattr $C$DW$803, DW_AT_name("RSVD7")
   12401                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_RSVD7")
   12402                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12403                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
   12404              $C$DW$804       .dwtag  DW_TAG_member
   12405                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
   12406                      .dwattr $C$DW$804, DW_AT_name("LCDLIDDCS1ADDR")
   12407                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
   12408                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   12409                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
   12410              $C$DW$805       .dwtag  DW_TAG_member
   12411                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$22)
   12412                      .dwattr $C$DW$805, DW_AT_name("RSVD8")
   12413                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_RSVD8")
   12414                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   12415                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
   12416              $C$DW$806       .dwtag  DW_TAG_member
   12417                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
   12418                      .dwattr $C$DW$806, DW_AT_name("LCDLIDDCS1DATA")
   12419                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
   12420                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   12421                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
   12422              $C$DW$807       .dwtag  DW_TAG_member
   12423                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$23)
   12424                      .dwattr $C$DW$807, DW_AT_name("RSVD9")
   12425                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_RSVD9")
   12426                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   12427                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
   12428              $C$DW$808       .dwtag  DW_TAG_member
   12429                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
   12430                      .dwattr $C$DW$808, DW_AT_name("LCDDMACR")
   12431                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_LCDDMACR")
   12432                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   12433                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
   12434              $C$DW$809       .dwtag  DW_TAG_member
   12435                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
   12436                      .dwattr $C$DW$809, DW_AT_name("RSVD10")
   12437                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_RSVD10")
   12438                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   12439                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
   12440              $C$DW$810       .dwtag  DW_TAG_member
   12441                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
   12442                      .dwattr $C$DW$810, DW_AT_name("LCDDMAFB0BAR0")
   12443                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
   12444                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   12445                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
   12446              $C$DW$811       .dwtag  DW_TAG_member
   12447                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  246

   12448                      .dwattr $C$DW$811, DW_AT_name("LCDDMAFB0BAR1")
   12449                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
   12450                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   12451                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
   12452              $C$DW$812       .dwtag  DW_TAG_member
   12453                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$21)
   12454                      .dwattr $C$DW$812, DW_AT_name("RSVD11")
   12455                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_RSVD11")
   12456                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   12457                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
   12458              $C$DW$813       .dwtag  DW_TAG_member
   12459                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
   12460                      .dwattr $C$DW$813, DW_AT_name("LCDDMAFB0CAR0")
   12461                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
   12462                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   12463                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
   12464              $C$DW$814       .dwtag  DW_TAG_member
   12465                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
   12466                      .dwattr $C$DW$814, DW_AT_name("LCDDMAFB0CAR1")
   12467                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
   12468                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   12469                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
   12470              $C$DW$815       .dwtag  DW_TAG_member
   12471                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$21)
   12472                      .dwattr $C$DW$815, DW_AT_name("RSVD12")
   12473                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_RSVD12")
   12474                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   12475                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
   12476              $C$DW$816       .dwtag  DW_TAG_member
   12477                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
   12478                      .dwattr $C$DW$816, DW_AT_name("LCDDMAFB1BAR0")
   12479                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
   12480                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   12481                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
   12482              $C$DW$817       .dwtag  DW_TAG_member
   12483                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
   12484                      .dwattr $C$DW$817, DW_AT_name("LCDDMAFB1BAR1")
   12485                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
   12486                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
   12487                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
   12488              $C$DW$818       .dwtag  DW_TAG_member
   12489                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$21)
   12490                      .dwattr $C$DW$818, DW_AT_name("RSVD13")
   12491                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_RSVD13")
   12492                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   12493                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
   12494              $C$DW$819       .dwtag  DW_TAG_member
   12495                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
   12496                      .dwattr $C$DW$819, DW_AT_name("LCDDMAFB1CAR0")
   12497                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
   12498                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   12499                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
   12500              $C$DW$820       .dwtag  DW_TAG_member
   12501                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
   12502                      .dwattr $C$DW$820, DW_AT_name("LCDDMAFB1CAR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  247

   12503                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
   12504                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
   12505                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
   12506                      .dwendtag $C$DW$T$24
   12507              
   12508              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
   12509                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
   12510                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
   12511              $C$DW$821       .dwtag  DW_TAG_TI_far_type
   12512                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$25)
   12513              $C$DW$822       .dwtag  DW_TAG_TI_ioport_type
   12514                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$821)
   12515              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
   12516                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$822)
   12517              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
   12518                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
   12519                      .dwattr $C$DW$T$27, DW_AT_address_class(0x10)
   12520              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
   12521                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
   12522                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
   12523              
   12524              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   12525                      .dwattr $C$DW$T$31, DW_AT_name("CSL_LcdcObj")
   12526                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
   12527              $C$DW$823       .dwtag  DW_TAG_member
   12528                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$28)
   12529                      .dwattr $C$DW$823, DW_AT_name("regs")
   12530                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_regs")
   12531                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12532                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
   12533              $C$DW$824       .dwtag  DW_TAG_member
   12534                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$30)
   12535                      .dwattr $C$DW$824, DW_AT_name("perNum")
   12536                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_perNum")
   12537                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12538                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
   12539                      .dwendtag $C$DW$T$31
   12540              
   12541              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
   12542                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
   12543                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
   12544              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
   12545                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   12546                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
   12547              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
   12548                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
   12549                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
   12550              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   12551                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
   12552              $C$DW$T$4       .dwtag  DW_TAG_base_type
   12553                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   12554                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   12555                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   12556              $C$DW$T$5       .dwtag  DW_TAG_base_type
   12557                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  248

   12558                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   12559                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   12560              $C$DW$T$6       .dwtag  DW_TAG_base_type
   12561                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   12562                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   12563                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   12564              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
   12565                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$6)
   12566                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   12567              
   12568              $C$DW$T$67      .dwtag  DW_TAG_array_type
   12569                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$6)
   12570                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   12571                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x1000)
   12572              $C$DW$825       .dwtag  DW_TAG_subrange_type
   12573                      .dwattr $C$DW$825, DW_AT_upper_bound(0xfff)
   12574                      .dwendtag $C$DW$T$67
   12575              
   12576              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
   12577                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$6)
   12578                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
   12579              $C$DW$T$7       .dwtag  DW_TAG_base_type
   12580                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   12581                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   12582                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
   12583              $C$DW$T$8       .dwtag  DW_TAG_base_type
   12584                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   12585                      .dwattr $C$DW$T$8, DW_AT_name("short")
   12586                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
   12587              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
   12588                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$8)
   12589                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
   12590              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
