TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE    1

    5198              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3424              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
    3425              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
    3426              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    3427                      .dwendtag $C$DW$T$45
    3428              
    3429              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    3430                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3431                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3432              
    3433              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3434                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3435              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    3436              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    3437              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
    3438              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    3439              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    3440                      .dwendtag $C$DW$T$47
    3441              
    3442              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    3443                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3444                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  103

    3445              
    3446              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    3447                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3448              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    3449              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    3450              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
    3451                      .dwendtag $C$DW$T$49
    3452              
    3453              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    3454                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3455                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3456              
    3457              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    3458                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3459              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    3460              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    3461              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    3462                      .dwendtag $C$DW$T$51
    3463              
    3464              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    3465                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3466                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3467              
    3468              $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    3469                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3470              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    3471              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    3472              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    3473              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    3474                      .dwendtag $C$DW$T$53
    3475              
    3476              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    3477                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3478                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3479              
    3480              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    3481                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    3482              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    3483              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    3484              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    3485              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    3486                      .dwendtag $C$DW$T$55
    3487              
    3488              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    3489                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3490                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3491              
    3492              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3493                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    3494              $C$DW$275       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    3496                      .dwattr $C$DW$275, DW_AT_name("REV")
    3497                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_REV")
    3498                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  104

    3500              $C$DW$276       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3502                      .dwattr $C$DW$276, DW_AT_name("STATUS")
    3503                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_STATUS")
    3504                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3505                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$277       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    3508                      .dwattr $C$DW$277, DW_AT_name("RSVD0")
    3509                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_RSVD0")
    3510                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3511                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$278       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    3514                      .dwattr $C$DW$278, DW_AT_name("AWCCR1")
    3515                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_AWCCR1")
    3516                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3517                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$279       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    3520                      .dwattr $C$DW$279, DW_AT_name("AWCCR2")
    3521                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_AWCCR2")
    3522                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3523                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$280       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    3526                      .dwattr $C$DW$280, DW_AT_name("RSVD1")
    3527                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_RSVD1")
    3528                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3529                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3530              $C$DW$281       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    3532                      .dwattr $C$DW$281, DW_AT_name("SDCR1")
    3533                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_SDCR1")
    3534                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3535                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3536              $C$DW$282       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3538                      .dwattr $C$DW$282, DW_AT_name("SDCR2")
    3539                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SDCR2")
    3540                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3541                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3542              $C$DW$283       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    3544                      .dwattr $C$DW$283, DW_AT_name("RSVD2")
    3545                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_RSVD2")
    3546                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3547                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3548              $C$DW$284       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    3550                      .dwattr $C$DW$284, DW_AT_name("SDRCR")
    3551                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SDRCR")
    3552                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3553                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3554              $C$DW$285       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  105

    3555                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
    3556                      .dwattr $C$DW$285, DW_AT_name("RSVD3")
    3557                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RSVD3")
    3558                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3559                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3560              $C$DW$286       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    3562                      .dwattr $C$DW$286, DW_AT_name("ACS2CR1")
    3563                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_ACS2CR1")
    3564                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3565                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$287       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    3568                      .dwattr $C$DW$287, DW_AT_name("ACS2CR2")
    3569                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_ACS2CR2")
    3570                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3571                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3572              $C$DW$288       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    3574                      .dwattr $C$DW$288, DW_AT_name("RSVD4")
    3575                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_RSVD4")
    3576                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3577                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3578              $C$DW$289       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    3580                      .dwattr $C$DW$289, DW_AT_name("ACS3CR1")
    3581                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_ACS3CR1")
    3582                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3583                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$290       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    3586                      .dwattr $C$DW$290, DW_AT_name("ACS3CR2")
    3587                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_ACS3CR2")
    3588                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3589                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3590              $C$DW$291       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    3592                      .dwattr $C$DW$291, DW_AT_name("RSVD5")
    3593                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD5")
    3594                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3595                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3596              $C$DW$292       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    3598                      .dwattr $C$DW$292, DW_AT_name("ACS4CR1")
    3599                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_ACS4CR1")
    3600                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3601                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3602              $C$DW$293       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    3604                      .dwattr $C$DW$293, DW_AT_name("ACS4CR2")
    3605                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_ACS4CR2")
    3606                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3607                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$294       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  106

    3610                      .dwattr $C$DW$294, DW_AT_name("RSVD6")
    3611                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_RSVD6")
    3612                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3613                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$295       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    3616                      .dwattr $C$DW$295, DW_AT_name("ACS5CR1")
    3617                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_ACS5CR1")
    3618                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3619                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3620              $C$DW$296       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    3622                      .dwattr $C$DW$296, DW_AT_name("ACS5CR2")
    3623                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_ACS5CR2")
    3624                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3625                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3626              $C$DW$297       .dwtag  DW_TAG_member
    3627                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    3628                      .dwattr $C$DW$297, DW_AT_name("RSVD7")
    3629                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD7")
    3630                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3631                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3632              $C$DW$298       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    3634                      .dwattr $C$DW$298, DW_AT_name("SDTIMR1")
    3635                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_SDTIMR1")
    3636                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3637                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3638              $C$DW$299       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$23)
    3640                      .dwattr $C$DW$299, DW_AT_name("RSVD8")
    3641                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD8")
    3642                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3643                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3644              $C$DW$300       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    3646                      .dwattr $C$DW$300, DW_AT_name("SDSRETR")
    3647                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_SDSRETR")
    3648                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3649                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3650              $C$DW$301       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$22)
    3652                      .dwattr $C$DW$301, DW_AT_name("RSVD9")
    3653                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD9")
    3654                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    3655                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3656              $C$DW$302       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    3658                      .dwattr $C$DW$302, DW_AT_name("EIRR")
    3659                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_EIRR")
    3660                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3661                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$303       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$22)
    3664                      .dwattr $C$DW$303, DW_AT_name("RSVD10")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  107

    3665                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_RSVD10")
    3666                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3667                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3668              $C$DW$304       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    3670                      .dwattr $C$DW$304, DW_AT_name("EIMR")
    3671                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_EIMR")
    3672                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3673                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$305       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    3676                      .dwattr $C$DW$305, DW_AT_name("RSVD11")
    3677                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD11")
    3678                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3679                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$306       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    3682                      .dwattr $C$DW$306, DW_AT_name("EIMSR")
    3683                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_EIMSR")
    3684                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3685                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$307       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    3688                      .dwattr $C$DW$307, DW_AT_name("RSVD12")
    3689                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD12")
    3690                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    3691                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$308       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    3694                      .dwattr $C$DW$308, DW_AT_name("EIMCR")
    3695                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_EIMCR")
    3696                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3697                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3698              $C$DW$309       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    3700                      .dwattr $C$DW$309, DW_AT_name("RSVD13")
    3701                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD13")
    3702                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    3703                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3704              $C$DW$310       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    3706                      .dwattr $C$DW$310, DW_AT_name("NANDFCR")
    3707                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_NANDFCR")
    3708                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3709                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3710              $C$DW$311       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    3712                      .dwattr $C$DW$311, DW_AT_name("RSVD14")
    3713                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD14")
    3714                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3715                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3716              $C$DW$312       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    3718                      .dwattr $C$DW$312, DW_AT_name("NANDFSR1")
    3719                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_NANDFSR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  108

    3720                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3721                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3722              $C$DW$313       .dwtag  DW_TAG_member
    3723                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    3724                      .dwattr $C$DW$313, DW_AT_name("NANDFSR2")
    3725                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_NANDFSR2")
    3726                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3727                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3728              $C$DW$314       .dwtag  DW_TAG_member
    3729                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    3730                      .dwattr $C$DW$314, DW_AT_name("RSVD15")
    3731                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD15")
    3732                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    3733                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3734              $C$DW$315       .dwtag  DW_TAG_member
    3735                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    3736                      .dwattr $C$DW$315, DW_AT_name("PAGEMODCTRL1")
    3737                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    3738                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3739                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3740              $C$DW$316       .dwtag  DW_TAG_member
    3741                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    3742                      .dwattr $C$DW$316, DW_AT_name("PAGEMODCTRL2")
    3743                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    3744                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    3745                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3746              $C$DW$317       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$25)
    3748                      .dwattr $C$DW$317, DW_AT_name("RSVD16")
    3749                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD16")
    3750                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    3751                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3752              $C$DW$318       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    3754                      .dwattr $C$DW$318, DW_AT_name("NCS2ECC1")
    3755                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_NCS2ECC1")
    3756                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3757                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$319       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    3760                      .dwattr $C$DW$319, DW_AT_name("NCS2ECC2")
    3761                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_NCS2ECC2")
    3762                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    3763                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$320       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3766                      .dwattr $C$DW$320, DW_AT_name("RSVD17")
    3767                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD17")
    3768                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    3769                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3770              $C$DW$321       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    3772                      .dwattr $C$DW$321, DW_AT_name("NCS3ECC1")
    3773                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_NCS3ECC1")
    3774                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  109

    3775                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3776              $C$DW$322       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    3778                      .dwattr $C$DW$322, DW_AT_name("NCS3ECC2")
    3779                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_NCS3ECC2")
    3780                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
    3781                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3782              $C$DW$323       .dwtag  DW_TAG_member
    3783                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    3784                      .dwattr $C$DW$323, DW_AT_name("RSVD18")
    3785                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD18")
    3786                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    3787                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3788              $C$DW$324       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    3790                      .dwattr $C$DW$324, DW_AT_name("NCS4ECC1")
    3791                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_NCS4ECC1")
    3792                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3793                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3794              $C$DW$325       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    3796                      .dwattr $C$DW$325, DW_AT_name("NCS4ECC2")
    3797                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_NCS4ECC2")
    3798                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    3799                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3800              $C$DW$326       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    3802                      .dwattr $C$DW$326, DW_AT_name("RSVD19")
    3803                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_RSVD19")
    3804                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3805                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$327       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    3808                      .dwattr $C$DW$327, DW_AT_name("NCS5ECC1")
    3809                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_NCS5ECC1")
    3810                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3811                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3812              $C$DW$328       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    3814                      .dwattr $C$DW$328, DW_AT_name("NCS5ECC2")
    3815                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_NCS5ECC2")
    3816                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    3817                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$329       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$26)
    3820                      .dwattr $C$DW$329, DW_AT_name("RSVD20")
    3821                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_RSVD20")
    3822                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    3823                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$330       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    3826                      .dwattr $C$DW$330, DW_AT_name("NAND4BITECCLOAD")
    3827                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    3828                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3829                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  110

    3830              $C$DW$331       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$22)
    3832                      .dwattr $C$DW$331, DW_AT_name("RSVD21")
    3833                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD21")
    3834                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    3835                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3836              $C$DW$332       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    3838                      .dwattr $C$DW$332, DW_AT_name("NAND4BITECC1")
    3839                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_NAND4BITECC1")
    3840                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3841                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3842              $C$DW$333       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    3844                      .dwattr $C$DW$333, DW_AT_name("NAND4BITECC2")
    3845                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_NAND4BITECC2")
    3846                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    3847                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3848              $C$DW$334       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    3850                      .dwattr $C$DW$334, DW_AT_name("RSVD22")
    3851                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_RSVD22")
    3852                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3853                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3854              $C$DW$335       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    3856                      .dwattr $C$DW$335, DW_AT_name("NAND4BITECC3")
    3857                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_NAND4BITECC3")
    3858                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3859                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$336       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    3862                      .dwattr $C$DW$336, DW_AT_name("NAND4BITECC4")
    3863                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_NAND4BITECC4")
    3864                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    3865                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$337       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    3868                      .dwattr $C$DW$337, DW_AT_name("RSVD23")
    3869                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD23")
    3870                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3871                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$338       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    3874                      .dwattr $C$DW$338, DW_AT_name("NAND4BITECC5")
    3875                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_NAND4BITECC5")
    3876                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3877                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3878              $C$DW$339       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    3880                      .dwattr $C$DW$339, DW_AT_name("NAND4BITECC6")
    3881                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_NAND4BITECC6")
    3882                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    3883                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$340       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  111

    3885                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$21)
    3886                      .dwattr $C$DW$340, DW_AT_name("RSVD24")
    3887                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD24")
    3888                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3889                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$341       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    3892                      .dwattr $C$DW$341, DW_AT_name("NAND4BITECC7")
    3893                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_NAND4BITECC7")
    3894                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3895                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3896              $C$DW$342       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    3898                      .dwattr $C$DW$342, DW_AT_name("NAND4BITECC8")
    3899                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_NAND4BITECC8")
    3900                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    3901                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3902              $C$DW$343       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$21)
    3904                      .dwattr $C$DW$343, DW_AT_name("RSVD25")
    3905                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD25")
    3906                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3907                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$344       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    3910                      .dwattr $C$DW$344, DW_AT_name("NANDERRADD1")
    3911                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_NANDERRADD1")
    3912                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3913                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$345       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3916                      .dwattr $C$DW$345, DW_AT_name("NANDERRADD2")
    3917                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_NANDERRADD2")
    3918                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    3919                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$346       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    3922                      .dwattr $C$DW$346, DW_AT_name("RSVD26")
    3923                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD26")
    3924                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3925                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$347       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    3928                      .dwattr $C$DW$347, DW_AT_name("NANDERRADD3")
    3929                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_NANDERRADD3")
    3930                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3931                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$348       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3934                      .dwattr $C$DW$348, DW_AT_name("NANDERRADD4")
    3935                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_NANDERRADD4")
    3936                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    3937                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$349       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  112

    3940                      .dwattr $C$DW$349, DW_AT_name("RSVD27")
    3941                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD27")
    3942                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3943                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$350       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    3946                      .dwattr $C$DW$350, DW_AT_name("NANDERRVAL1")
    3947                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_NANDERRVAL1")
    3948                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3949                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$351       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    3952                      .dwattr $C$DW$351, DW_AT_name("NANDERRVAL2")
    3953                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_NANDERRVAL2")
    3954                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    3955                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$352       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    3958                      .dwattr $C$DW$352, DW_AT_name("RSVD28")
    3959                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD28")
    3960                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3961                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$353       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    3964                      .dwattr $C$DW$353, DW_AT_name("NANDERRVAL3")
    3965                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_NANDERRVAL3")
    3966                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3967                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$354       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    3970                      .dwattr $C$DW$354, DW_AT_name("NANDERRVAL4")
    3971                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_NANDERRVAL4")
    3972                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    3973                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3974                      .dwendtag $C$DW$T$27
    3975              
    3976              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    3977                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$27)
    3978                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3979              $C$DW$355       .dwtag  DW_TAG_TI_far_type
    3980                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$62)
    3981              $C$DW$356       .dwtag  DW_TAG_TI_ioport_type
    3982                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$355)
    3983              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    3984                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$356)
    3985              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    3986                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    3987                      .dwattr $C$DW$T$64, DW_AT_address_class(0x10)
    3988              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    3989                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3990                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3991              
    3992              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3993                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    3994              $C$DW$357       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  113

    3995                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3996                      .dwattr $C$DW$357, DW_AT_name("EBSR")
    3997                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_EBSR")
    3998                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3999                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$358       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    4002                      .dwattr $C$DW$358, DW_AT_name("RSVD0")
    4003                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD0")
    4004                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4005                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$359       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    4008                      .dwattr $C$DW$359, DW_AT_name("PCGCR1")
    4009                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_PCGCR1")
    4010                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4011                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$360       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    4014                      .dwattr $C$DW$360, DW_AT_name("PCGCR2")
    4015                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_PCGCR2")
    4016                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4017                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4018              $C$DW$361       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    4020                      .dwattr $C$DW$361, DW_AT_name("PSRCR")
    4021                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_PSRCR")
    4022                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4023                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4024              $C$DW$362       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    4026                      .dwattr $C$DW$362, DW_AT_name("PRCR")
    4027                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_PRCR")
    4028                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4029                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$363       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$28)
    4032                      .dwattr $C$DW$363, DW_AT_name("RSVD1")
    4033                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RSVD1")
    4034                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4035                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$364       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    4038                      .dwattr $C$DW$364, DW_AT_name("TIAFR")
    4039                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_TIAFR")
    4040                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4041                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$365       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    4044                      .dwattr $C$DW$365, DW_AT_name("RSVD2")
    4045                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RSVD2")
    4046                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4047                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4048              $C$DW$366       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  114

    4050                      .dwattr $C$DW$366, DW_AT_name("ODSCR")
    4051                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ODSCR")
    4052                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4053                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4054              $C$DW$367       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    4056                      .dwattr $C$DW$367, DW_AT_name("PDINHIBR1")
    4057                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_PDINHIBR1")
    4058                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4059                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4060              $C$DW$368       .dwtag  DW_TAG_member
    4061                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    4062                      .dwattr $C$DW$368, DW_AT_name("PDINHIBR2")
    4063                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_PDINHIBR2")
    4064                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4065                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4066              $C$DW$369       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    4068                      .dwattr $C$DW$369, DW_AT_name("PDINHIBR3")
    4069                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_PDINHIBR3")
    4070                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4071                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4072              $C$DW$370       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    4074                      .dwattr $C$DW$370, DW_AT_name("DMA0CESR1")
    4075                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DMA0CESR1")
    4076                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4077                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4078              $C$DW$371       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    4080                      .dwattr $C$DW$371, DW_AT_name("DMA0CESR2")
    4081                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DMA0CESR2")
    4082                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4083                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4084              $C$DW$372       .dwtag  DW_TAG_member
    4085                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    4086                      .dwattr $C$DW$372, DW_AT_name("DMA1CESR1")
    4087                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DMA1CESR1")
    4088                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4089                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4090              $C$DW$373       .dwtag  DW_TAG_member
    4091                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    4092                      .dwattr $C$DW$373, DW_AT_name("DMA1CESR2")
    4093                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DMA1CESR2")
    4094                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4095                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4096              $C$DW$374       .dwtag  DW_TAG_member
    4097                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    4098                      .dwattr $C$DW$374, DW_AT_name("SDRAMCCR")
    4099                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_SDRAMCCR")
    4100                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4101                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4102              $C$DW$375       .dwtag  DW_TAG_member
    4103                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    4104                      .dwattr $C$DW$375, DW_AT_name("CCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  115

    4105                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_CCR2")
    4106                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4107                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4108              $C$DW$376       .dwtag  DW_TAG_member
    4109                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    4110                      .dwattr $C$DW$376, DW_AT_name("CGCR1")
    4111                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_CGCR1")
    4112                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4113                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4114              $C$DW$377       .dwtag  DW_TAG_member
    4115                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    4116                      .dwattr $C$DW$377, DW_AT_name("CGICR")
    4117                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_CGICR")
    4118                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4119                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4120              $C$DW$378       .dwtag  DW_TAG_member
    4121                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    4122                      .dwattr $C$DW$378, DW_AT_name("CGCR2")
    4123                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_CGCR2")
    4124                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4125                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4126              $C$DW$379       .dwtag  DW_TAG_member
    4127                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    4128                      .dwattr $C$DW$379, DW_AT_name("CGOCR")
    4129                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_CGOCR")
    4130                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4131                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4132              $C$DW$380       .dwtag  DW_TAG_member
    4133                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    4134                      .dwattr $C$DW$380, DW_AT_name("CCSSR")
    4135                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_CCSSR")
    4136                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4137                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4138              $C$DW$381       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    4140                      .dwattr $C$DW$381, DW_AT_name("RSVD3")
    4141                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD3")
    4142                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4143                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4144              $C$DW$382       .dwtag  DW_TAG_member
    4145                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    4146                      .dwattr $C$DW$382, DW_AT_name("ECDR")
    4147                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ECDR")
    4148                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4149                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4150              $C$DW$383       .dwtag  DW_TAG_member
    4151                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    4152                      .dwattr $C$DW$383, DW_AT_name("RSVD4")
    4153                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD4")
    4154                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4155                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4156              $C$DW$384       .dwtag  DW_TAG_member
    4157                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    4158                      .dwattr $C$DW$384, DW_AT_name("RAMSLPMDCNTLR1")
    4159                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  116

    4160                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4161                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4162              $C$DW$385       .dwtag  DW_TAG_member
    4163                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    4164                      .dwattr $C$DW$385, DW_AT_name("RSVD5")
    4165                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_RSVD5")
    4166                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4167                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4168              $C$DW$386       .dwtag  DW_TAG_member
    4169                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    4170                      .dwattr $C$DW$386, DW_AT_name("RAMSLPMDCNTLR2")
    4171                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4172                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4173                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4174              $C$DW$387       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    4176                      .dwattr $C$DW$387, DW_AT_name("RAMSLPMDCNTLR3")
    4177                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4178                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4179                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4180              $C$DW$388       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    4182                      .dwattr $C$DW$388, DW_AT_name("RAMSLPMDCNTLR4")
    4183                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4184                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4185                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4186              $C$DW$389       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    4188                      .dwattr $C$DW$389, DW_AT_name("RAMSLPMDCNTLR5")
    4189                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4190                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4191                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4192              $C$DW$390       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
    4194                      .dwattr $C$DW$390, DW_AT_name("RSVD6")
    4195                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD6")
    4196                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4197                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4198              $C$DW$391       .dwtag  DW_TAG_member
    4199                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    4200                      .dwattr $C$DW$391, DW_AT_name("DMAIFR")
    4201                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DMAIFR")
    4202                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4203                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4204              $C$DW$392       .dwtag  DW_TAG_member
    4205                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    4206                      .dwattr $C$DW$392, DW_AT_name("DMAIER")
    4207                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DMAIER")
    4208                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4209                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4210              $C$DW$393       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    4212                      .dwattr $C$DW$393, DW_AT_name("USBSCR")
    4213                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_USBSCR")
    4214                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  117

    4215                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4216              $C$DW$394       .dwtag  DW_TAG_member
    4217                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    4218                      .dwattr $C$DW$394, DW_AT_name("ESCR")
    4219                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ESCR")
    4220                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4221                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4222              $C$DW$395       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    4224                      .dwattr $C$DW$395, DW_AT_name("RSVD7")
    4225                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_RSVD7")
    4226                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4227                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4228              $C$DW$396       .dwtag  DW_TAG_member
    4229                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    4230                      .dwattr $C$DW$396, DW_AT_name("DMA2CESR1")
    4231                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DMA2CESR1")
    4232                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4233                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4234              $C$DW$397       .dwtag  DW_TAG_member
    4235                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    4236                      .dwattr $C$DW$397, DW_AT_name("DMA2CESR2")
    4237                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DMA2CESR2")
    4238                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4239                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4240              $C$DW$398       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    4242                      .dwattr $C$DW$398, DW_AT_name("DMA3CESR1")
    4243                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DMA3CESR1")
    4244                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4245                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4246              $C$DW$399       .dwtag  DW_TAG_member
    4247                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    4248                      .dwattr $C$DW$399, DW_AT_name("DMA3CESR2")
    4249                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_DMA3CESR2")
    4250                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4251                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4252              $C$DW$400       .dwtag  DW_TAG_member
    4253                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    4254                      .dwattr $C$DW$400, DW_AT_name("CLKSTOP")
    4255                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CLKSTOP")
    4256                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4257                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4258              $C$DW$401       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    4260                      .dwattr $C$DW$401, DW_AT_name("RSVD8")
    4261                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RSVD8")
    4262                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4263                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4264              $C$DW$402       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    4266                      .dwattr $C$DW$402, DW_AT_name("DIEIDR0")
    4267                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_DIEIDR0")
    4268                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4269                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  118

    4270              $C$DW$403       .dwtag  DW_TAG_member
    4271                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    4272                      .dwattr $C$DW$403, DW_AT_name("DIEIDR1")
    4273                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_DIEIDR1")
    4274                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4275                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4276              $C$DW$404       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    4278                      .dwattr $C$DW$404, DW_AT_name("DIEIDR2")
    4279                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DIEIDR2")
    4280                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4281                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4282              $C$DW$405       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    4284                      .dwattr $C$DW$405, DW_AT_name("DIEIDR3")
    4285                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DIEIDR3")
    4286                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4287                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4288              $C$DW$406       .dwtag  DW_TAG_member
    4289                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    4290                      .dwattr $C$DW$406, DW_AT_name("DIEIDR4")
    4291                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_DIEIDR4")
    4292                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4293                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4294              $C$DW$407       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    4296                      .dwattr $C$DW$407, DW_AT_name("DIEIDR5")
    4297                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_DIEIDR5")
    4298                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4299                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4300              $C$DW$408       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    4302                      .dwattr $C$DW$408, DW_AT_name("DIEIDR6")
    4303                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_DIEIDR6")
    4304                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4305                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$409       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    4308                      .dwattr $C$DW$409, DW_AT_name("DIEIDR7")
    4309                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_DIEIDR7")
    4310                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4311                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4312                      .dwendtag $C$DW$T$30
    4313              
    4314              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4315                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$30)
    4316                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4317              $C$DW$410       .dwtag  DW_TAG_TI_far_type
    4318                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$66)
    4319              $C$DW$411       .dwtag  DW_TAG_TI_ioport_type
    4320                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$410)
    4321              $C$DW$T$67      .dwtag  DW_TAG_volatile_type
    4322                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$411)
    4323              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    4324                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  119

    4325                      .dwattr $C$DW$T$68, DW_AT_address_class(0x10)
    4326              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4327                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4328                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4329              
    4330              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4331                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    4332              $C$DW$412       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$32)
    4334                      .dwattr $C$DW$412, DW_AT_name("name")
    4335                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_name")
    4336                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4337                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4338              $C$DW$413       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$33)
    4340                      .dwattr $C$DW$413, DW_AT_name("id")
    4341                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_id")
    4342                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4343                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$414       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$33)
    4346                      .dwattr $C$DW$414, DW_AT_name("bytesPerPage")
    4347                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_bytesPerPage")
    4348                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4349                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$415       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$33)
    4352                      .dwattr $C$DW$415, DW_AT_name("chipSize")
    4353                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_chipSize")
    4354                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4355                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$416       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$33)
    4358                      .dwattr $C$DW$416, DW_AT_name("eraseSize")
    4359                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_eraseSize")
    4360                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4361                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$417       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$35)
    4364                      .dwattr $C$DW$417, DW_AT_name("nand8Bit")
    4365                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_nand8Bit")
    4366                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4367                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$418       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$33)
    4370                      .dwattr $C$DW$418, DW_AT_name("nandOptions")
    4371                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_nandOptions")
    4372                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4373                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4374                      .dwendtag $C$DW$T$36
    4375              
    4376              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandFlashDev")
    4377                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    4378                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4379              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  120

    4380              $C$DW$T$75      .dwtag  DW_TAG_array_type
    4381                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4382                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4383                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x348)
    4384              $C$DW$419       .dwtag  DW_TAG_subrange_type
    4385                      .dwattr $C$DW$419, DW_AT_upper_bound(0x3b)
    4386                      .dwendtag $C$DW$T$75
    4387              
    4388              
    4389              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4390                      .dwattr $C$DW$T$38, DW_AT_name("CSL_NandAsyncBank")
    4391                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    4392              $C$DW$420       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$37)
    4394                      .dwattr $C$DW$420, DW_AT_name("CExDATA")
    4395                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_CExDATA")
    4396                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4397                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$421       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$37)
    4400                      .dwattr $C$DW$421, DW_AT_name("CExALE")
    4401                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_CExALE")
    4402                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4403                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$422       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$37)
    4406                      .dwattr $C$DW$422, DW_AT_name("CExCLE")
    4407                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_CExCLE")
    4408                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4409                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$423       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$37)
    4412                      .dwattr $C$DW$423, DW_AT_name("CExNUM")
    4413                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_CExNUM")
    4414                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4415                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4416                      .dwendtag $C$DW$T$38
    4417              
    4418              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncBank")
    4419                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$38)
    4420                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4421              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    4422                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$71)
    4423                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    4424              
    4425              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4426                      .dwattr $C$DW$T$39, DW_AT_name("CSL_NandAsyncCfg")
    4427                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    4428              $C$DW$424       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    4430                      .dwattr $C$DW$424, DW_AT_name("selectStrobe")
    4431                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_selectStrobe")
    4432                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4433                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$425       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  121

    4435                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    4436                      .dwattr $C$DW$425, DW_AT_name("ewMode")
    4437                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_ewMode")
    4438                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4439                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$426       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    4442                      .dwattr $C$DW$426, DW_AT_name("w_setup")
    4443                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_w_setup")
    4444                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4445                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$427       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    4448                      .dwattr $C$DW$427, DW_AT_name("w_strobe")
    4449                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_w_strobe")
    4450                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4451                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$428       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    4454                      .dwattr $C$DW$428, DW_AT_name("w_hold")
    4455                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_w_hold")
    4456                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4457                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$429       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    4460                      .dwattr $C$DW$429, DW_AT_name("r_setup")
    4461                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_r_setup")
    4462                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4463                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$430       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    4466                      .dwattr $C$DW$430, DW_AT_name("r_strobe")
    4467                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_r_strobe")
    4468                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4469                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$431       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    4472                      .dwattr $C$DW$431, DW_AT_name("r_hold")
    4473                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_r_hold")
    4474                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4475                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$432       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    4478                      .dwattr $C$DW$432, DW_AT_name("turnAround")
    4479                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_turnAround")
    4480                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4481                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$433       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    4484                      .dwattr $C$DW$433, DW_AT_name("aSize")
    4485                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_aSize")
    4486                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4487                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4488                      .dwendtag $C$DW$T$39
    4489              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  122

    4490              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncCfg")
    4491                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$39)
    4492                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4493              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    4494                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4495                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    4496              
    4497              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4498                      .dwattr $C$DW$T$44, DW_AT_name("CSL_NandAsyncWaitCfg")
    4499                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    4500              $C$DW$434       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$41)
    4502                      .dwattr $C$DW$434, DW_AT_name("waitPol")
    4503                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_waitPol")
    4504                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4505                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$435       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$43)
    4508                      .dwattr $C$DW$435, DW_AT_name("nandPort")
    4509                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_nandPort")
    4510                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4511                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$436       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    4514                      .dwattr $C$DW$436, DW_AT_name("waitCycles")
    4515                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_waitCycles")
    4516                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4517                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4518                      .dwendtag $C$DW$T$44
    4519              
    4520              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncWaitCfg")
    4521                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$44)
    4522                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4523              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4524                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4525                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    4526              
    4527              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4528                      .dwattr $C$DW$T$61, DW_AT_name("CSL_NandConfig")
    4529                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x0c)
    4530              $C$DW$437       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$35)
    4532                      .dwattr $C$DW$437, DW_AT_name("nandWidth")
    4533                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_nandWidth")
    4534                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4535                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$438       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$46)
    4538                      .dwattr $C$DW$438, DW_AT_name("nandPageSize")
    4539                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_nandPageSize")
    4540                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4541                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$439       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$48)
    4544                      .dwattr $C$DW$439, DW_AT_name("nandBankNo")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  123

    4545                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_nandBankNo")
    4546                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4547                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$440       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$50)
    4550                      .dwattr $C$DW$440, DW_AT_name("emifAccess")
    4551                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_emifAccess")
    4552                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4553                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$441       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$52)
    4556                      .dwattr $C$DW$441, DW_AT_name("nandOpMode")
    4557                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_nandOpMode")
    4558                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4559                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$442       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    4562                      .dwattr $C$DW$442, DW_AT_name("nandType")
    4563                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_nandType")
    4564                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4565                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$443       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    4568                      .dwattr $C$DW$443, DW_AT_name("chipSelect")
    4569                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_chipSelect")
    4570                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4571                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$444       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$58)
    4574                      .dwattr $C$DW$444, DW_AT_name("asyncWaitCfg")
    4575                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_asyncWaitCfg")
    4576                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4577                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$445       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$60)
    4580                      .dwattr $C$DW$445, DW_AT_name("asyncCfg")
    4581                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_asyncCfg")
    4582                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4583                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4584                      .dwendtag $C$DW$T$61
    4585              
    4586              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandConfig")
    4587                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$61)
    4588                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    4589              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4590                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    4591                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    4592              
    4593              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4594                      .dwattr $C$DW$T$73, DW_AT_name("CSL_NandObj")
    4595                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x14)
    4596              $C$DW$446       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$65)
    4598                      .dwattr $C$DW$446, DW_AT_name("regs")
    4599                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_regs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_polled_example.asm                                          PAGE  124

    4600                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4601                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4602              $C$DW$447       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$69)
    4604                      .dwattr $C$DW$447, DW_AT_name("sysCtrlRegs")
    4605                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_sysCtrlRegs")
    4606                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4607                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4608              $C$DW$448       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    4610                      .dwattr $C$DW$448, DW_AT_name("instId")
    4611                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_instId")
    4612                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4613                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4614              $C$DW$449       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$35)
    4616                      .dwattr $C$DW$449, DW_AT_name("nandWidth")
    4617                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_nandWidth")
    4618                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4619                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4620              $C$DW$450       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$70)
    4622                      .dwattr $C$DW$450, DW_AT_name("intrNumNand")
    4623                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_intrNumNand")
    4624                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4625                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4626              $C$DW$451       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$71)
    4628                      .dwattr $C$DW$451, DW_AT_name("bank")
    4629                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_bank")
    4630                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4631                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4632              $C$DW$452       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$46)
    4634                      .dwattr $C$DW$452, DW_AT_name("nandPageSize")
