TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4755              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 05:43:06 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3764                      .align  2
    3765 000000 0053  $C$FSL1:        .string "Start",0
         000001 0074 
         000002 0061 
         000003 0072 
         000004 0074 
         000005 0000 
    3766                      .align  2
    3767 000006 0042  $C$FSL2:        .string "BlueLED",0
         000007 006C 
         000008 0075 
         000009 0065 
         00000a 004C 
         00000b 0045 
         00000c 0044 
         00000d 0000 
    3768                      .align  2
    3769 00000e 0054  $C$FSL3:        .string "TestTsk1",0
         00000f 0065 
         000010 0073 
         000011 0074 
         000012 0054 
         000013 0073 
         000014 006B 
         000015 0031 
         000016 0000 
    3770                      .align  2
    3771 000018 0054  $C$FSL4:        .string "TestTsk2",0
         000019 0065 
         00001a 0073 
         00001b 0074 
         00001c 0054 
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   80

         00001d 0073 
         00001e 006B 
         00001f 0032 
         000020 0000 
    3772                      .align  2
    3773 000022 0054  $C$FSL5:        .string "TestTsk3",0
         000023 0065 
         000024 0073 
         000025 0074 
         000026 0054 
         000027 0073 
         000028 006B 
         000029 0033 
         00002a 0000 
    3774                      .align  2
    3775 00002c 0054  $C$FSL6:        .string "TestTsk4",0
         00002d 0065 
         00002e 0073 
         00002f 0074 
         000030 0054 
         000031 0073 
         000032 006B 
         000033 0034 
         000034 0000 
    3776                      .align  2
    3777 000036 0058  $C$FSL7:        .string "XFLEDtsk",0
         000037 0046 
         000038 004C 
         000039 0045 
         00003a 0044 
         00003b 0074 
         00003c 0073 
         00003d 006B 
         00003e 0000 
    3778                      .align  2
    3779 000040 0047  $C$FSL8:        .string "GRNLED",0
         000041 0052 
         000042 004E 
         000043 004C 
         000044 0045 
         000045 0044 
         000046 0000 
    3780                      .align  2
    3781 000048 0058  $C$FSL9:        .string "XFLDtsk2",0
         000049 0046 
         00004a 004C 
         00004b 0044 
         00004c 0074 
         00004d 0073 
         00004e 006B 
         00004f 0032 
         000050 0000 
    3782                      .align  2
    3783 000052 004C  $C$FSL10:       .string "LEDCTRL",0
         000053 0045 
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   81

         000054 0044 
         000055 0043 
         000056 0054 
         000057 0052 
         000058 004C 
         000059 0000 
    3784                      .align  2
    3785 00005a 0052  $C$FSL11:       .string "RedLED",0
         00005b 0065 
         00005c 0064 
         00005d 004C 
         00005e 0045 
         00005f 0044 
         000060 0000 
    3786              ;******************************************************************************
    3787              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3788              ;******************************************************************************
    3789                      .global _EZDSP5535_init
    3790                      .global _xTaskCreate
    3791                      .global _vTaskDelay
    3792                      .global _vTaskSuspend
    3793                      .global _vTaskResume
    3794                      .global _vTaskStartScheduler
    3795                      .global _xQueueGenericSend
    3796                      .global _xQueueSemaphoreTake
    3797                      .global _xQueueGenericCreate
    3798                      .global _set_dma0_ch0_i2s0_Lout
    3799                      .global _set_dma0_ch1_i2s0_Rout
    3800                      .global _set_dma0_ch0_stop
    3801                      .global _set_dma0_ch1_stop
    3802                      .global _EZDSP5535_LED_init
    3803                      .global _EZDSP5535_LED_on
    3804                      .global _EZDSP5535_XF_toggle
    3805                      .global _EZDSP5535_GPIO_init
    3806                      .global _EZDSP5535_GPIO_setOutput
    3807                      .global _EZDSP5535_SAR_init
    3808                      .global _PLL_init
    3809                      .global _PLL_config
    3810                      .global _PLL_reset
    3811                      .global _mem_test
    3812                      .global _fTimer
    3813                      .global _Flag_RTC
    3814                      .global _Conunt_RTC
    3815                      .global _VECSTART
    3816              
    3817              ;*******************************************************************************
    3818              ;* TYPE INFORMATION                                                            *
    3819              ;*******************************************************************************
    3820              
    3821              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3822                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3823              $C$DW$331       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    3825                      .dwattr $C$DW$331, DW_AT_name("PLLCNTL1")
    3826                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_PLLCNTL1")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   82

    3827                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3828                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$332       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    3831                      .dwattr $C$DW$332, DW_AT_name("PLLINCNTL")
    3832                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_PLLINCNTL")
    3833                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3834                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$333       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    3837                      .dwattr $C$DW$333, DW_AT_name("PLLCNTL2")
    3838                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PLLCNTL2")
    3839                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3840                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$334       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    3843                      .dwattr $C$DW$334, DW_AT_name("PLLOUTCNTL")
    3844                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    3845                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3846                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3847                      .dwendtag $C$DW$T$22
    3848              
    3849              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    3850                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    3851                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3852              $C$DW$335       .dwtag  DW_TAG_TI_far_type
    3853                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$28)
    3854              $C$DW$T$36      .dwtag  DW_TAG_const_type
    3855                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$335)
    3856              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3857                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3858                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    3859              
    3860              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3861                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    3862              $C$DW$336       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
    3864                      .dwattr $C$DW$336, DW_AT_name("EBSR")
    3865                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_EBSR")
    3866                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3867                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$337       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3870                      .dwattr $C$DW$337, DW_AT_name("RSVD0")
    3871                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD0")
    3872                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3873                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$338       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3876                      .dwattr $C$DW$338, DW_AT_name("PCGCR1")
    3877                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_PCGCR1")
    3878                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3879                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$339       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   83

    3882                      .dwattr $C$DW$339, DW_AT_name("PCGCR2")
    3883                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_PCGCR2")
    3884                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3885                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$340       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3888                      .dwattr $C$DW$340, DW_AT_name("PSRCR")
    3889                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_PSRCR")
    3890                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3891                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$341       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    3894                      .dwattr $C$DW$341, DW_AT_name("PRCR")
    3895                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_PRCR")
    3896                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3897                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$342       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$24)
    3900                      .dwattr $C$DW$342, DW_AT_name("RSVD1")
    3901                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_RSVD1")
    3902                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3903                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$343       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3906                      .dwattr $C$DW$343, DW_AT_name("TIAFR")
    3907                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_TIAFR")
    3908                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3909                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$344       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3912                      .dwattr $C$DW$344, DW_AT_name("RSVD2")
    3913                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_RSVD2")
    3914                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3915                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$345       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3918                      .dwattr $C$DW$345, DW_AT_name("ODSCR")
    3919                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_ODSCR")
    3920                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3921                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3922              $C$DW$346       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3924                      .dwattr $C$DW$346, DW_AT_name("PDINHIBR1")
    3925                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_PDINHIBR1")
    3926                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3927                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$347       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3930                      .dwattr $C$DW$347, DW_AT_name("PDINHIBR2")
    3931                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_PDINHIBR2")
    3932                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3933                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3934              $C$DW$348       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3936                      .dwattr $C$DW$348, DW_AT_name("PDINHIBR3")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   84

    3937                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_PDINHIBR3")
    3938                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3939                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$349       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3942                      .dwattr $C$DW$349, DW_AT_name("DMA0CESR1")
    3943                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_DMA0CESR1")
    3944                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3945                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$350       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3948                      .dwattr $C$DW$350, DW_AT_name("DMA0CESR2")
    3949                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_DMA0CESR2")
    3950                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3951                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$351       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3954                      .dwattr $C$DW$351, DW_AT_name("DMA1CESR1")
    3955                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_DMA1CESR1")
    3956                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3957                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$352       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3960                      .dwattr $C$DW$352, DW_AT_name("DMA1CESR2")
    3961                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_DMA1CESR2")
    3962                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3963                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$353       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3966                      .dwattr $C$DW$353, DW_AT_name("SDRAMCCR")
    3967                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_SDRAMCCR")
    3968                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3969                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3970              $C$DW$354       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3972                      .dwattr $C$DW$354, DW_AT_name("CCR2")
    3973                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_CCR2")
    3974                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3975                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3976              $C$DW$355       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3978                      .dwattr $C$DW$355, DW_AT_name("CGCR1")
    3979                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_CGCR1")
    3980                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3981                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3982              $C$DW$356       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3984                      .dwattr $C$DW$356, DW_AT_name("CGICR")
    3985                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_CGICR")
    3986                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3987                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$357       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    3990                      .dwattr $C$DW$357, DW_AT_name("CGCR2")
    3991                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_CGCR2")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   85

    3992                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3993                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$358       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3996                      .dwattr $C$DW$358, DW_AT_name("CGOCR")
    3997                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_CGOCR")
    3998                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3999                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$359       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    4002                      .dwattr $C$DW$359, DW_AT_name("CCSSR")
    4003                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_CCSSR")
    4004                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4005                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$360       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    4008                      .dwattr $C$DW$360, DW_AT_name("RSVD3")
    4009                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD3")
    4010                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4011                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$361       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    4014                      .dwattr $C$DW$361, DW_AT_name("ECDR")
    4015                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ECDR")
    4016                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4017                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4018              $C$DW$362       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    4020                      .dwattr $C$DW$362, DW_AT_name("RSVD4")
    4021                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RSVD4")
    4022                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4023                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4024              $C$DW$363       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    4026                      .dwattr $C$DW$363, DW_AT_name("RAMSLPMDCNTLR1")
    4027                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4028                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4029                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$364       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    4032                      .dwattr $C$DW$364, DW_AT_name("RSVD5")
    4033                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD5")
    4034                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4035                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$365       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    4038                      .dwattr $C$DW$365, DW_AT_name("RAMSLPMDCNTLR2")
    4039                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4040                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4041                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$366       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    4044                      .dwattr $C$DW$366, DW_AT_name("RAMSLPMDCNTLR3")
    4045                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4046                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   86

    4047                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4048              $C$DW$367       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    4050                      .dwattr $C$DW$367, DW_AT_name("RAMSLPMDCNTLR4")
    4051                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4052                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4053                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4054              $C$DW$368       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    4056                      .dwattr $C$DW$368, DW_AT_name("RAMSLPMDCNTLR5")
    4057                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4058                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4059                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4060              $C$DW$369       .dwtag  DW_TAG_member
    4061                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$25)
    4062                      .dwattr $C$DW$369, DW_AT_name("RSVD6")
    4063                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD6")
    4064                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4065                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4066              $C$DW$370       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    4068                      .dwattr $C$DW$370, DW_AT_name("DMAIFR")
    4069                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DMAIFR")
    4070                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4071                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4072              $C$DW$371       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    4074                      .dwattr $C$DW$371, DW_AT_name("DMAIER")
    4075                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DMAIER")
    4076                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4077                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4078              $C$DW$372       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4080                      .dwattr $C$DW$372, DW_AT_name("USBSCR")
    4081                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_USBSCR")
    4082                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4083                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4084              $C$DW$373       .dwtag  DW_TAG_member
    4085                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    4086                      .dwattr $C$DW$373, DW_AT_name("ESCR")
    4087                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ESCR")
    4088                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4089                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4090              $C$DW$374       .dwtag  DW_TAG_member
    4091                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$25)
    4092                      .dwattr $C$DW$374, DW_AT_name("RSVD7")
    4093                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RSVD7")
    4094                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4095                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4096              $C$DW$375       .dwtag  DW_TAG_member
    4097                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    4098                      .dwattr $C$DW$375, DW_AT_name("DMA2CESR1")
    4099                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_DMA2CESR1")
    4100                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4101                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   87

    4102              $C$DW$376       .dwtag  DW_TAG_member
    4103                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    4104                      .dwattr $C$DW$376, DW_AT_name("DMA2CESR2")
    4105                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_DMA2CESR2")
    4106                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4107                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4108              $C$DW$377       .dwtag  DW_TAG_member
    4109                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4110                      .dwattr $C$DW$377, DW_AT_name("DMA3CESR1")
    4111                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_DMA3CESR1")
    4112                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4113                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4114              $C$DW$378       .dwtag  DW_TAG_member
    4115                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4116                      .dwattr $C$DW$378, DW_AT_name("DMA3CESR2")
    4117                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_DMA3CESR2")
    4118                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4119                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4120              $C$DW$379       .dwtag  DW_TAG_member
    4121                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    4122                      .dwattr $C$DW$379, DW_AT_name("CLKSTOP")
    4123                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_CLKSTOP")
    4124                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4125                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4126              $C$DW$380       .dwtag  DW_TAG_member
    4127                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$26)
    4128                      .dwattr $C$DW$380, DW_AT_name("RSVD8")
    4129                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_RSVD8")
    4130                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4131                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4132              $C$DW$381       .dwtag  DW_TAG_member
    4133                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    4134                      .dwattr $C$DW$381, DW_AT_name("DIEIDR0")
    4135                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_DIEIDR0")
    4136                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4137                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4138              $C$DW$382       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    4140                      .dwattr $C$DW$382, DW_AT_name("DIEIDR1")
    4141                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_DIEIDR1")
    4142                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4143                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4144              $C$DW$383       .dwtag  DW_TAG_member
    4145                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4146                      .dwattr $C$DW$383, DW_AT_name("DIEIDR2")
    4147                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_DIEIDR2")
    4148                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4149                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4150              $C$DW$384       .dwtag  DW_TAG_member
    4151                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4152                      .dwattr $C$DW$384, DW_AT_name("DIEIDR3")
    4153                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DIEIDR3")
    4154                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4155                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4156              $C$DW$385       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   88

    4157                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4158                      .dwattr $C$DW$385, DW_AT_name("DIEIDR4")
    4159                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DIEIDR4")
    4160                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4161                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4162              $C$DW$386       .dwtag  DW_TAG_member
    4163                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4164                      .dwattr $C$DW$386, DW_AT_name("DIEIDR5")
    4165                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DIEIDR5")
    4166                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4167                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4168              $C$DW$387       .dwtag  DW_TAG_member
    4169                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4170                      .dwattr $C$DW$387, DW_AT_name("DIEIDR6")
    4171                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DIEIDR6")
    4172                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4173                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4174              $C$DW$388       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    4176                      .dwattr $C$DW$388, DW_AT_name("DIEIDR7")
    4177                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DIEIDR7")
    4178                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4179                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4180                      .dwendtag $C$DW$T$27
    4181              
    4182              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4183                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4184                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4185              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    4186                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$31)
    4187              $C$DW$390       .dwtag  DW_TAG_TI_ioport_type
    4188                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$389)
    4189              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4190                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$390)
    4191              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4192                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4193                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4194              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4195                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4196                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4197              
    4198              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4199                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4200                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4201              $C$DW$391       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    4203                      .dwattr $C$DW$391, DW_AT_name("pllConfig")
    4204                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_pllConfig")
    4205                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4206                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4207              $C$DW$392       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$30)
    4209                      .dwattr $C$DW$392, DW_AT_name("instId")
    4210                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_instId")
    4211                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   89

    4212                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4213              $C$DW$393       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$34)
    4215                      .dwattr $C$DW$393, DW_AT_name("sysAddr")
    4216                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_sysAddr")
    4217                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4218                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4219                      .dwendtag $C$DW$T$35
    4220              
    4221              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4222                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4223                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4224              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4225                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4226                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4227              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4228                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4229                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4230              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4231                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4232                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4233              
    4234              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4235                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4236                      .dwattr $C$DW$T$19, DW_AT_declaration
    4237                      .dwendtag $C$DW$T$19
    4238              
    4239              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4240                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4241                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4242              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4243                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4244                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4245              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4246                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4247                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4248              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4249                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4250              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    4251                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$3)
    4252              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4253                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$394)
    4254              
    4255              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    4256                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4257              $C$DW$395       .dwtag  DW_TAG_formal_parameter
    4258                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
    4259                      .dwendtag $C$DW$T$51
    4260              
    4261              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    4262                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4263                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    4264              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4265                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4266                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 05:43:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   90

    4267              $C$DW$396       .dwtag  DW_TAG_TI_far_type
    4268              $C$DW$T$64      .dwtag  DW_TAG_const_type
    4269                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$396)
    4270              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4271                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4272                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
