TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4747              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 30 06:35:15 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3753              ;* FAR STRINGS                                                                 *
    3754              ;*******************************************************************************
    3755 000000               .sect   ".const:.string"
    3756                      .align  2
    3757 000000 0053  $C$FSL1:        .string "Start",0
         000001 0074 
         000002 0061 
         000003 0072 
         000004 0074 
         000005 0000 
    3758                      .align  2
    3759 000006 0042  $C$FSL2:        .string "BlueLED",0
         000007 006C 
         000008 0075 
         000009 0065 
         00000a 004C 
         00000b 0045 
         00000c 0044 
         00000d 0000 
    3760                      .align  2
    3761 00000e 0054  $C$FSL3:        .string "TestTsk1",0
         00000f 0065 
         000010 0073 
         000011 0074 
         000012 0054 
         000013 0073 
         000014 006B 
         000015 0031 
         000016 0000 
    3762                      .align  2
    3763 000018 0054  $C$FSL4:        .string "TestTsk2",0
         000019 0065 
         00001a 0073 
         00001b 0074 
         00001c 0054 
         00001d 0073 
         00001e 006B 
         00001f 0032 
         000020 0000 
    3764                      .align  2
    3765 000022 0054  $C$FSL5:        .string "TestTsk3",0
         000023 0065 
         000024 0073 
         000025 0074 
         000026 0054 
         000027 0073 
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   80

         000028 006B 
         000029 0033 
         00002a 0000 
    3766                      .align  2
    3767 00002c 0054  $C$FSL6:        .string "TestTsk4",0
         00002d 0065 
         00002e 0073 
         00002f 0074 
         000030 0054 
         000031 0073 
         000032 006B 
         000033 0034 
         000034 0000 
    3768                      .align  2
    3769 000036 0058  $C$FSL7:        .string "XFLEDtsk",0
         000037 0046 
         000038 004C 
         000039 0045 
         00003a 0044 
         00003b 0074 
         00003c 0073 
         00003d 006B 
         00003e 0000 
    3770                      .align  2
    3771 000040 0047  $C$FSL8:        .string "GRNLED",0
         000041 0052 
         000042 004E 
         000043 004C 
         000044 0045 
         000045 0044 
         000046 0000 
    3772                      .align  2
    3773 000048 0058  $C$FSL9:        .string "XFLDtsk2",0
         000049 0046 
         00004a 004C 
         00004b 0044 
         00004c 0074 
         00004d 0073 
         00004e 006B 
         00004f 0032 
         000050 0000 
    3774                      .align  2
    3775 000052 004C  $C$FSL10:       .string "LEDCTRL",0
         000053 0045 
         000054 0044 
         000055 0043 
         000056 0054 
         000057 0052 
         000058 004C 
         000059 0000 
    3776                      .align  2
    3777 00005a 0052  $C$FSL11:       .string "RedLED",0
         00005b 0065 
         00005c 0064 
         00005d 004C 
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   81

         00005e 0045 
         00005f 0044 
         000060 0000 
    3778              ;******************************************************************************
    3779              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3780              ;******************************************************************************
    3781                      .global _EZDSP5535_init
    3782                      .global _xTaskCreate
    3783                      .global _vTaskDelay
    3784                      .global _vTaskSuspend
    3785                      .global _vTaskResume
    3786                      .global _vTaskStartScheduler
    3787                      .global _xQueueGenericSend
    3788                      .global _xQueueSemaphoreTake
    3789                      .global _xQueueGenericCreate
    3790                      .global _set_dma0_ch0_i2s0_Lout
    3791                      .global _set_dma0_ch1_i2s0_Rout
    3792                      .global _set_dma0_ch0_stop
    3793                      .global _set_dma0_ch1_stop
    3794                      .global _EZDSP5535_LED_init
    3795                      .global _EZDSP5535_LED_on
    3796                      .global _EZDSP5535_XF_toggle
    3797                      .global _EZDSP5535_GPIO_init
    3798                      .global _EZDSP5535_GPIO_setOutput
    3799                      .global _EZDSP5535_SAR_init
    3800                      .global _PLL_init
    3801                      .global _PLL_config
    3802                      .global _PLL_reset
    3803                      .global _mem_test
    3804                      .global _fTimer
    3805                      .global _Flag_RTC
    3806                      .global _Conunt_RTC
    3807                      .global _VECSTART
    3808              
    3809              ;*******************************************************************************
    3810              ;* TYPE INFORMATION                                                            *
    3811              ;*******************************************************************************
    3812              
    3813              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3814                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3815              $C$DW$330       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    3817                      .dwattr $C$DW$330, DW_AT_name("PLLCNTL1")
    3818                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_PLLCNTL1")
    3819                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3820                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3821              $C$DW$331       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    3823                      .dwattr $C$DW$331, DW_AT_name("PLLINCNTL")
    3824                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_PLLINCNTL")
    3825                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3826                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$332       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    3829                      .dwattr $C$DW$332, DW_AT_name("PLLCNTL2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   82

    3830                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_PLLCNTL2")
    3831                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3832                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3833              $C$DW$333       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    3835                      .dwattr $C$DW$333, DW_AT_name("PLLOUTCNTL")
    3836                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    3837                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3838                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3839                      .dwendtag $C$DW$T$22
    3840              
    3841              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    3842                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    3843                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3844              $C$DW$334       .dwtag  DW_TAG_TI_far_type
    3845                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$28)
    3846              $C$DW$T$36      .dwtag  DW_TAG_const_type
    3847                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$334)
    3848              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3849                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3850                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    3851              
    3852              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3853                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    3854              $C$DW$335       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    3856                      .dwattr $C$DW$335, DW_AT_name("EBSR")
    3857                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_EBSR")
    3858                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3859                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$336       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
    3862                      .dwattr $C$DW$336, DW_AT_name("RSVD0")
    3863                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_RSVD0")
    3864                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3865                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$337       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3868                      .dwattr $C$DW$337, DW_AT_name("PCGCR1")
    3869                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_PCGCR1")
    3870                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3871                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$338       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3874                      .dwattr $C$DW$338, DW_AT_name("PCGCR2")
    3875                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_PCGCR2")
    3876                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3877                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3878              $C$DW$339       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    3880                      .dwattr $C$DW$339, DW_AT_name("PSRCR")
    3881                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_PSRCR")
    3882                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3883                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$340       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   83

    3885                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3886                      .dwattr $C$DW$340, DW_AT_name("PRCR")
    3887                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_PRCR")
    3888                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3889                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$341       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$24)
    3892                      .dwattr $C$DW$341, DW_AT_name("RSVD1")
    3893                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_RSVD1")
    3894                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3895                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3896              $C$DW$342       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    3898                      .dwattr $C$DW$342, DW_AT_name("TIAFR")
    3899                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_TIAFR")
    3900                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3901                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3902              $C$DW$343       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3904                      .dwattr $C$DW$343, DW_AT_name("RSVD2")
    3905                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD2")
    3906                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3907                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$344       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3910                      .dwattr $C$DW$344, DW_AT_name("ODSCR")
    3911                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_ODSCR")
    3912                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3913                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$345       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3916                      .dwattr $C$DW$345, DW_AT_name("PDINHIBR1")
    3917                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_PDINHIBR1")
    3918                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3919                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$346       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3922                      .dwattr $C$DW$346, DW_AT_name("PDINHIBR2")
    3923                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_PDINHIBR2")
    3924                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3925                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$347       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3928                      .dwattr $C$DW$347, DW_AT_name("PDINHIBR3")
    3929                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_PDINHIBR3")
    3930                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3931                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$348       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3934                      .dwattr $C$DW$348, DW_AT_name("DMA0CESR1")
    3935                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_DMA0CESR1")
    3936                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3937                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$349       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   84

    3940                      .dwattr $C$DW$349, DW_AT_name("DMA0CESR2")
    3941                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_DMA0CESR2")
    3942                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3943                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$350       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3946                      .dwattr $C$DW$350, DW_AT_name("DMA1CESR1")
    3947                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_DMA1CESR1")
    3948                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3949                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$351       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3952                      .dwattr $C$DW$351, DW_AT_name("DMA1CESR2")
    3953                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_DMA1CESR2")
    3954                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3955                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$352       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3958                      .dwattr $C$DW$352, DW_AT_name("SDRAMCCR")
    3959                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_SDRAMCCR")
    3960                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3961                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$353       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3964                      .dwattr $C$DW$353, DW_AT_name("CCR2")
    3965                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_CCR2")
    3966                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3967                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$354       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3970                      .dwattr $C$DW$354, DW_AT_name("CGCR1")
    3971                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_CGCR1")
    3972                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3973                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$355       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3976                      .dwattr $C$DW$355, DW_AT_name("CGICR")
    3977                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_CGICR")
    3978                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3979                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$356       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3982                      .dwattr $C$DW$356, DW_AT_name("CGCR2")
    3983                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_CGCR2")
    3984                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3985                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3986              $C$DW$357       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    3988                      .dwattr $C$DW$357, DW_AT_name("CGOCR")
    3989                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_CGOCR")
    3990                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3991                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$358       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3994                      .dwattr $C$DW$358, DW_AT_name("CCSSR")
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   85

    3995                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_CCSSR")
    3996                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3997                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$359       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    4000                      .dwattr $C$DW$359, DW_AT_name("RSVD3")
    4001                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_RSVD3")
    4002                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4003                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$360       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    4006                      .dwattr $C$DW$360, DW_AT_name("ECDR")
    4007                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ECDR")
    4008                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4009                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$361       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    4012                      .dwattr $C$DW$361, DW_AT_name("RSVD4")
    4013                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD4")
    4014                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4015                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$362       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    4018                      .dwattr $C$DW$362, DW_AT_name("RAMSLPMDCNTLR1")
    4019                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4020                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4021                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4022              $C$DW$363       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    4024                      .dwattr $C$DW$363, DW_AT_name("RSVD5")
    4025                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RSVD5")
    4026                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4027                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4028              $C$DW$364       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    4030                      .dwattr $C$DW$364, DW_AT_name("RAMSLPMDCNTLR2")
    4031                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4032                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4033                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4034              $C$DW$365       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    4036                      .dwattr $C$DW$365, DW_AT_name("RAMSLPMDCNTLR3")
    4037                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4038                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4039                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4040              $C$DW$366       .dwtag  DW_TAG_member
    4041                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    4042                      .dwattr $C$DW$366, DW_AT_name("RAMSLPMDCNTLR4")
    4043                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4044                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4045                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4046              $C$DW$367       .dwtag  DW_TAG_member
    4047                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    4048                      .dwattr $C$DW$367, DW_AT_name("RAMSLPMDCNTLR5")
    4049                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   86

    4050                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4051                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4052              $C$DW$368       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    4054                      .dwattr $C$DW$368, DW_AT_name("RSVD6")
    4055                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RSVD6")
    4056                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4057                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4058              $C$DW$369       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    4060                      .dwattr $C$DW$369, DW_AT_name("DMAIFR")
    4061                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_DMAIFR")
    4062                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4063                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4064              $C$DW$370       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    4066                      .dwattr $C$DW$370, DW_AT_name("DMAIER")
    4067                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DMAIER")
    4068                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4069                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4070              $C$DW$371       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    4072                      .dwattr $C$DW$371, DW_AT_name("USBSCR")
    4073                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_USBSCR")
    4074                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4075                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$372       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4078                      .dwattr $C$DW$372, DW_AT_name("ESCR")
    4079                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ESCR")
    4080                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4081                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$373       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    4084                      .dwattr $C$DW$373, DW_AT_name("RSVD7")
    4085                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RSVD7")
    4086                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4087                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4088              $C$DW$374       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    4090                      .dwattr $C$DW$374, DW_AT_name("DMA2CESR1")
    4091                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_DMA2CESR1")
    4092                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4093                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$375       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    4096                      .dwattr $C$DW$375, DW_AT_name("DMA2CESR2")
    4097                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_DMA2CESR2")
    4098                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4099                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4100              $C$DW$376       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    4102                      .dwattr $C$DW$376, DW_AT_name("DMA3CESR1")
    4103                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_DMA3CESR1")
    4104                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   87

    4105                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4106              $C$DW$377       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4108                      .dwattr $C$DW$377, DW_AT_name("DMA3CESR2")
    4109                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_DMA3CESR2")
    4110                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4111                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$378       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4114                      .dwattr $C$DW$378, DW_AT_name("CLKSTOP")
    4115                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_CLKSTOP")
    4116                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4117                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$379       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    4120                      .dwattr $C$DW$379, DW_AT_name("RSVD8")
    4121                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RSVD8")
    4122                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4123                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$380       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    4126                      .dwattr $C$DW$380, DW_AT_name("DIEIDR0")
    4127                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_DIEIDR0")
    4128                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4129                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$381       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    4132                      .dwattr $C$DW$381, DW_AT_name("DIEIDR1")
    4133                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_DIEIDR1")
    4134                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4135                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$382       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    4138                      .dwattr $C$DW$382, DW_AT_name("DIEIDR2")
    4139                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_DIEIDR2")
    4140                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4141                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$383       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4144                      .dwattr $C$DW$383, DW_AT_name("DIEIDR3")
    4145                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_DIEIDR3")
    4146                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4147                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$384       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4150                      .dwattr $C$DW$384, DW_AT_name("DIEIDR4")
    4151                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DIEIDR4")
    4152                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4153                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$385       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4156                      .dwattr $C$DW$385, DW_AT_name("DIEIDR5")
    4157                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DIEIDR5")
    4158                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4159                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   88

    4160              $C$DW$386       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4162                      .dwattr $C$DW$386, DW_AT_name("DIEIDR6")
    4163                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DIEIDR6")
    4164                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4165                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$387       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4168                      .dwattr $C$DW$387, DW_AT_name("DIEIDR7")
    4169                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DIEIDR7")
    4170                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4171                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4172                      .dwendtag $C$DW$T$27
    4173              
    4174              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4175                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4176                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4177              $C$DW$388       .dwtag  DW_TAG_TI_far_type
    4178                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$31)
    4179              $C$DW$389       .dwtag  DW_TAG_TI_ioport_type
    4180                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$388)
    4181              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4182                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$389)
    4183              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4184                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4185                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4186              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4187                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4188                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4189              
    4190              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4191                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4192                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4193              $C$DW$390       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    4195                      .dwattr $C$DW$390, DW_AT_name("pllConfig")
    4196                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_pllConfig")
    4197                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4198                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$391       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$30)
    4201                      .dwattr $C$DW$391, DW_AT_name("instId")
    4202                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_instId")
    4203                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4204                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$392       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$34)
    4207                      .dwattr $C$DW$392, DW_AT_name("sysAddr")
    4208                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_sysAddr")
    4209                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4210                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4211                      .dwendtag $C$DW$T$35
    4212              
    4213              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4214                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
TMS320C55x Assembler PC v4.4.1 Sun Sep 30 06:35:16 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   89

    4215                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4216              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4217                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4218                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4219              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4220                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4221                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4222              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4223                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4224                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4225              
    4226              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4227                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4228                      .dwattr $C$DW$T$19, DW_AT_declaration
    4229                      .dwendtag $C$DW$T$19
    4230              
    4231              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4232                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4233                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4234              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4235                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4236                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4237              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4238                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4239                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4240              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4241                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4242              $C$DW$393       .dwtag  DW_TAG_TI_far_type
    4243                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$3)
    4244              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4245                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$393)
    4246              
    4247              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    4248                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4249              $C$DW$394       .dwtag  DW_TAG_formal_parameter
    4250                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$3)
    4251                      .dwendtag $C$DW$T$51
    4252              
    4253              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    4254                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4255                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    4256              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4257                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4258                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4259              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    4260              $C$DW$T$64      .dwtag  DW_TAG_const_type
    4261                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$395)
    4262              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4263                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4264                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
