TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4763              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Oct 07 10:05:05 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3772                      .align  2
    3773 000000 0053  $C$FSL1:        .string "Start",0
         000001 0074 
         000002 0061 
         000003 0072 
         000004 0074 
         000005 0000 
    3774                      .align  2
    3775 000006 0042  $C$FSL2:        .string "BlueLED",0
         000007 006C 
         000008 0075 
         000009 0065 
         00000a 004C 
         00000b 0045 
         00000c 0044 
         00000d 0000 
    3776                      .align  2
    3777 00000e 0054  $C$FSL3:        .string "TestTsk1",0
         00000f 0065 
         000010 0073 
         000011 0074 
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   80

         000012 0054 
         000013 0073 
         000014 006B 
         000015 0031 
         000016 0000 
    3778                      .align  2
    3779 000018 0054  $C$FSL4:        .string "TestTsk2",0
         000019 0065 
         00001a 0073 
         00001b 0074 
         00001c 0054 
         00001d 0073 
         00001e 006B 
         00001f 0032 
         000020 0000 
    3780                      .align  2
    3781 000022 0054  $C$FSL5:        .string "TestTsk3",0
         000023 0065 
         000024 0073 
         000025 0074 
         000026 0054 
         000027 0073 
         000028 006B 
         000029 0033 
         00002a 0000 
    3782                      .align  2
    3783 00002c 0054  $C$FSL6:        .string "TestTsk4",0
         00002d 0065 
         00002e 0073 
         00002f 0074 
         000030 0054 
         000031 0073 
         000032 006B 
         000033 0034 
         000034 0000 
    3784                      .align  2
    3785 000036 0058  $C$FSL7:        .string "XFLEDtsk",0
         000037 0046 
         000038 004C 
         000039 0045 
         00003a 0044 
         00003b 0074 
         00003c 0073 
         00003d 006B 
         00003e 0000 
    3786                      .align  2
    3787 000040 0047  $C$FSL8:        .string "GRNLED",0
         000041 0052 
         000042 004E 
         000043 004C 
         000044 0045 
         000045 0044 
         000046 0000 
    3788                      .align  2
    3789 000048 0058  $C$FSL9:        .string "XFLDtsk2",0
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   81

         000049 0046 
         00004a 004C 
         00004b 0044 
         00004c 0074 
         00004d 0073 
         00004e 006B 
         00004f 0032 
         000050 0000 
    3790                      .align  2
    3791 000052 004C  $C$FSL10:       .string "LEDCTRL",0
         000053 0045 
         000054 0044 
         000055 0043 
         000056 0054 
         000057 0052 
         000058 004C 
         000059 0000 
    3792                      .align  2
    3793 00005a 0052  $C$FSL11:       .string "RedLED",0
         00005b 0065 
         00005c 0064 
         00005d 004C 
         00005e 0045 
         00005f 0044 
         000060 0000 
    3794              ;******************************************************************************
    3795              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3796              ;******************************************************************************
    3797                      .global _EZDSP5535_init
    3798                      .global _xTaskCreate
    3799                      .global _vTaskDelay
    3800                      .global _vTaskSuspend
    3801                      .global _vTaskResume
    3802                      .global _vTaskStartScheduler
    3803                      .global _xQueueGenericSend
    3804                      .global _xQueueSemaphoreTake
    3805                      .global _xQueueGenericCreate
    3806                      .global _set_dma0_ch0_i2s0_Lout
    3807                      .global _set_dma0_ch1_i2s0_Rout
    3808                      .global _set_dma0_ch0_stop
    3809                      .global _set_dma0_ch1_stop
    3810                      .global _EZDSP5535_LED_init
    3811                      .global _EZDSP5535_LED_on
    3812                      .global _EZDSP5535_XF_toggle
    3813                      .global _EZDSP5535_GPIO_init
    3814                      .global _EZDSP5535_GPIO_setOutput
    3815                      .global _EZDSP5535_SAR_init
    3816                      .global _PLL_init
    3817                      .global _PLL_config
    3818                      .global _PLL_reset
    3819                      .global _mem_test
    3820                      .global _fTimer
    3821                      .global _Flag_RTC
    3822                      .global _Conunt_RTC
    3823                      .global _VECSTART
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   82

    3824              
    3825              ;*******************************************************************************
    3826              ;* TYPE INFORMATION                                                            *
    3827              ;*******************************************************************************
    3828              
    3829              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3830                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3831              $C$DW$332       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    3833                      .dwattr $C$DW$332, DW_AT_name("PLLCNTL1")
    3834                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_PLLCNTL1")
    3835                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3836                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$333       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    3839                      .dwattr $C$DW$333, DW_AT_name("PLLINCNTL")
    3840                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PLLINCNTL")
    3841                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3842                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$334       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    3845                      .dwattr $C$DW$334, DW_AT_name("PLLCNTL2")
    3846                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_PLLCNTL2")
    3847                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3848                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$335       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    3851                      .dwattr $C$DW$335, DW_AT_name("PLLOUTCNTL")
    3852                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    3853                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3854                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3855                      .dwendtag $C$DW$T$22
    3856              
    3857              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    3858                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    3859                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3860              $C$DW$336       .dwtag  DW_TAG_TI_far_type
    3861                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$28)
    3862              $C$DW$T$36      .dwtag  DW_TAG_const_type
    3863                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$336)
    3864              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3865                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3866                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    3867              
    3868              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3869                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    3870              $C$DW$337       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3872                      .dwattr $C$DW$337, DW_AT_name("EBSR")
    3873                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_EBSR")
    3874                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3875                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$338       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3878                      .dwattr $C$DW$338, DW_AT_name("RSVD0")
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   83

    3879                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD0")
    3880                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3881                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$339       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    3884                      .dwattr $C$DW$339, DW_AT_name("PCGCR1")
    3885                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_PCGCR1")
    3886                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3887                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$340       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3890                      .dwattr $C$DW$340, DW_AT_name("PCGCR2")
    3891                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_PCGCR2")
    3892                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3893                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$341       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    3896                      .dwattr $C$DW$341, DW_AT_name("PSRCR")
    3897                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_PSRCR")
    3898                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3899                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3900              $C$DW$342       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    3902                      .dwattr $C$DW$342, DW_AT_name("PRCR")
    3903                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_PRCR")
    3904                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3905                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3906              $C$DW$343       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$24)
    3908                      .dwattr $C$DW$343, DW_AT_name("RSVD1")
    3909                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD1")
    3910                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3911                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$344       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3914                      .dwattr $C$DW$344, DW_AT_name("TIAFR")
    3915                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_TIAFR")
    3916                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3917                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$345       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3920                      .dwattr $C$DW$345, DW_AT_name("RSVD2")
    3921                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_RSVD2")
    3922                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3923                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$346       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3926                      .dwattr $C$DW$346, DW_AT_name("ODSCR")
    3927                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ODSCR")
    3928                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3929                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$347       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3932                      .dwattr $C$DW$347, DW_AT_name("PDINHIBR1")
    3933                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_PDINHIBR1")
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   84

    3934                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3935                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$348       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3938                      .dwattr $C$DW$348, DW_AT_name("PDINHIBR2")
    3939                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_PDINHIBR2")
    3940                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3941                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$349       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3944                      .dwattr $C$DW$349, DW_AT_name("PDINHIBR3")
    3945                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_PDINHIBR3")
    3946                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3947                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$350       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3950                      .dwattr $C$DW$350, DW_AT_name("DMA0CESR1")
    3951                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_DMA0CESR1")
    3952                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3953                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$351       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3956                      .dwattr $C$DW$351, DW_AT_name("DMA0CESR2")
    3957                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_DMA0CESR2")
    3958                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3959                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$352       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3962                      .dwattr $C$DW$352, DW_AT_name("DMA1CESR1")
    3963                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_DMA1CESR1")
    3964                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3965                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$353       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3968                      .dwattr $C$DW$353, DW_AT_name("DMA1CESR2")
    3969                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_DMA1CESR2")
    3970                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3971                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$354       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3974                      .dwattr $C$DW$354, DW_AT_name("SDRAMCCR")
    3975                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_SDRAMCCR")
    3976                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3977                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$355       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3980                      .dwattr $C$DW$355, DW_AT_name("CCR2")
    3981                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_CCR2")
    3982                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3983                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$356       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3986                      .dwattr $C$DW$356, DW_AT_name("CGCR1")
    3987                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_CGCR1")
    3988                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   85

    3989                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$357       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    3992                      .dwattr $C$DW$357, DW_AT_name("CGICR")
    3993                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_CGICR")
    3994                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3995                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$358       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3998                      .dwattr $C$DW$358, DW_AT_name("CGCR2")
    3999                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_CGCR2")
    4000                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4001                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$359       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    4004                      .dwattr $C$DW$359, DW_AT_name("CGOCR")
    4005                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_CGOCR")
    4006                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4007                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$360       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    4010                      .dwattr $C$DW$360, DW_AT_name("CCSSR")
    4011                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_CCSSR")
    4012                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4013                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$361       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    4016                      .dwattr $C$DW$361, DW_AT_name("RSVD3")
    4017                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD3")
    4018                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4019                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$362       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    4022                      .dwattr $C$DW$362, DW_AT_name("ECDR")
    4023                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ECDR")
    4024                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4025                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$363       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    4028                      .dwattr $C$DW$363, DW_AT_name("RSVD4")
    4029                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RSVD4")
    4030                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4031                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$364       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    4034                      .dwattr $C$DW$364, DW_AT_name("RAMSLPMDCNTLR1")
    4035                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4036                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4037                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$365       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    4040                      .dwattr $C$DW$365, DW_AT_name("RSVD5")
    4041                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RSVD5")
    4042                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4043                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   86

    4044              $C$DW$366       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    4046                      .dwattr $C$DW$366, DW_AT_name("RAMSLPMDCNTLR2")
    4047                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4048                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4049                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$367       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    4052                      .dwattr $C$DW$367, DW_AT_name("RAMSLPMDCNTLR3")
    4053                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4054                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4055                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$368       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    4058                      .dwattr $C$DW$368, DW_AT_name("RAMSLPMDCNTLR4")
    4059                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4060                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4061                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$369       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    4064                      .dwattr $C$DW$369, DW_AT_name("RAMSLPMDCNTLR5")
    4065                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4066                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4067                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$370       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    4070                      .dwattr $C$DW$370, DW_AT_name("RSVD6")
    4071                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_RSVD6")
    4072                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4073                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$371       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    4076                      .dwattr $C$DW$371, DW_AT_name("DMAIFR")
    4077                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DMAIFR")
    4078                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4079                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$372       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4082                      .dwattr $C$DW$372, DW_AT_name("DMAIER")
    4083                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DMAIER")
    4084                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4085                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$373       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    4088                      .dwattr $C$DW$373, DW_AT_name("USBSCR")
    4089                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_USBSCR")
    4090                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4091                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$374       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    4094                      .dwattr $C$DW$374, DW_AT_name("ESCR")
    4095                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ESCR")
    4096                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4097                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$375       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   87

    4099                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$25)
    4100                      .dwattr $C$DW$375, DW_AT_name("RSVD7")
    4101                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RSVD7")
    4102                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4103                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$376       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    4106                      .dwattr $C$DW$376, DW_AT_name("DMA2CESR1")
    4107                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_DMA2CESR1")
    4108                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4109                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$377       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4112                      .dwattr $C$DW$377, DW_AT_name("DMA2CESR2")
    4113                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_DMA2CESR2")
    4114                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4115                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$378       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4118                      .dwattr $C$DW$378, DW_AT_name("DMA3CESR1")
    4119                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_DMA3CESR1")
    4120                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4121                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$379       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    4124                      .dwattr $C$DW$379, DW_AT_name("DMA3CESR2")
    4125                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_DMA3CESR2")
    4126                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4127                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$380       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    4130                      .dwattr $C$DW$380, DW_AT_name("CLKSTOP")
    4131                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_CLKSTOP")
    4132                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4133                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$381       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$26)
    4136                      .dwattr $C$DW$381, DW_AT_name("RSVD8")
    4137                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD8")
    4138                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4139                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$382       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    4142                      .dwattr $C$DW$382, DW_AT_name("DIEIDR0")
    4143                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_DIEIDR0")
    4144                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4145                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$383       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4148                      .dwattr $C$DW$383, DW_AT_name("DIEIDR1")
    4149                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_DIEIDR1")
    4150                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4151                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$384       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   88

    4154                      .dwattr $C$DW$384, DW_AT_name("DIEIDR2")
    4155                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DIEIDR2")
    4156                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4157                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$385       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4160                      .dwattr $C$DW$385, DW_AT_name("DIEIDR3")
    4161                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DIEIDR3")
    4162                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4163                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$386       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4166                      .dwattr $C$DW$386, DW_AT_name("DIEIDR4")
    4167                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DIEIDR4")
    4168                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4169                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$387       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4172                      .dwattr $C$DW$387, DW_AT_name("DIEIDR5")
    4173                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DIEIDR5")
    4174                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4175                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$388       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    4178                      .dwattr $C$DW$388, DW_AT_name("DIEIDR6")
    4179                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DIEIDR6")
    4180                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4181                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$389       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    4184                      .dwattr $C$DW$389, DW_AT_name("DIEIDR7")
    4185                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_DIEIDR7")
    4186                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4187                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4188                      .dwendtag $C$DW$T$27
    4189              
    4190              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4191                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4192                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4193              $C$DW$390       .dwtag  DW_TAG_TI_far_type
    4194                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$31)
    4195              $C$DW$391       .dwtag  DW_TAG_TI_ioport_type
    4196                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$390)
    4197              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4198                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$391)
    4199              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4200                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4201                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4202              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4203                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4204                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4205              
    4206              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4207                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4208                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   89

    4209              $C$DW$392       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    4211                      .dwattr $C$DW$392, DW_AT_name("pllConfig")
    4212                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_pllConfig")
    4213                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4214                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$393       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$30)
    4217                      .dwattr $C$DW$393, DW_AT_name("instId")
    4218                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_instId")
    4219                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4220                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$394       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$34)
    4223                      .dwattr $C$DW$394, DW_AT_name("sysAddr")
    4224                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_sysAddr")
    4225                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4226                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4227                      .dwendtag $C$DW$T$35
    4228              
    4229              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4230                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4231                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4232              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4233                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4234                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4235              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4236                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4237                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4238              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4239                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4240                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4241              
    4242              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4243                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4244                      .dwattr $C$DW$T$19, DW_AT_declaration
    4245                      .dwendtag $C$DW$T$19
    4246              
    4247              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4248                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4249                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4250              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4251                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4252                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4253              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4254                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4255                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4256              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4257                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4258              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    4259                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
    4260              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4261                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$395)
    4262              
    4263              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
TMS320C55x Assembler PC v4.4.1 Sun Oct 07 10:05:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   90

    4264                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4265              $C$DW$396       .dwtag  DW_TAG_formal_parameter
    4266                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$3)
    4267                      .dwendtag $C$DW$T$51
    4268              
    4269              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    4270                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4271                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    4272              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4273                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4274                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4275              $C$DW$397       .dwtag  DW_TAG_TI_far_type
    4276              $C$DW$T$64      .dwtag  DW_TAG_const_type
    4277                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$397)
    4278              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4279                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4280                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
