TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE    1

    1409              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:34 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         00003f 0043 
         000040 004B 
         000041 0020 
         000042 0054 
         000043 0045 
         000044 0053 
         000045 0054 
         000046 0020 
         000047 0046 
         000048 0041 
         000049 0049 
         00004a 004C 
         00004b 0045 
         00004c 0044 
         00004d 0021 
         00004e 0021 
         00004f 000A 
         000050 0000 
     597                      .align  2
     598 000052 0049  $C$FSL4:        .string "I2C Init Failed!!",10,0
         000053 0032 
         000054 0043 
         000055 0020 
         000056 0049 
         000057 006E 
         000058 0069 
         000059 0074 
         00005a 0020 
         00005b 0046 
         00005c 0061 
         00005d 0069 
         00005e 006C 
         00005f 0065 
         000060 0064 
         000061 0021 
         000062 0021 
         000063 000A 
         000064 0000 
     599                      .align  2
     600 000066 0049  $C$FSL5:        .string "I2C Config Failed!!",10,0
         000067 0032 
         000068 0043 
         000069 0020 
         00006a 0043 
         00006b 006F 
         00006c 006E 
         00006d 0066 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   16

         00006e 0069 
         00006f 0067 
         000070 0020 
         000071 0046 
         000072 0061 
         000073 0069 
         000074 006C 
         000075 0065 
         000076 0064 
         000077 0021 
         000078 0021 
         000079 000A 
         00007a 0000 
     601                      .align  2
     602 00007c 0049  $C$FSL6:        .string "I2C Loopback Data Write and Read Complete",10,0
         00007d 0032 
         00007e 0043 
         00007f 0020 
         000080 004C 
         000081 006F 
         000082 006F 
         000083 0070 
         000084 0062 
         000085 0061 
         000086 0063 
         000087 006B 
         000088 0020 
         000089 0044 
         00008a 0061 
         00008b 0074 
         00008c 0061 
         00008d 0020 
         00008e 0057 
         00008f 0072 
         000090 0069 
         000091 0074 
         000092 0065 
         000093 0020 
         000094 0061 
         000095 006E 
         000096 0064 
         000097 0020 
         000098 0052 
         000099 0065 
         00009a 0061 
         00009b 0064 
         00009c 0020 
         00009d 0043 
         00009e 006F 
         00009f 006D 
         0000a0 0070 
         0000a1 006C 
         0000a2 0065 
         0000a3 0074 
         0000a4 0065 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   17

         0000a5 000A 
         0000a6 0000 
     603                      .align  2
     604 0000a8 0052  $C$FSL7:        .string "Read Write Buffers Does not Match!!",10,0
         0000a9 0065 
         0000aa 0061 
         0000ab 0064 
         0000ac 0020 
         0000ad 0057 
         0000ae 0072 
         0000af 0069 
         0000b0 0074 
         0000b1 0065 
         0000b2 0020 
         0000b3 0042 
         0000b4 0075 
         0000b5 0066 
         0000b6 0066 
         0000b7 0065 
         0000b8 0072 
         0000b9 0073 
         0000ba 0020 
         0000bb 0044 
         0000bc 006F 
         0000bd 0065 
         0000be 0073 
         0000bf 0020 
         0000c0 006E 
         0000c1 006F 
         0000c2 0074 
         0000c3 0020 
         0000c4 004D 
         0000c5 0061 
         0000c6 0074 
         0000c7 0063 
         0000c8 0068 
         0000c9 0021 
         0000ca 0021 
         0000cb 000A 
         0000cc 0000 
     605                      .align  2
     606 0000ce 0052  $C$FSL8:        .string "Read Write Buffers Match!!",10,0
         0000cf 0065 
         0000d0 0061 
         0000d1 0064 
         0000d2 0020 
         0000d3 0057 
         0000d4 0072 
         0000d5 0069 
         0000d6 0074 
         0000d7 0065 
         0000d8 0020 
         0000d9 0042 
         0000da 0075 
         0000db 0066 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   18

         0000dc 0066 
         0000dd 0065 
         0000de 0072 
         0000df 0073 
         0000e0 0020 
         0000e1 004D 
         0000e2 0061 
         0000e3 0074 
         0000e4 0063 
         0000e5 0068 
         0000e6 0021 
         0000e7 0021 
         0000e8 000A 
         0000e9 0000 
     607              ;******************************************************************************
     608              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     609              ;******************************************************************************
     610                      .global _I2C_init
     611                      .global _I2C_config
     612                      .global _printf
     613              
     614              ;*******************************************************************************
     615              ;* TYPE INFORMATION                                                            *
     616              ;*******************************************************************************
     617              
     618              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     619                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x39)
     620              $C$DW$44        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     622                      .dwattr $C$DW$44, DW_AT_name("ICOAR")
     623                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ICOAR")
     624                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$45        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     628                      .dwattr $C$DW$45, DW_AT_name("RSVD0")
     629                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_RSVD0")
     630                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     631                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     632              $C$DW$46        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     634                      .dwattr $C$DW$46, DW_AT_name("ICIMR")
     635                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_ICIMR")
     636                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     637                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$47        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     640                      .dwattr $C$DW$47, DW_AT_name("RSVD1")
     641                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_RSVD1")
     642                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     643                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     644              $C$DW$48        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     646                      .dwattr $C$DW$48, DW_AT_name("ICSTR")
     647                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ICSTR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   19

     648                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     649                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     650              $C$DW$49        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     652                      .dwattr $C$DW$49, DW_AT_name("RSVD2")
     653                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_RSVD2")
     654                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     655                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     656              $C$DW$50        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     658                      .dwattr $C$DW$50, DW_AT_name("ICCLKL")
     659                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ICCLKL")
     660                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     661                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     662              $C$DW$51        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     664                      .dwattr $C$DW$51, DW_AT_name("RSVD3")
     665                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_RSVD3")
     666                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     667                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$52        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     670                      .dwattr $C$DW$52, DW_AT_name("ICCLKH")
     671                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ICCLKH")
     672                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     673                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     674              $C$DW$53        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     676                      .dwattr $C$DW$53, DW_AT_name("RSVD4")
     677                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_RSVD4")
     678                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     679                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     680              $C$DW$54        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     682                      .dwattr $C$DW$54, DW_AT_name("ICCNT")
     683                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ICCNT")
     684                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     685                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     686              $C$DW$55        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     688                      .dwattr $C$DW$55, DW_AT_name("RSVD5")
     689                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RSVD5")
     690                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     691                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$56        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     694                      .dwattr $C$DW$56, DW_AT_name("ICDRR")
     695                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ICDRR")
     696                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     697                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$57        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     700                      .dwattr $C$DW$57, DW_AT_name("RSVD6")
     701                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_RSVD6")
     702                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   20

     703                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$58        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     706                      .dwattr $C$DW$58, DW_AT_name("ICSAR")
     707                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ICSAR")
     708                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     709                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$59        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     712                      .dwattr $C$DW$59, DW_AT_name("RSVD7")
     713                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_RSVD7")
     714                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     715                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     716              $C$DW$60        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     718                      .dwattr $C$DW$60, DW_AT_name("ICDXR")
     719                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_ICDXR")
     720                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     721                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     722              $C$DW$61        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     724                      .dwattr $C$DW$61, DW_AT_name("RSVD8")
     725                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_RSVD8")
     726                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     727                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     728              $C$DW$62        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     730                      .dwattr $C$DW$62, DW_AT_name("ICMDR")
     731                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_ICMDR")
     732                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     733                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$63        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     736                      .dwattr $C$DW$63, DW_AT_name("RSVD9")
     737                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_RSVD9")
     738                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     739                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$64        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     742                      .dwattr $C$DW$64, DW_AT_name("ICIVR")
     743                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_ICIVR")
     744                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     745                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$65        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     748                      .dwattr $C$DW$65, DW_AT_name("RSVD10")
     749                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD10")
     750                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     751                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$66        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     754                      .dwattr $C$DW$66, DW_AT_name("ICEMDR")
     755                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_ICEMDR")
     756                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     757                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   21

     758              $C$DW$67        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     760                      .dwattr $C$DW$67, DW_AT_name("RSVD11")
     761                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_RSVD11")
     762                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
     763                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     764              $C$DW$68        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     766                      .dwattr $C$DW$68, DW_AT_name("ICPSC")
     767                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_ICPSC")
     768                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     769                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$69        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     772                      .dwattr $C$DW$69, DW_AT_name("RSVD12")
     773                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_RSVD12")
     774                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
     775                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     776              $C$DW$70        .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
     778                      .dwattr $C$DW$70, DW_AT_name("ICPID1")
     779                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ICPID1")
     780                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     781                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$71        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     784                      .dwattr $C$DW$71, DW_AT_name("RSVD13")
     785                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_RSVD13")
     786                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
     787                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     788              $C$DW$72        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
     790                      .dwattr $C$DW$72, DW_AT_name("ICPID2")
     791                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_ICPID2")
     792                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     793                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     794                      .dwendtag $C$DW$T$22
     795              
     796              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
     797                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$22)
     798                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     799              $C$DW$73        .dwtag  DW_TAG_TI_far_type
     800                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$36)
     801              $C$DW$74        .dwtag  DW_TAG_TI_ioport_type
     802                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$73)
     803              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
     804                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$74)
     805              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
     806                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
     807                      .dwattr $C$DW$T$38, DW_AT_address_class(0x10)
     808              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
     809                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
     810                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     811              
     812              $C$DW$T$24      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   22

     813                      .dwattr $C$DW$T$24, DW_AT_name("CSL_I2cAddrMode")
     814                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     815              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
     816              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
     817                      .dwendtag $C$DW$T$24
     818              
     819              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
     820                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     821                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     822              
     823              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
     824                      .dwattr $C$DW$T$26, DW_AT_name("CSL_I2cBitCount")
     825                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     826              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
     827              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
     828              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
     829              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
     830              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
     831              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
     832              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
     833              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
     834                      .dwendtag $C$DW$T$26
     835              
     836              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
     837                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     838                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     839              
     840              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     841                      .dwattr $C$DW$T$23, DW_AT_name("CSL_I2cConfig")
     842                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x09)
     843              $C$DW$85        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$85, DW_AT_name("icoar")
     846                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_icoar")
     847                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     848                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$86        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$86, DW_AT_name("icimr")
     852                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_icimr")
     853                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     854                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$87        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$87, DW_AT_name("icclkl")
     858                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_icclkl")
     859                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     860                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$88        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$88, DW_AT_name("icclkh")
     864                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_icclkh")
     865                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     866                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$89        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   23

     868                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$89, DW_AT_name("iccnt")
     870                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_iccnt")
     871                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     872                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$90        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$90, DW_AT_name("icsar")
     876                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_icsar")
     877                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     878                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$91        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$91, DW_AT_name("icmdr")
     882                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_icmdr")
     883                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     884                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     885              $C$DW$92        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$92, DW_AT_name("icemdr")
     888                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_icemdr")
     889                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     890                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$93        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$93, DW_AT_name("icpsc")
     894                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_icpsc")
     895                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     896                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     897                      .dwendtag $C$DW$T$23
     898              
     899              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
     900                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$23)
     901                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     902              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
     903                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     904                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
     905              
     906              $C$DW$T$30      .dwtag  DW_TAG_enumeration_type
     907                      .dwattr $C$DW$T$30, DW_AT_name("CSL_I2cFreeMode")
     908                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     909              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
     910              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
     911                      .dwendtag $C$DW$T$30
     912              
     913              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
     914                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     915                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     916              
     917              $C$DW$T$28      .dwtag  DW_TAG_enumeration_type
     918                      .dwattr $C$DW$T$28, DW_AT_name("CSL_I2cLoopback")
     919                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     920              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
     921              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
     922                      .dwendtag $C$DW$T$28
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   24

     923              
     924              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
     925                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
     926                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     927              
     928              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
     929                      .dwattr $C$DW$T$32, DW_AT_name("CSL_I2cRepeatMode")
     930                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     931              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
     932              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
     933                      .dwendtag $C$DW$T$32
     934              
     935              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
     936                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     937                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     938              
     939              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     940                      .dwattr $C$DW$T$35, DW_AT_name("CSL_I2cSetup")
     941                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
     942              $C$DW$100       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
     944                      .dwattr $C$DW$100, DW_AT_name("addrMode")
     945                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_addrMode")
     946                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$101       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$27)
     950                      .dwattr $C$DW$101, DW_AT_name("bitCount")
     951                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bitCount")
     952                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     953                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$102       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
     956                      .dwattr $C$DW$102, DW_AT_name("loopBack")
     957                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_loopBack")
     958                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     959                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$103       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$31)
     962                      .dwattr $C$DW$103, DW_AT_name("freeMode")
     963                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_freeMode")
     964                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     965                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$104       .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$33)
     968                      .dwattr $C$DW$104, DW_AT_name("repeatMode")
     969                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_repeatMode")
     970                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     971                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     972              $C$DW$105       .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$105, DW_AT_name("ownAddr")
     975                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ownAddr")
     976                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     977                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   25

     978              $C$DW$106       .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$34)
     980                      .dwattr $C$DW$106, DW_AT_name("sysInputClk")
     981                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_sysInputClk")
     982                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     983                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     984              $C$DW$107       .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$34)
     986                      .dwattr $C$DW$107, DW_AT_name("i2cBusFreq")
     987                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_i2cBusFreq")
     988                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     989                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     990                      .dwendtag $C$DW$T$35
     991              
     992              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
     993                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$35)
     994                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     995              $C$DW$T$4       .dwtag  DW_TAG_base_type
     996                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     997                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     998                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     999              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1000                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1001                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1002                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1003              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1004                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1005                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1006                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1007              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1008                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1009                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1010                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1011              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1012                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1013                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1014                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1015              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1016                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
    1017                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1018              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1019                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1020                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1021              $C$DW$108       .dwtag  DW_TAG_TI_far_type
    1022                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$44)
    1023              $C$DW$T$52      .dwtag  DW_TAG_volatile_type
    1024                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$108)
    1025              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1026                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1027                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1028                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1029              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1030                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1031                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1032              $C$DW$109       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_loopback_example.asm                                         PAGE   26

    1033                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1034              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1035                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$109)
    1036              
    1037              $C$DW$T$21      .dwtag  DW_TAG_array_type
    1038                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1039                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1040                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x03)
