TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE    1

    2079              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:45 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1393              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_MAX_WORD_LEN"), DW_AT_const_value(0x20)
    1394                      .dwendtag $C$DW$T$25
    1395              
    1396              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordLen")
    1397                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1398                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1399              
    1400              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1401                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1402              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1403              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_ENABLE"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE   38

    1404                      .dwendtag $C$DW$T$27
    1405              
    1406              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordCntEnb")
    1407                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1408                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1409              
    1410              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    1411                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1412              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1413              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1414                      .dwendtag $C$DW$T$29
    1415              
    1416              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FrameCntEnb")
    1417                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1418                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1419              
    1420              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1421                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1422              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_0"), DW_AT_const_value(0x00)
    1423              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_1"), DW_AT_const_value(0x01)
    1424              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_2"), DW_AT_const_value(0x02)
    1425              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_3"), DW_AT_const_value(0x03)
    1426              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_UNKNOWN"), DW_AT_const_value(0x04)
    1427                      .dwendtag $C$DW$T$31
    1428              
    1429              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_DataDly")
    1430                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1431                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1432              
    1433              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1434                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1435              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_LOW_AT_IDLE"), DW_AT_const_value(0x00)
    1436              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_HIGH_AT_IDLE"), DW_AT_const_value(0x01)
    1437                      .dwendtag $C$DW$T$33
    1438              
    1439              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity")
    1440                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1441                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1442              
    1443              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1444                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1445              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_LOW"), DW_AT_const_value(0x00)
    1446              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_HIGH"), DW_AT_const_value(0x01)
    1447                      .dwendtag $C$DW$T$35
    1448              
    1449              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ChipSelPol")
    1450                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1451                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1452              
    1453              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1454                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1455              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_FALL_EDGE"), DW_AT_const_value(0x00)
    1456              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_RISE_EDGE"), DW_AT_const_value(0x01)
    1457                      .dwendtag $C$DW$T$37
    1458              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE   39

    1459              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPh")
    1460                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1461                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1462              
    1463              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1464                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1465              $C$DW$149       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$149, DW_AT_name("configured")
    1468                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_configured")
    1469                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$150       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1473                      .dwattr $C$DW$150, DW_AT_name("mode")
    1474                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_mode")
    1475                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1476                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$151       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    1479                      .dwattr $C$DW$151, DW_AT_name("opMode")
    1480                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_opMode")
    1481                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1482                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1483                      .dwendtag $C$DW$T$24
    1484              
    1485              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiObj")
    1486                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    1487                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1488              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    1489                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1490                      .dwattr $C$DW$T$43, DW_AT_address_class(0x17)
    1491              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiHandle")
    1492                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1493                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1494              
    1495              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1496                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1497              $C$DW$152       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$152, DW_AT_name("spiClkDiv")
    1500                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_spiClkDiv")
    1501                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$153       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$26)
    1505                      .dwattr $C$DW$153, DW_AT_name("wLen")
    1506                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_wLen")
    1507                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1508                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$154       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$154, DW_AT_name("frLen")
    1512                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_frLen")
    1513                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE   40

    1514                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$155       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$28)
    1517                      .dwattr $C$DW$155, DW_AT_name("wcEnable")
    1518                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_wcEnable")
    1519                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1520                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$156       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$30)
    1523                      .dwattr $C$DW$156, DW_AT_name("fcEnable")
    1524                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_fcEnable")
    1525                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1526                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$157       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    1529                      .dwattr $C$DW$157, DW_AT_name("csNum")
    1530                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_csNum")
    1531                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1532                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$158       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
    1535                      .dwattr $C$DW$158, DW_AT_name("dataDelay")
    1536                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_dataDelay")
    1537                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1538                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$159       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$34)
    1541                      .dwattr $C$DW$159, DW_AT_name("clkPol")
    1542                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_clkPol")
    1543                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1544                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$160       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$36)
    1547                      .dwattr $C$DW$160, DW_AT_name("csPol")
    1548                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_csPol")
    1549                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1550                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1551              $C$DW$161       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$38)
    1553                      .dwattr $C$DW$161, DW_AT_name("clkPh")
    1554                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_clkPh")
    1555                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1556                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1557                      .dwendtag $C$DW$T$39
    1558              
    1559              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Config")
    1560                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$39)
    1561                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1562              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    1563                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1564                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    1565              
    1566              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1567                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    1568              $C$DW$162       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE   41

    1569                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    1570                      .dwattr $C$DW$162, DW_AT_name("SPICDR")
    1571                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SPICDR")
    1572                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$163       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    1576                      .dwattr $C$DW$163, DW_AT_name("SPICCR")
    1577                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_SPICCR")
    1578                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1579                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$164       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$40)
    1582                      .dwattr $C$DW$164, DW_AT_name("SPIDCR1")
    1583                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_SPIDCR1")
    1584                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1585                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$165       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$40)
    1588                      .dwattr $C$DW$165, DW_AT_name("SPIDCR2")
    1589                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SPIDCR2")
    1590                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1591                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$166       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$40)
    1594                      .dwattr $C$DW$166, DW_AT_name("SPICMD1")
    1595                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SPICMD1")
    1596                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1597                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$167       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$40)
    1600                      .dwattr $C$DW$167, DW_AT_name("SPICMD2")
    1601                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_SPICMD2")
    1602                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1603                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$168       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$40)
    1606                      .dwattr $C$DW$168, DW_AT_name("SPISTAT1")
    1607                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_SPISTAT1")
    1608                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1609                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$169       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$40)
    1612                      .dwattr $C$DW$169, DW_AT_name("SPISTAT2")
    1613                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SPISTAT2")
    1614                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1615                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$170       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1618                      .dwattr $C$DW$170, DW_AT_name("SPIDR1")
    1619                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SPIDR1")
    1620                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1621                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$171       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi_example.asm                                                  PAGE   42

    1624                      .dwattr $C$DW$171, DW_AT_name("SPIDR2")
    1625                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SPIDR2")
    1626                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1627                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1628                      .dwendtag $C$DW$T$41
    1629              
    1630              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegs")
    1631                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$41)
    1632                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1633              $C$DW$172       .dwtag  DW_TAG_TI_far_type
    1634                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$49)
    1635              $C$DW$173       .dwtag  DW_TAG_TI_ioport_type
    1636                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$172)
    1637              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    1638                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$173)
    1639              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1640                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1641                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    1642              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegsOvly")
    1643                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1644                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1645              
    1646              $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    1647                      .dwattr $C$DW$T$53, DW_AT_name("SPI_Command")
    1648                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1649              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD_CMD"), DW_AT_const_value(0x00)
    1650              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_READ"), DW_AT_const_value(0x01)
    1651              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WRITE"), DW_AT_const_value(0x02)
    1652              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD1_CMD"), DW_AT_const_value(0x03)
    1653                      .dwendtag $C$DW$T$53
    1654              
    1655              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Command")
    1656                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1657                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1658              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1659                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1660                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1661                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1662              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1663                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1664                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1665                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1666              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1667                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1668                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1669                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1670              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1671                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1672                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1673                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1674              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1675                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1676                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1677                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1678              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
