TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE    1

    3833              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:35 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2484 00012c 0049  $C$FSL11:       .string "I2C Event disable Failed!!",10,0
         00012d 0032 
         00012e 0043 
         00012f 0020 
         000130 0045 
         000131 0076 
         000132 0065 
         000133 006E 
         000134 0074 
         000135 0020 
         000136 0064 
         000137 0069 
         000138 0073 
         000139 0061 
         00013a 0062 
         00013b 006C 
         00013c 0065 
         00013d 0020 
         00013e 0046 
         00013f 0061 
         000140 0069 
         000141 006C 
         000142 0065 
         000143 0064 
         000144 0021 
         000145 0021 
         000146 000A 
         000147 0000 
    2485                      .align  2
    2486 000148 0049  $C$FSL12:       .string "I2C Write compltete",10,0
         000149 0032 
         00014a 0043 
         00014b 0020 
         00014c 0057 
         00014d 0072 
         00014e 0069 
         00014f 0074 
         000150 0065 
         000151 0020 
         000152 0063 
         000153 006F 
         000154 006D 
         000155 0070 
         000156 006C 
         000157 0074 
         000158 0065 
         000159 0074 
         00015a 0065 
         00015b 000A 
         00015c 0000 
    2487                      .align  2
    2488 00015e 0049  $C$FSL13:       .string "I2C Read compltete",10,0
         00015f 0032 
         000160 0043 
         000161 0020 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   65

         000162 0052 
         000163 0065 
         000164 0061 
         000165 0064 
         000166 0020 
         000167 0063 
         000168 006F 
         000169 006D 
         00016a 0070 
         00016b 006C 
         00016c 0074 
         00016d 0065 
         00016e 0074 
         00016f 0065 
         000170 000A 
         000171 0000 
    2489                      .align  2
    2490 000172 0052  $C$FSL14:       .string "Read Write Buffers Does not Match!!",10,0
         000173 0065 
         000174 0061 
         000175 0064 
         000176 0020 
         000177 0057 
         000178 0072 
         000179 0069 
         00017a 0074 
         00017b 0065 
         00017c 0020 
         00017d 0042 
         00017e 0075 
         00017f 0066 
         000180 0066 
         000181 0065 
         000182 0072 
         000183 0073 
         000184 0020 
         000185 0044 
         000186 006F 
         000187 0065 
         000188 0073 
         000189 0020 
         00018a 006E 
         00018b 006F 
         00018c 0074 
         00018d 0020 
         00018e 004D 
         00018f 0061 
         000190 0074 
         000191 0063 
         000192 0068 
         000193 0021 
         000194 0021 
         000195 000A 
         000196 0000 
    2491                      .align  2
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   66

    2492 000198 0052  $C$FSL15:       .string "Read Write Buffers Match!!",10,0
         000199 0065 
         00019a 0061 
         00019b 0064 
         00019c 0020 
         00019d 0057 
         00019e 0072 
         00019f 0069 
         0001a0 0074 
         0001a1 0065 
         0001a2 0020 
         0001a3 0042 
         0001a4 0075 
         0001a5 0066 
         0001a6 0066 
         0001a7 0065 
         0001a8 0072 
         0001a9 0073 
         0001aa 0020 
         0001ab 004D 
         0001ac 0061 
         0001ad 0074 
         0001ae 0063 
         0001af 0068 
         0001b0 0021 
         0001b1 0021 
         0001b2 000A 
         0001b3 0000 
    2493              ;******************************************************************************
    2494              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2495              ;******************************************************************************
    2496                      .global _printf
    2497                      .global _I2C_init
    2498                      .global _I2C_config
    2499                      .global _I2C_getConfig
    2500                      .global _I2C_eventEnable
    2501                      .global _I2C_eventDisable
    2502                      .global _I2C_setCallback
    2503                      .global _I2C_getEventId
    2504                      .global _IRQ_plug
    2505                      .global _IRQ_clearAll
    2506                      .global _IRQ_disableAll
    2507                      .global _IRQ_enable
    2508                      .global _IRQ_setVecs
    2509                      .global _IRQ_globalDisable
    2510                      .global _IRQ_globalEnable
    2511                      .global _VECSTART
    2512                      .global _i2cHandle
    2513              
    2514              ;*******************************************************************************
    2515              ;* TYPE INFORMATION                                                            *
    2516              ;*******************************************************************************
    2517              
    2518              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2519                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x39)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   67

    2520              $C$DW$156       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2522                      .dwattr $C$DW$156, DW_AT_name("ICOAR")
    2523                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ICOAR")
    2524                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2525                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$157       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    2528                      .dwattr $C$DW$157, DW_AT_name("RSVD0")
    2529                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RSVD0")
    2530                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2531                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$158       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2534                      .dwattr $C$DW$158, DW_AT_name("ICIMR")
    2535                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ICIMR")
    2536                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2537                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$159       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2540                      .dwattr $C$DW$159, DW_AT_name("RSVD1")
    2541                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RSVD1")
    2542                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2543                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$160       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2546                      .dwattr $C$DW$160, DW_AT_name("ICSTR")
    2547                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ICSTR")
    2548                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2549                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$161       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    2552                      .dwattr $C$DW$161, DW_AT_name("RSVD2")
    2553                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_RSVD2")
    2554                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2555                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$162       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2558                      .dwattr $C$DW$162, DW_AT_name("ICCLKL")
    2559                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ICCLKL")
    2560                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2561                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$163       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2564                      .dwattr $C$DW$163, DW_AT_name("RSVD3")
    2565                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RSVD3")
    2566                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2567                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$164       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2570                      .dwattr $C$DW$164, DW_AT_name("ICCLKH")
    2571                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ICCLKH")
    2572                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2573                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$165       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   68

    2575                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2576                      .dwattr $C$DW$165, DW_AT_name("RSVD4")
    2577                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD4")
    2578                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2579                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$166       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2582                      .dwattr $C$DW$166, DW_AT_name("ICCNT")
    2583                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ICCNT")
    2584                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2585                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$167       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2588                      .dwattr $C$DW$167, DW_AT_name("RSVD5")
    2589                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_RSVD5")
    2590                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2591                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$168       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2594                      .dwattr $C$DW$168, DW_AT_name("ICDRR")
    2595                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ICDRR")
    2596                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2597                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$169       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2600                      .dwattr $C$DW$169, DW_AT_name("RSVD6")
    2601                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RSVD6")
    2602                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2603                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2604              $C$DW$170       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2606                      .dwattr $C$DW$170, DW_AT_name("ICSAR")
    2607                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ICSAR")
    2608                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2609                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$171       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    2612                      .dwattr $C$DW$171, DW_AT_name("RSVD7")
    2613                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD7")
    2614                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2615                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$172       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2618                      .dwattr $C$DW$172, DW_AT_name("ICDXR")
    2619                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_ICDXR")
    2620                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2621                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$173       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2624                      .dwattr $C$DW$173, DW_AT_name("RSVD8")
    2625                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD8")
    2626                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2627                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$174       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   69

    2630                      .dwattr $C$DW$174, DW_AT_name("ICMDR")
    2631                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ICMDR")
    2632                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2633                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$175       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    2636                      .dwattr $C$DW$175, DW_AT_name("RSVD9")
    2637                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD9")
    2638                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2639                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$176       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2642                      .dwattr $C$DW$176, DW_AT_name("ICIVR")
    2643                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ICIVR")
    2644                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2645                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$177       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    2648                      .dwattr $C$DW$177, DW_AT_name("RSVD10")
    2649                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_RSVD10")
    2650                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2651                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$178       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2654                      .dwattr $C$DW$178, DW_AT_name("ICEMDR")
    2655                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ICEMDR")
    2656                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2657                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$179       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    2660                      .dwattr $C$DW$179, DW_AT_name("RSVD11")
    2661                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_RSVD11")
    2662                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2663                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$180       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2666                      .dwattr $C$DW$180, DW_AT_name("ICPSC")
    2667                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ICPSC")
    2668                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2669                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2670              $C$DW$181       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    2672                      .dwattr $C$DW$181, DW_AT_name("RSVD12")
    2673                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RSVD12")
    2674                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2675                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$182       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2678                      .dwattr $C$DW$182, DW_AT_name("ICPID1")
    2679                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ICPID1")
    2680                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2681                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$183       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    2684                      .dwattr $C$DW$183, DW_AT_name("RSVD13")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   70

    2685                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RSVD13")
    2686                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2687                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$184       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2690                      .dwattr $C$DW$184, DW_AT_name("ICPID2")
    2691                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ICPID2")
    2692                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2693                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2694                      .dwendtag $C$DW$T$22
    2695              
    2696              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
    2697                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$22)
    2698                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2699              $C$DW$185       .dwtag  DW_TAG_TI_far_type
    2700                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$35)
    2701              $C$DW$186       .dwtag  DW_TAG_TI_ioport_type
    2702                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$185)
    2703              $C$DW$T$36      .dwtag  DW_TAG_volatile_type
    2704                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$186)
    2705              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2706                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2707                      .dwattr $C$DW$T$37, DW_AT_address_class(0x10)
    2708              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
    2709                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2710                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2711              
    2712              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2713                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    2714              $C$DW$187       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$187, DW_AT_name("EBSR")
    2717                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_EBSR")
    2718                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2719                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$188       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$188, DW_AT_name("RSVD0")
    2723                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD0")
    2724                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2725                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$189       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2728                      .dwattr $C$DW$189, DW_AT_name("PCGCR1")
    2729                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCGCR1")
    2730                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2731                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$190       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$190, DW_AT_name("PCGCR2")
    2735                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCGCR2")
    2736                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2737                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$191       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   71

    2740                      .dwattr $C$DW$191, DW_AT_name("PSRCR")
    2741                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PSRCR")
    2742                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2743                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$192       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2746                      .dwattr $C$DW$192, DW_AT_name("PRCR")
    2747                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PRCR")
    2748                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2749                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$193       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    2752                      .dwattr $C$DW$193, DW_AT_name("RSVD1")
    2753                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD1")
    2754                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2755                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$194       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2758                      .dwattr $C$DW$194, DW_AT_name("TIAFR")
    2759                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_TIAFR")
    2760                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2761                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$195       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$195, DW_AT_name("RSVD2")
    2765                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD2")
    2766                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2767                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$196       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2770                      .dwattr $C$DW$196, DW_AT_name("ODSCR")
    2771                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ODSCR")
    2772                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2773                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$197       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$197, DW_AT_name("PDINHIBR1")
    2777                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PDINHIBR1")
    2778                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2779                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$198       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    2782                      .dwattr $C$DW$198, DW_AT_name("PDINHIBR2")
    2783                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PDINHIBR2")
    2784                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2785                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$199       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2788                      .dwattr $C$DW$199, DW_AT_name("PDINHIBR3")
    2789                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PDINHIBR3")
    2790                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2791                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$200       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2794                      .dwattr $C$DW$200, DW_AT_name("DMA0CESR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   72

    2795                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_DMA0CESR1")
    2796                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2797                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$201       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$201, DW_AT_name("DMA0CESR2")
    2801                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DMA0CESR2")
    2802                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2803                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$202       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2806                      .dwattr $C$DW$202, DW_AT_name("DMA1CESR1")
    2807                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DMA1CESR1")
    2808                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2809                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$203       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$203, DW_AT_name("DMA1CESR2")
    2813                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_DMA1CESR2")
    2814                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2815                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$204       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2818                      .dwattr $C$DW$204, DW_AT_name("SDRAMCCR")
    2819                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SDRAMCCR")
    2820                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2821                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$205       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    2824                      .dwattr $C$DW$205, DW_AT_name("CCR2")
    2825                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CCR2")
    2826                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2827                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2828              $C$DW$206       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    2830                      .dwattr $C$DW$206, DW_AT_name("CGCR1")
    2831                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CGCR1")
    2832                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2833                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$207       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    2836                      .dwattr $C$DW$207, DW_AT_name("CGICR")
    2837                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CGICR")
    2838                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2839                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$208       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2842                      .dwattr $C$DW$208, DW_AT_name("CGCR2")
    2843                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CGCR2")
    2844                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2845                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$209       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2848                      .dwattr $C$DW$209, DW_AT_name("CGOCR")
    2849                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_CGOCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   73

    2850                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2851                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2852              $C$DW$210       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    2854                      .dwattr $C$DW$210, DW_AT_name("CCSSR")
    2855                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CCSSR")
    2856                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2857                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$211       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2860                      .dwattr $C$DW$211, DW_AT_name("RSVD3")
    2861                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD3")
    2862                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2863                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$212       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2866                      .dwattr $C$DW$212, DW_AT_name("ECDR")
    2867                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ECDR")
    2868                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2869                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$213       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    2872                      .dwattr $C$DW$213, DW_AT_name("RSVD4")
    2873                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RSVD4")
    2874                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2875                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$214       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    2878                      .dwattr $C$DW$214, DW_AT_name("RAMSLPMDCNTLR1")
    2879                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2880                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2881                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$215       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2884                      .dwattr $C$DW$215, DW_AT_name("RSVD5")
    2885                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_RSVD5")
    2886                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2887                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$216       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2890                      .dwattr $C$DW$216, DW_AT_name("RAMSLPMDCNTLR2")
    2891                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2892                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2893                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$217       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2896                      .dwattr $C$DW$217, DW_AT_name("RAMSLPMDCNTLR3")
    2897                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2898                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2899                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$218       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2902                      .dwattr $C$DW$218, DW_AT_name("RAMSLPMDCNTLR4")
    2903                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2904                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   74

    2905                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$219       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2908                      .dwattr $C$DW$219, DW_AT_name("RAMSLPMDCNTLR5")
    2909                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2910                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2911                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$220       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    2914                      .dwattr $C$DW$220, DW_AT_name("RSVD6")
    2915                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RSVD6")
    2916                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2917                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$221       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2920                      .dwattr $C$DW$221, DW_AT_name("DMAIFR")
    2921                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMAIFR")
    2922                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2923                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$222       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2926                      .dwattr $C$DW$222, DW_AT_name("DMAIER")
    2927                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMAIER")
    2928                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2929                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2930              $C$DW$223       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2932                      .dwattr $C$DW$223, DW_AT_name("USBSCR")
    2933                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_USBSCR")
    2934                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2935                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$224       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    2938                      .dwattr $C$DW$224, DW_AT_name("ESCR")
    2939                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ESCR")
    2940                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2941                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$225       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$24)
    2944                      .dwattr $C$DW$225, DW_AT_name("RSVD7")
    2945                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RSVD7")
    2946                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2947                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$226       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2950                      .dwattr $C$DW$226, DW_AT_name("DMA2CESR1")
    2951                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_DMA2CESR1")
    2952                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2953                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$227       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2956                      .dwattr $C$DW$227, DW_AT_name("DMA2CESR2")
    2957                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_DMA2CESR2")
    2958                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2959                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   75

    2960              $C$DW$228       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2962                      .dwattr $C$DW$228, DW_AT_name("DMA3CESR1")
    2963                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_DMA3CESR1")
    2964                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2965                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$229       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2968                      .dwattr $C$DW$229, DW_AT_name("DMA3CESR2")
    2969                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_DMA3CESR2")
    2970                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2971                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$230       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2974                      .dwattr $C$DW$230, DW_AT_name("CLKSTOP")
    2975                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_CLKSTOP")
    2976                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2977                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$231       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$25)
    2980                      .dwattr $C$DW$231, DW_AT_name("RSVD8")
    2981                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RSVD8")
    2982                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2983                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$232       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2986                      .dwattr $C$DW$232, DW_AT_name("DIEIDR0")
    2987                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DIEIDR0")
    2988                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2989                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2990              $C$DW$233       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2992                      .dwattr $C$DW$233, DW_AT_name("DIEIDR1")
    2993                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DIEIDR1")
    2994                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2995                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2996              $C$DW$234       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2998                      .dwattr $C$DW$234, DW_AT_name("DIEIDR2")
    2999                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DIEIDR2")
    3000                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3001                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3002              $C$DW$235       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    3004                      .dwattr $C$DW$235, DW_AT_name("DIEIDR3")
    3005                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DIEIDR3")
    3006                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3007                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3008              $C$DW$236       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    3010                      .dwattr $C$DW$236, DW_AT_name("DIEIDR4")
    3011                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_DIEIDR4")
    3012                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3013                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3014              $C$DW$237       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   76

    3015                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    3016                      .dwattr $C$DW$237, DW_AT_name("DIEIDR5")
    3017                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DIEIDR5")
    3018                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3019                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3020              $C$DW$238       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    3022                      .dwattr $C$DW$238, DW_AT_name("DIEIDR6")
    3023                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DIEIDR6")
    3024                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3025                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$239       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    3028                      .dwattr $C$DW$239, DW_AT_name("DIEIDR7")
    3029                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DIEIDR7")
    3030                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3031                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3032                      .dwendtag $C$DW$T$26
    3033              
    3034              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    3035                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$26)
    3036                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3037              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    3038                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$39)
    3039              $C$DW$241       .dwtag  DW_TAG_TI_ioport_type
    3040                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$240)
    3041              $C$DW$T$40      .dwtag  DW_TAG_volatile_type
    3042                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$241)
    3043              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    3044                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3045                      .dwattr $C$DW$T$41, DW_AT_address_class(0x10)
    3046              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    3047                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3048                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3049              
    3050              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3051                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    3052              $C$DW$242       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$29)
    3054                      .dwattr $C$DW$242, DW_AT_name("funcAddr")
    3055                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_funcAddr")
    3056                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3057                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$243       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$30)
    3060                      .dwattr $C$DW$243, DW_AT_name("funcArg")
    3061                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_funcArg")
    3062                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3063                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$244       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$30)
    3066                      .dwattr $C$DW$244, DW_AT_name("ierMask")
    3067                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ierMask")
    3068                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3069                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   77

    3070              $C$DW$245       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$30)
    3072                      .dwattr $C$DW$245, DW_AT_name("cacheCtrl")
    3073                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_cacheCtrl")
    3074                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3075                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3076                      .dwendtag $C$DW$T$31
    3077              
    3078              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Config")
    3079                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$31)
    3080                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3081              
    3082              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    3083                      .dwattr $C$DW$T$45, DW_AT_name("CSL_I2cAddrMode")
    3084                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3085              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
    3086              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
    3087                      .dwendtag $C$DW$T$45
    3088              
    3089              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
    3090                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3091                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3092              
    3093              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3094                      .dwattr $C$DW$T$47, DW_AT_name("CSL_I2cBitCount")
    3095                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3096              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
    3097              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
    3098              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
    3099              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
    3100              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
    3101              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
    3102              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
    3103              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
    3104                      .dwendtag $C$DW$T$47
    3105              
    3106              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
    3107                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3108                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3109              
    3110              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3111                      .dwattr $C$DW$T$32, DW_AT_name("CSL_I2cConfig")
    3112                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x09)
    3113              $C$DW$256       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$256, DW_AT_name("icoar")
    3116                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_icoar")
    3117                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3118                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$257       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3121                      .dwattr $C$DW$257, DW_AT_name("icimr")
    3122                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_icimr")
    3123                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3124                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   78

    3125              $C$DW$258       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3127                      .dwattr $C$DW$258, DW_AT_name("icclkl")
    3128                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_icclkl")
    3129                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3130                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$259       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$259, DW_AT_name("icclkh")
    3134                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_icclkh")
    3135                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3136                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$260       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3139                      .dwattr $C$DW$260, DW_AT_name("iccnt")
    3140                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_iccnt")
    3141                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3142                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$261       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3145                      .dwattr $C$DW$261, DW_AT_name("icsar")
    3146                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_icsar")
    3147                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3148                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$262       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3151                      .dwattr $C$DW$262, DW_AT_name("icmdr")
    3152                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_icmdr")
    3153                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3154                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$263       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3157                      .dwattr $C$DW$263, DW_AT_name("icemdr")
    3158                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_icemdr")
    3159                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3160                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$264       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3163                      .dwattr $C$DW$264, DW_AT_name("icpsc")
    3164                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_icpsc")
    3165                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3166                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3167                      .dwendtag $C$DW$T$32
    3168              
    3169              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
    3170                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$32)
    3171                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3172              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3173                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3174                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    3175              
    3176              $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3177                      .dwattr $C$DW$T$59, DW_AT_name("CSL_I2cEvent")
    3178                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
    3179              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_AL"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   79

    3180              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_NACK"), DW_AT_const_value(0x01)
    3181              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ARDY"), DW_AT_const_value(0x02)
    3182              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ICRRDY"), DW_AT_const_value(0x03)
    3183              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ICXRDY"), DW_AT_const_value(0x04)
    3184              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_SCD"), DW_AT_const_value(0x05)
    3185              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_AAS"), DW_AT_const_value(0x06)
    3186                      .dwendtag $C$DW$T$59
    3187              
    3188              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cEvent")
    3189                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3190                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3191              
    3192              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    3193                      .dwattr $C$DW$T$51, DW_AT_name("CSL_I2cFreeMode")
    3194                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3195              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
    3196              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
    3197                      .dwendtag $C$DW$T$51
    3198              
    3199              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
    3200                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3201                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3202              
    3203              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3204                      .dwattr $C$DW$T$34, DW_AT_name("CSL_I2cIsrAddr")
    3205                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0e)
    3206              $C$DW$274       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$33)
    3208                      .dwattr $C$DW$274, DW_AT_name("alAddr")
    3209                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_alAddr")
    3210                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3211                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3212              $C$DW$275       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$33)
    3214                      .dwattr $C$DW$275, DW_AT_name("nackAddr")
    3215                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_nackAddr")
    3216                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3217                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3218              $C$DW$276       .dwtag  DW_TAG_member
    3219                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$33)
    3220                      .dwattr $C$DW$276, DW_AT_name("ardyAddr")
    3221                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_ardyAddr")
    3222                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3223                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3224              $C$DW$277       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$33)
    3226                      .dwattr $C$DW$277, DW_AT_name("rrdyAddr")
    3227                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_rrdyAddr")
    3228                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3229                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3230              $C$DW$278       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$33)
    3232                      .dwattr $C$DW$278, DW_AT_name("xrdyAddr")
    3233                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_xrdyAddr")
    3234                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   80

    3235                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3236              $C$DW$279       .dwtag  DW_TAG_member
    3237                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$33)
    3238                      .dwattr $C$DW$279, DW_AT_name("scdAddr")
    3239                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_scdAddr")
    3240                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3241                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3242              $C$DW$280       .dwtag  DW_TAG_member
    3243                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$33)
    3244                      .dwattr $C$DW$280, DW_AT_name("aasAddr")
    3245                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_aasAddr")
    3246                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3247                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3248                      .dwendtag $C$DW$T$34
    3249              
    3250              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cIsrAddr")
    3251                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    3252                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3253              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    3254                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3255                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    3256              
    3257              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    3258                      .dwattr $C$DW$T$49, DW_AT_name("CSL_I2cLoopback")
    3259                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3260              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
    3261              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
    3262                      .dwendtag $C$DW$T$49
    3263              
    3264              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
    3265                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3266                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3267              
    3268              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3269                      .dwattr $C$DW$T$44, DW_AT_name("CSL_I2cObj")
    3270                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x10)
    3271              $C$DW$283       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$38)
    3273                      .dwattr $C$DW$283, DW_AT_name("i2cRegs")
    3274                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_i2cRegs")
    3275                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3276                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3277              $C$DW$284       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$42)
    3279                      .dwattr $C$DW$284, DW_AT_name("sysCtrlRegs")
    3280                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_sysCtrlRegs")
    3281                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3282                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3283              $C$DW$285       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$43)
    3285                      .dwattr $C$DW$285, DW_AT_name("I2C_isrDispatchTable")
    3286                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_I2C_isrDispatchTable")
    3287                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3288                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3289                      .dwendtag $C$DW$T$44
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   81

    3290              
    3291              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cObj")
    3292                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$44)
    3293                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3294              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    3295                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    3296                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    3297              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("pI2cHandle")
    3298                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3299                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3300              
    3301              $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    3302                      .dwattr $C$DW$T$53, DW_AT_name("CSL_I2cRepeatMode")
    3303                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3304              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
    3305              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
    3306                      .dwendtag $C$DW$T$53
    3307              
    3308              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
    3309                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3310                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3311              
    3312              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3313                      .dwattr $C$DW$T$55, DW_AT_name("CSL_I2cSetup")
    3314                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x0a)
    3315              $C$DW$288       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$46)
    3317                      .dwattr $C$DW$288, DW_AT_name("addrMode")
    3318                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_addrMode")
    3319                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3320                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3321              $C$DW$289       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$48)
    3323                      .dwattr $C$DW$289, DW_AT_name("bitCount")
    3324                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_bitCount")
    3325                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3326                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3327              $C$DW$290       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$50)
    3329                      .dwattr $C$DW$290, DW_AT_name("loopBack")
    3330                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_loopBack")
    3331                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3332                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$291       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$52)
    3335                      .dwattr $C$DW$291, DW_AT_name("freeMode")
    3336                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_freeMode")
    3337                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3338                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$292       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$54)
    3341                      .dwattr $C$DW$292, DW_AT_name("repeatMode")
    3342                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_repeatMode")
    3343                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3344                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   82

    3345              $C$DW$293       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    3347                      .dwattr $C$DW$293, DW_AT_name("ownAddr")
    3348                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_ownAddr")
    3349                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3350                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$294       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$30)
    3353                      .dwattr $C$DW$294, DW_AT_name("sysInputClk")
    3354                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_sysInputClk")
    3355                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3356                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3357              $C$DW$295       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$30)
    3359                      .dwattr $C$DW$295, DW_AT_name("i2cBusFreq")
    3360                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_i2cBusFreq")
    3361                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3362                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3363                      .dwendtag $C$DW$T$55
    3364              
    3365              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
    3366                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$55)
    3367                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3368              
    3369              $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    3370                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3371              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3372                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3373                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3374              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2C_EVENT_ISR")
    3375                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$28)
    3376                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3377              
    3378              $C$DW$T$43      .dwtag  DW_TAG_array_type
    3379                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$33)
    3380                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3381                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0e)
    3382              $C$DW$296       .dwtag  DW_TAG_subrange_type
    3383                      .dwattr $C$DW$296, DW_AT_upper_bound(0x06)
    3384                      .dwendtag $C$DW$T$43
    3385              
    3386              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    3387                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3388                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3389              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3390                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3391                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3392                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3393              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3394                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3395                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3396                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3397              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3398                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3399                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_intc_example.asm                                             PAGE   83

    3400                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3401              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3402                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3403                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3404                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3405              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3406                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3407                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3408                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3409              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3410                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$8)
    3411                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3412              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    3413                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3414                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
