TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE    1

    6473              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:59 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4166              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    4167              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    4168              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    4169              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    4170              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    4171              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    4172              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    4173              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    4174              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    4175              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    4176              $C$DW$395       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    4177              $C$DW$396       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    4178              $C$DW$397       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    4179              $C$DW$398       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    4180              $C$DW$399       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    4181              $C$DW$400       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    4182              $C$DW$401       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    4183              $C$DW$402       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    4184              $C$DW$403       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    4185              $C$DW$404       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    4186                      .dwendtag $C$DW$T$72
    4187              
    4188              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    4189                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    4190                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4191              
    4192              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    4193                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    4194              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    4195              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    4196              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    4197              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    4198                      .dwendtag $C$DW$T$85
    4199              
    4200              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    4201                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    4202                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4203              
    4204              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    4205                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    4206              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    4207              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    4208                      .dwendtag $C$DW$T$96
    4209              
    4210              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    4211                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4212                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4213              
    4214              $C$DW$T$103     .dwtag  DW_TAG_enumeration_type
    4215                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
    4216              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  125

    4217              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
    4218              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
    4219                      .dwendtag $C$DW$T$103
    4220              
    4221              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
    4222                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4223                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4224              
    4225              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4226                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    4227              $C$DW$414       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    4229                      .dwattr $C$DW$414, DW_AT_name("DMACH0SSAL")
    4230                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_DMACH0SSAL")
    4231                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4232                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$415       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    4235                      .dwattr $C$DW$415, DW_AT_name("DMACH0SSAU")
    4236                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_DMACH0SSAU")
    4237                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4238                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$416       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    4241                      .dwattr $C$DW$416, DW_AT_name("DMACH0DSAL")
    4242                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_DMACH0DSAL")
    4243                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4244                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$417       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    4247                      .dwattr $C$DW$417, DW_AT_name("DMACH0DSAU")
    4248                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_DMACH0DSAU")
    4249                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4250                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$418       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    4253                      .dwattr $C$DW$418, DW_AT_name("DMACH0TCR1")
    4254                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_DMACH0TCR1")
    4255                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4256                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$419       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    4259                      .dwattr $C$DW$419, DW_AT_name("DMACH0TCR2")
    4260                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_DMACH0TCR2")
    4261                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4262                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$420       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    4265                      .dwattr $C$DW$420, DW_AT_name("RSVD0")
    4266                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_RSVD0")
    4267                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4268                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$421       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    4271                      .dwattr $C$DW$421, DW_AT_name("DMACH1SSAL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  126

    4272                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_DMACH1SSAL")
    4273                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4274                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$422       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    4277                      .dwattr $C$DW$422, DW_AT_name("DMACH1SSAU")
    4278                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_DMACH1SSAU")
    4279                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4280                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$423       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    4283                      .dwattr $C$DW$423, DW_AT_name("DMACH1DSAL")
    4284                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_DMACH1DSAL")
    4285                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4286                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$424       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    4289                      .dwattr $C$DW$424, DW_AT_name("DMACH1DSAU")
    4290                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMACH1DSAU")
    4291                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4292                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$425       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    4295                      .dwattr $C$DW$425, DW_AT_name("DMACH1TCR1")
    4296                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMACH1TCR1")
    4297                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4298                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$426       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    4301                      .dwattr $C$DW$426, DW_AT_name("DMACH1TCR2")
    4302                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_DMACH1TCR2")
    4303                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4304                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$427       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
    4307                      .dwattr $C$DW$427, DW_AT_name("RSVD1")
    4308                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD1")
    4309                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4310                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$428       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4313                      .dwattr $C$DW$428, DW_AT_name("DMACH2SSAL")
    4314                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_DMACH2SSAL")
    4315                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4316                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$429       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4319                      .dwattr $C$DW$429, DW_AT_name("DMACH2SSAU")
    4320                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_DMACH2SSAU")
    4321                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4322                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$430       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4325                      .dwattr $C$DW$430, DW_AT_name("DMACH2DSAL")
    4326                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DMACH2DSAL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  127

    4327                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4328                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$431       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4331                      .dwattr $C$DW$431, DW_AT_name("DMACH2DSAU")
    4332                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH2DSAU")
    4333                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4334                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$432       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    4337                      .dwattr $C$DW$432, DW_AT_name("DMACH2TCR1")
    4338                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH2TCR1")
    4339                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4340                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$433       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    4343                      .dwattr $C$DW$433, DW_AT_name("DMACH2TCR2")
    4344                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH2TCR2")
    4345                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4346                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$434       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    4349                      .dwattr $C$DW$434, DW_AT_name("RSVD2")
    4350                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD2")
    4351                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4352                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$435       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4355                      .dwattr $C$DW$435, DW_AT_name("DMACH3SSAL")
    4356                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH3SSAL")
    4357                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4358                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$436       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4361                      .dwattr $C$DW$436, DW_AT_name("DMACH3SSAU")
    4362                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMACH3SSAU")
    4363                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4364                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$437       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    4367                      .dwattr $C$DW$437, DW_AT_name("DMACH3DSAL")
    4368                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DMACH3DSAL")
    4369                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4370                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$438       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4373                      .dwattr $C$DW$438, DW_AT_name("DMACH3DSAU")
    4374                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH3DSAU")
    4375                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4376                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$439       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4379                      .dwattr $C$DW$439, DW_AT_name("DMACH3TCR1")
    4380                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH3TCR1")
    4381                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  128

    4382                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$440       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    4385                      .dwattr $C$DW$440, DW_AT_name("DMACH3TCR2")
    4386                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH3TCR2")
    4387                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4388                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4389                      .dwendtag $C$DW$T$22
    4390              
    4391              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    4392                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4393                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4394              $C$DW$441       .dwtag  DW_TAG_TI_far_type
    4395                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$23)
    4396              $C$DW$442       .dwtag  DW_TAG_TI_ioport_type
    4397                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$441)
    4398              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    4399                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$442)
    4400              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4401                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4402                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4403              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    4404                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4405                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4406              
    4407              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4408                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    4409              $C$DW$443       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$26)
    4411                      .dwattr $C$DW$443, DW_AT_name("dmaRegs")
    4412                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_dmaRegs")
    4413                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4414                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4415              $C$DW$444       .dwtag  DW_TAG_member
    4416                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$28)
    4417                      .dwattr $C$DW$444, DW_AT_name("chanNum")
    4418                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_chanNum")
    4419                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4420                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4421              $C$DW$445       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$30)
    4423                      .dwattr $C$DW$445, DW_AT_name("dmaInstNum")
    4424                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_dmaInstNum")
    4425                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4426                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4427              $C$DW$446       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$31)
    4429                      .dwattr $C$DW$446, DW_AT_name("isChanFree")
    4430                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_isChanFree")
    4431                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4432                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4433              $C$DW$447       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$33)
    4435                      .dwattr $C$DW$447, DW_AT_name("chanDir")
    4436                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_chanDir")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  129

    4437                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4438                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4439              $C$DW$448       .dwtag  DW_TAG_member
    4440                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$35)
    4441                      .dwattr $C$DW$448, DW_AT_name("trigger")
    4442                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_trigger")
    4443                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4444                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$449       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$37)
    4447                      .dwattr $C$DW$449, DW_AT_name("trfType")
    4448                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_trfType")
    4449                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4450                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4451              $C$DW$450       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$39)
    4453                      .dwattr $C$DW$450, DW_AT_name("dmaInt")
    4454                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_dmaInt")
    4455                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4456                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$451       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$31)
    4459                      .dwattr $C$DW$451, DW_AT_name("pingPongEnabled")
    4460                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_pingPongEnabled")
    4461                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4462                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4463                      .dwendtag $C$DW$T$40
    4464              
    4465              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    4466                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
    4467                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4468              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4469                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4470                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    4471              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    4472                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4473                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4474              
    4475              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4476                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x75)
    4477              $C$DW$452       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4479                      .dwattr $C$DW$452, DW_AT_name("MMCCTL")
    4480                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_MMCCTL")
    4481                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4482                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$453       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$41)
    4485                      .dwattr $C$DW$453, DW_AT_name("RSVD0")
    4486                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD0")
    4487                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4488                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$454       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4491                      .dwattr $C$DW$454, DW_AT_name("MMCCLK")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  130

    4492                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_MMCCLK")
    4493                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4494                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$455       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$41)
    4497                      .dwattr $C$DW$455, DW_AT_name("RSVD1")
    4498                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_RSVD1")
    4499                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4500                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4501              $C$DW$456       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4503                      .dwattr $C$DW$456, DW_AT_name("MMCST0")
    4504                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_MMCST0")
    4505                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4506                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4507              $C$DW$457       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$41)
    4509                      .dwattr $C$DW$457, DW_AT_name("RSVD2")
    4510                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_RSVD2")
    4511                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4512                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$458       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4515                      .dwattr $C$DW$458, DW_AT_name("MMCST1")
    4516                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_MMCST1")
    4517                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4518                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$459       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$41)
    4521                      .dwattr $C$DW$459, DW_AT_name("RSVD3")
    4522                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD3")
    4523                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4524                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$460       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4527                      .dwattr $C$DW$460, DW_AT_name("MMCIM")
    4528                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_MMCIM")
    4529                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4530                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$461       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$41)
    4533                      .dwattr $C$DW$461, DW_AT_name("RSVD4")
    4534                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_RSVD4")
    4535                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4536                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4537              $C$DW$462       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4539                      .dwattr $C$DW$462, DW_AT_name("MMCTOR")
    4540                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_MMCTOR")
    4541                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4542                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4543              $C$DW$463       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$41)
    4545                      .dwattr $C$DW$463, DW_AT_name("RSVD5")
    4546                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  131

    4547                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4548                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$464       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4551                      .dwattr $C$DW$464, DW_AT_name("MMCTOD")
    4552                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_MMCTOD")
    4553                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4554                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4555              $C$DW$465       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$41)
    4557                      .dwattr $C$DW$465, DW_AT_name("RSVD6")
    4558                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_RSVD6")
    4559                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4560                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4561              $C$DW$466       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4563                      .dwattr $C$DW$466, DW_AT_name("MMCBLEN")
    4564                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_MMCBLEN")
    4565                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4566                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$467       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$41)
    4569                      .dwattr $C$DW$467, DW_AT_name("RSVD7")
    4570                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD7")
    4571                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4572                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$468       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    4575                      .dwattr $C$DW$468, DW_AT_name("MMCNBLK")
    4576                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_MMCNBLK")
    4577                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4578                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$469       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$41)
    4581                      .dwattr $C$DW$469, DW_AT_name("RSVD8")
    4582                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_RSVD8")
    4583                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4584                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4585              $C$DW$470       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    4587                      .dwattr $C$DW$470, DW_AT_name("MMCNBLC")
    4588                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_MMCNBLC")
    4589                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4590                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$471       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$41)
    4593                      .dwattr $C$DW$471, DW_AT_name("RSVD9")
    4594                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_RSVD9")
    4595                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4596                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$472       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    4599                      .dwattr $C$DW$472, DW_AT_name("MMCDRR1")
    4600                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_MMCDRR1")
    4601                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  132

    4602                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$473       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    4605                      .dwattr $C$DW$473, DW_AT_name("MMCDRR2")
    4606                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_MMCDRR2")
    4607                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4608                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$474       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$42)
    4611                      .dwattr $C$DW$474, DW_AT_name("RSVD10")
    4612                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_RSVD10")
    4613                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4614                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$475       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    4617                      .dwattr $C$DW$475, DW_AT_name("MMCDXR1")
    4618                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_MMCDXR1")
    4619                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4620                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$476       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    4623                      .dwattr $C$DW$476, DW_AT_name("MMCDXR2")
    4624                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_MMCDXR2")
    4625                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4626                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$477       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$42)
    4629                      .dwattr $C$DW$477, DW_AT_name("RSVD11")
    4630                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_RSVD11")
    4631                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4632                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$478       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    4635                      .dwattr $C$DW$478, DW_AT_name("MMCCMD1")
    4636                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_MMCCMD1")
    4637                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4638                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$479       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    4641                      .dwattr $C$DW$479, DW_AT_name("MMCCMD2")
    4642                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_MMCCMD2")
    4643                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4644                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$480       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$42)
    4647                      .dwattr $C$DW$480, DW_AT_name("RSVD12")
    4648                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_RSVD12")
    4649                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4650                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$481       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    4653                      .dwattr $C$DW$481, DW_AT_name("MMCARG1")
    4654                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_MMCARG1")
    4655                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4656                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  133

    4657              $C$DW$482       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    4659                      .dwattr $C$DW$482, DW_AT_name("MMCARG2")
    4660                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_MMCARG2")
    4661                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4662                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$483       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$42)
    4665                      .dwattr $C$DW$483, DW_AT_name("RSVD13")
    4666                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD13")
    4667                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4668                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4669              $C$DW$484       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    4671                      .dwattr $C$DW$484, DW_AT_name("MMCRSP0")
    4672                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_MMCRSP0")
    4673                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4674                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$485       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    4677                      .dwattr $C$DW$485, DW_AT_name("MMCRSP1")
    4678                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_MMCRSP1")
    4679                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4680                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$486       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$42)
    4683                      .dwattr $C$DW$486, DW_AT_name("RSVD14")
    4684                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_RSVD14")
    4685                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4686                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$487       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    4689                      .dwattr $C$DW$487, DW_AT_name("MMCRSP2")
    4690                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_MMCRSP2")
    4691                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4692                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$488       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
    4695                      .dwattr $C$DW$488, DW_AT_name("MMCRSP3")
    4696                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_MMCRSP3")
    4697                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    4698                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4699              $C$DW$489       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$42)
    4701                      .dwattr $C$DW$489, DW_AT_name("RSVD15")
    4702                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD15")
    4703                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4704                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4705              $C$DW$490       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    4707                      .dwattr $C$DW$490, DW_AT_name("MMCRSP4")
    4708                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_MMCRSP4")
    4709                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4710                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4711              $C$DW$491       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  134

    4712                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
    4713                      .dwattr $C$DW$491, DW_AT_name("MMCRSP5")
    4714                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_MMCRSP5")
    4715                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4716                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4717              $C$DW$492       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$42)
    4719                      .dwattr $C$DW$492, DW_AT_name("RSVD16")
    4720                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_RSVD16")
    4721                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4722                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$493       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    4725                      .dwattr $C$DW$493, DW_AT_name("MMCRSP6")
    4726                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_MMCRSP6")
    4727                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4728                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$494       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    4731                      .dwattr $C$DW$494, DW_AT_name("MMCRSP7")
    4732                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_MMCRSP7")
    4733                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4734                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$495       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$42)
    4737                      .dwattr $C$DW$495, DW_AT_name("RSVD17")
    4738                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_RSVD17")
    4739                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4740                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4741              $C$DW$496       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
    4743                      .dwattr $C$DW$496, DW_AT_name("MMCDRSP")
    4744                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_MMCDRSP")
    4745                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4746                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4747              $C$DW$497       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$43)
    4749                      .dwattr $C$DW$497, DW_AT_name("RSVD18")
    4750                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_RSVD18")
    4751                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    4752                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4753              $C$DW$498       .dwtag  DW_TAG_member
    4754                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    4755                      .dwattr $C$DW$498, DW_AT_name("MMCCIDX")
    4756                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_MMCCIDX")
    4757                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4758                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4759              $C$DW$499       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$44)
    4761                      .dwattr $C$DW$499, DW_AT_name("RSVD19")
    4762                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_RSVD19")
    4763                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    4764                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$500       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  135

    4767                      .dwattr $C$DW$500, DW_AT_name("SDIOCTL")
    4768                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_SDIOCTL")
    4769                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4770                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4771              $C$DW$501       .dwtag  DW_TAG_member
    4772                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$41)
    4773                      .dwattr $C$DW$501, DW_AT_name("RSVD20")
    4774                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD20")
    4775                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4776                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4777              $C$DW$502       .dwtag  DW_TAG_member
    4778                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
    4779                      .dwattr $C$DW$502, DW_AT_name("SDIOST0")
    4780                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_SDIOST0")
    4781                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4782                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4783              $C$DW$503       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$41)
    4785                      .dwattr $C$DW$503, DW_AT_name("RSVD21")
    4786                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_RSVD21")
    4787                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    4788                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4789              $C$DW$504       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
    4791                      .dwattr $C$DW$504, DW_AT_name("SDIOIEN")
    4792                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_SDIOIEN")
    4793                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4794                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4795              $C$DW$505       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$41)
    4797                      .dwattr $C$DW$505, DW_AT_name("RSVD22")
    4798                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_RSVD22")
    4799                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    4800                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4801              $C$DW$506       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    4803                      .dwattr $C$DW$506, DW_AT_name("SDIOIST")
    4804                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_SDIOIST")
    4805                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4806                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4807              $C$DW$507       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$41)
    4809                      .dwattr $C$DW$507, DW_AT_name("RSVD23")
    4810                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD23")
    4811                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    4812                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$508       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
    4815                      .dwattr $C$DW$508, DW_AT_name("MMCFIFOCTL")
    4816                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    4817                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4818                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4819                      .dwendtag $C$DW$T$45
    4820              
    4821              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  136

    4822                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$45)
    4823                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4824              $C$DW$509       .dwtag  DW_TAG_TI_far_type
    4825                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$77)
    4826              $C$DW$510       .dwtag  DW_TAG_TI_ioport_type
    4827                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$509)
    4828              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    4829                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$510)
    4830              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4831                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    4832                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    4833              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    4834                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4835                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4836              
    4837              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4838                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x10)
    4839              $C$DW$511       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
    4841                      .dwattr $C$DW$511, DW_AT_name("mfgId")
    4842                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_mfgId")
    4843                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4844                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$512       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$19)
    4847                      .dwattr $C$DW$512, DW_AT_name("oemAppId")
    4848                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_oemAppId")
    4849                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4850                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$513       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$47)
    4853                      .dwattr $C$DW$513, DW_AT_name("productName")
    4854                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_productName")
    4855                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4856                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$514       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$19)
    4859                      .dwattr $C$DW$514, DW_AT_name("productRev")
    4860                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_productRev")
    4861                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4862                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$515       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$48)
    4865                      .dwattr $C$DW$515, DW_AT_name("serialNumber")
    4866                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_serialNumber")
    4867                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4868                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$516       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    4871                      .dwattr $C$DW$516, DW_AT_name("month")
    4872                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_month")
    4873                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4874                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$517       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  137

    4877                      .dwattr $C$DW$517, DW_AT_name("year")
    4878                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_year")
    4879                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4880                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$518       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    4883                      .dwattr $C$DW$518, DW_AT_name("checksum")
    4884                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_checksum")
    4885                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4886                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4887                      .dwendtag $C$DW$T$49
    4888              
    4889              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    4890                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$49)
    4891                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4892              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    4893                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4894                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    4895              
    4896              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4897                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x22)
    4898              $C$DW$519       .dwtag  DW_TAG_member
    4899                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    4900                      .dwattr $C$DW$519, DW_AT_name("csdStruct")
    4901                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_csdStruct")
    4902                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4903                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4904              $C$DW$520       .dwtag  DW_TAG_member
    4905                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
    4906                      .dwattr $C$DW$520, DW_AT_name("mmcProt")
    4907                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_mmcProt")
    4908                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4909                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4910              $C$DW$521       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    4912                      .dwattr $C$DW$521, DW_AT_name("taac")
    4913                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_taac")
    4914                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4915                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4916              $C$DW$522       .dwtag  DW_TAG_member
    4917                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    4918                      .dwattr $C$DW$522, DW_AT_name("nsac")
    4919                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_nsac")
    4920                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4921                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4922              $C$DW$523       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    4924                      .dwattr $C$DW$523, DW_AT_name("tranSpeed")
    4925                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_tranSpeed")
    4926                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4927                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4928              $C$DW$524       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
    4930                      .dwattr $C$DW$524, DW_AT_name("ccc")
    4931                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_ccc")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  138

    4932                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4933                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4934              $C$DW$525       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
    4936                      .dwattr $C$DW$525, DW_AT_name("readBlLen")
    4937                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_readBlLen")
    4938                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4939                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4940              $C$DW$526       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
    4942                      .dwattr $C$DW$526, DW_AT_name("readBlPartial")
    4943                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_readBlPartial")
    4944                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4945                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$527       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
    4948                      .dwattr $C$DW$527, DW_AT_name("writeBlkMisalign")
    4949                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_writeBlkMisalign")
    4950                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4951                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4952              $C$DW$528       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$19)
    4954                      .dwattr $C$DW$528, DW_AT_name("readBlkMisalign")
    4955                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_readBlkMisalign")
    4956                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4957                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4958              $C$DW$529       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    4960                      .dwattr $C$DW$529, DW_AT_name("dsrImp")
    4961                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_dsrImp")
    4962                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4963                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$530       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    4966                      .dwattr $C$DW$530, DW_AT_name("cSize")
    4967                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_cSize")
    4968                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4969                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4970              $C$DW$531       .dwtag  DW_TAG_member
    4971                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
    4972                      .dwattr $C$DW$531, DW_AT_name("vddRCurrMin")
    4973                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_vddRCurrMin")
    4974                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4975                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4976              $C$DW$532       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
    4978                      .dwattr $C$DW$532, DW_AT_name("vddRCurrMax")
    4979                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_vddRCurrMax")
    4980                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4981                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4982              $C$DW$533       .dwtag  DW_TAG_member
    4983                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
    4984                      .dwattr $C$DW$533, DW_AT_name("vddWCurrMin")
    4985                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_vddWCurrMin")
    4986                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  139

    4987                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4988              $C$DW$534       .dwtag  DW_TAG_member
    4989                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
    4990                      .dwattr $C$DW$534, DW_AT_name("vddWCurrMax")
    4991                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_vddWCurrMax")
    4992                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4993                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4994              $C$DW$535       .dwtag  DW_TAG_member
    4995                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
    4996                      .dwattr $C$DW$535, DW_AT_name("cSizeMult")
    4997                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_cSizeMult")
    4998                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4999                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5000              $C$DW$536       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
    5002                      .dwattr $C$DW$536, DW_AT_name("eraseBlkEnable")
    5003                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_eraseBlkEnable")
    5004                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5005                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5006              $C$DW$537       .dwtag  DW_TAG_member
    5007                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
    5008                      .dwattr $C$DW$537, DW_AT_name("eraseGrpSize")
    5009                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_eraseGrpSize")
    5010                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5011                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5012              $C$DW$538       .dwtag  DW_TAG_member
    5013                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
    5014                      .dwattr $C$DW$538, DW_AT_name("eraseGrpMult")
    5015                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_eraseGrpMult")
    5016                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5017                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5018              $C$DW$539       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$19)
    5020                      .dwattr $C$DW$539, DW_AT_name("wpGrpSize")
    5021                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_wpGrpSize")
    5022                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5023                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    5024              $C$DW$540       .dwtag  DW_TAG_member
    5025                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
    5026                      .dwattr $C$DW$540, DW_AT_name("wpGrpEnable")
    5027                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_wpGrpEnable")
    5028                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5029                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    5030              $C$DW$541       .dwtag  DW_TAG_member
    5031                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$19)
    5032                      .dwattr $C$DW$541, DW_AT_name("defaultEcc")
    5033                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_defaultEcc")
    5034                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5035                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    5036              $C$DW$542       .dwtag  DW_TAG_member
    5037                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$19)
    5038                      .dwattr $C$DW$542, DW_AT_name("r2wFactor")
    5039                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_r2wFactor")
    5040                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5041                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  140

    5042              $C$DW$543       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$19)
    5044                      .dwattr $C$DW$543, DW_AT_name("writeBlLen")
    5045                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_writeBlLen")
    5046                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5047                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    5048              $C$DW$544       .dwtag  DW_TAG_member
    5049                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
    5050                      .dwattr $C$DW$544, DW_AT_name("writeBlPartial")
    5051                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_writeBlPartial")
    5052                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5053                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    5054              $C$DW$545       .dwtag  DW_TAG_member
    5055                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$19)
    5056                      .dwattr $C$DW$545, DW_AT_name("contProtApp")
    5057                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_contProtApp")
    5058                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5059                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    5060              $C$DW$546       .dwtag  DW_TAG_member
    5061                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$19)
    5062                      .dwattr $C$DW$546, DW_AT_name("fileFmtGrp")
    5063                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_fileFmtGrp")
    5064                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5065                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    5066              $C$DW$547       .dwtag  DW_TAG_member
    5067                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$19)
    5068                      .dwattr $C$DW$547, DW_AT_name("copyFlag")
    5069                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_copyFlag")
    5070                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5071                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    5072              $C$DW$548       .dwtag  DW_TAG_member
    5073                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
    5074                      .dwattr $C$DW$548, DW_AT_name("permWriteProtect")
    5075                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_permWriteProtect")
    5076                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5077                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    5078              $C$DW$549       .dwtag  DW_TAG_member
    5079                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
    5080                      .dwattr $C$DW$549, DW_AT_name("tmpWriteProtect")
    5081                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_tmpWriteProtect")
    5082                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5083                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    5084              $C$DW$550       .dwtag  DW_TAG_member
    5085                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
    5086                      .dwattr $C$DW$550, DW_AT_name("fileFmt")
    5087                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_fileFmt")
    5088                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5089                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    5090              $C$DW$551       .dwtag  DW_TAG_member
    5091                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
    5092                      .dwattr $C$DW$551, DW_AT_name("ecc")
    5093                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ecc")
    5094                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5095                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    5096              $C$DW$552       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  141

    5097                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    5098                      .dwattr $C$DW$552, DW_AT_name("crc")
    5099                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_crc")
    5100                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5101                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    5102                      .dwendtag $C$DW$T$50
    5103              
    5104              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    5105                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$50)
    5106                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5107              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    5108                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5109                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    5110              
    5111              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5112                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x06)
    5113              $C$DW$553       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
    5115                      .dwattr $C$DW$553, DW_AT_name("securitySysId")
    5116                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_securitySysId")
    5117                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5118                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    5119              $C$DW$554       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
    5121                      .dwattr $C$DW$554, DW_AT_name("securitySysVers")
    5122                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_securitySysVers")
    5123                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5124                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$555       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$19)
    5127                      .dwattr $C$DW$555, DW_AT_name("maxLicenses")
    5128                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_maxLicenses")
    5129                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5130                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    5131              $C$DW$556       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$48)
    5133                      .dwattr $C$DW$556, DW_AT_name("xStatus")
    5134                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_xStatus")
    5135                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5136                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    5137                      .dwendtag $C$DW$T$51
    5138              
    5139              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    5140                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$51)
    5141                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5142              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    5143                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    5144                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    5145              
    5146              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5147                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1e)
    5148              $C$DW$557       .dwtag  DW_TAG_member
    5149                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$19)
    5150                      .dwattr $C$DW$557, DW_AT_name("rca")
    5151                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rca")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  142

    5152                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5153                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    5154              $C$DW$558       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
    5156                      .dwattr $C$DW$558, DW_AT_name("ST0")
    5157                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ST0")
    5158                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5159                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    5160              $C$DW$559       .dwtag  DW_TAG_member
    5161                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$19)
    5162                      .dwattr $C$DW$559, DW_AT_name("ST1")
    5163                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ST1")
    5164                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5165                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    5166              $C$DW$560       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
    5168                      .dwattr $C$DW$560, DW_AT_name("cardIndex")
    5169                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_cardIndex")
    5170                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5171                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    5172              $C$DW$561       .dwtag  DW_TAG_member
    5173                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$48)
    5174                      .dwattr $C$DW$561, DW_AT_name("maxXfrRate")
    5175                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_maxXfrRate")
    5176                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5177                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    5178              $C$DW$562       .dwtag  DW_TAG_member
    5179                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$48)
    5180                      .dwattr $C$DW$562, DW_AT_name("readAccessTime")
    5181                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_readAccessTime")
    5182                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5183                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    5184              $C$DW$563       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$48)
    5186                      .dwattr $C$DW$563, DW_AT_name("cardCapacity")
    5187                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_cardCapacity")
    5188                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5189                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    5190              $C$DW$564       .dwtag  DW_TAG_member
    5191                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$48)
    5192                      .dwattr $C$DW$564, DW_AT_name("blockLength")
    5193                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_blockLength")
    5194                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5195                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5196              $C$DW$565       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$48)
    5198                      .dwattr $C$DW$565, DW_AT_name("totalSectors")
    5199                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_totalSectors")
    5200                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5201                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5202              $C$DW$566       .dwtag  DW_TAG_member
    5203                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$48)
    5204                      .dwattr $C$DW$566, DW_AT_name("lastAddrRead")
    5205                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_lastAddrRead")
    5206                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  143

    5207                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    5208              $C$DW$567       .dwtag  DW_TAG_member
    5209                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$48)
    5210                      .dwattr $C$DW$567, DW_AT_name("lastAddrWritten")
    5211                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_lastAddrWritten")
    5212                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5213                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5214              $C$DW$568       .dwtag  DW_TAG_member
    5215                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$53)
    5216                      .dwattr $C$DW$568, DW_AT_name("cardType")
    5217                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_cardType")
    5218                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5219                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5220              $C$DW$569       .dwtag  DW_TAG_member
    5221                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$55)
    5222                      .dwattr $C$DW$569, DW_AT_name("cid")
    5223                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_cid")
    5224                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5225                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5226              $C$DW$570       .dwtag  DW_TAG_member
    5227                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$57)
    5228                      .dwattr $C$DW$570, DW_AT_name("csd")
    5229                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_csd")
    5230                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5231                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5232              $C$DW$571       .dwtag  DW_TAG_member
    5233                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$59)
    5234                      .dwattr $C$DW$571, DW_AT_name("xcsd")
    5235                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_xcsd")
    5236                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5237                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5238              $C$DW$572       .dwtag  DW_TAG_member
    5239                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$31)
    5240                      .dwattr $C$DW$572, DW_AT_name("sdHcDetected")
    5241                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_sdHcDetected")
    5242                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5243                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5244              $C$DW$573       .dwtag  DW_TAG_member
    5245                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$31)
    5246                      .dwattr $C$DW$573, DW_AT_name("cardAtaFsOpen")
    5247                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    5248                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5249                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5250              $C$DW$574       .dwtag  DW_TAG_member
    5251                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$19)
    5252                      .dwattr $C$DW$574, DW_AT_name("cardMscStatus")
    5253                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_cardMscStatus")
    5254                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5255                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5256                      .dwendtag $C$DW$T$60
    5257              
    5258              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    5259                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$60)
    5260                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    5261              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  144

    5262                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    5263                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    5264              
    5265              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    5266                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
    5267              $C$DW$575       .dwtag  DW_TAG_member
    5268                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$64)
    5269                      .dwattr $C$DW$575, DW_AT_name("isr")
    5270                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_isr")
    5271                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5272                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5273                      .dwendtag $C$DW$T$65
    5274              
    5275              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    5276                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$65)
    5277                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    5278              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    5279                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    5280                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    5281              
    5282              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5283                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    5284              $C$DW$576       .dwtag  DW_TAG_member
    5285                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$67)
    5286                      .dwattr $C$DW$576, DW_AT_name("pingPongMode")
    5287                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_pingPongMode")
    5288                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5289                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5290              $C$DW$577       .dwtag  DW_TAG_member
    5291                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$69)
    5292                      .dwattr $C$DW$577, DW_AT_name("autoMode")
    5293                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_autoMode")
    5294                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5295                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5296              $C$DW$578       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$71)
    5298                      .dwattr $C$DW$578, DW_AT_name("burstLen")
    5299                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_burstLen")
    5300                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5301                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5302              $C$DW$579       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$35)
    5304                      .dwattr $C$DW$579, DW_AT_name("trigger")
    5305                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_trigger")
    5306                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5307                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5308              $C$DW$580       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$73)
    5310                      .dwattr $C$DW$580, DW_AT_name("dmaEvt")
    5311                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_dmaEvt")
    5312                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5313                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5314              $C$DW$581       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$39)
    5316                      .dwattr $C$DW$581, DW_AT_name("dmaInt")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_dma_example.asm                                            PAGE  145

    5317                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_dmaInt")
    5318                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5319                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5320              $C$DW$582       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$33)
    5322                      .dwattr $C$DW$582, DW_AT_name("chanDir")
    5323                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_chanDir")
    5324                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5325                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    5326              $C$DW$583       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$37)
    5328                      .dwattr $C$DW$583, DW_AT_name("trfType")
    5329                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_trfType")
    5330                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5331                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    5332              $C$DW$584       .dwtag  DW_TAG_member
    5333                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$19)
    5334                      .dwattr $C$DW$584, DW_AT_name("dataLen")
    5335                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_dataLen")
    5336                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5337                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5338              $C$DW$585       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$48)
    5340                      .dwattr $C$DW$585, DW_AT_name("srcAddr")
    5341                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_srcAddr")
    5342                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5343                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5344              $C$DW$586       .dwtag  DW_TAG_member
    5345                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$48)
    5346                      .dwattr $C$DW$586, DW_AT_name("destAddr")
    5347                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_destAddr")
    5348                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5349                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5350                      .dwendtag $C$DW$T$74
    5351              
    5352              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    5353                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    5354                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    5355              
    5356              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    5357                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    5358              $C$DW$587       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$19)
    5360                      .dwattr $C$DW$587, DW_AT_name("slice127_112")
    5361                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_slice127_112")
    5362                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5363                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5364              $C$DW$588       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$19)
    5366                      .dwattr $C$DW$588, DW_AT_name("slice111_96")
    5367                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_slice111_96")
    5368                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5369                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
