TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE    1

    3463              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:33 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1968                      .dwendtag $C$DW$T$79
    1969              
    1970              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataDelay")
    1971                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1972                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1973              
    1974              $C$DW$T$81      .dwtag  DW_TAG_enumeration_type
    1975                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x01)
    1976              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
    1977              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
    1978                      .dwendtag $C$DW$T$81
    1979              
    1980              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
    1981                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1982                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1983              
    1984              $C$DW$T$83      .dwtag  DW_TAG_enumeration_type
    1985                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x01)
    1986              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
    1987              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
    1988                      .dwendtag $C$DW$T$83
    1989              
    1990              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
    1991                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    1992                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1993              
    1994              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    1995                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    1996              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
    1997              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
    1998                      .dwendtag $C$DW$T$85
    1999              
    2000              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
    2001                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2002                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2003              
    2004              $C$DW$T$87      .dwtag  DW_TAG_enumeration_type
    2005                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x01)
    2006              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
    2007              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   54

    2008              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
    2009              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
    2010              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
    2011              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
    2012              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
    2013              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
    2014                      .dwendtag $C$DW$T$87
    2015              
    2016              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
    2017                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    2018                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2019              
    2020              $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    2021                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    2022              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
    2023              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
    2024                      .dwendtag $C$DW$T$89
    2025              
    2026              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
    2027                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2028                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2029              
    2030              $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
    2031                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    2032              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
    2033              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
    2034                      .dwendtag $C$DW$T$91
    2035              
    2036              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
    2037                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2038                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2039              
    2040              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2041                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    2042              $C$DW$254       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2044                      .dwattr $C$DW$254, DW_AT_name("DMACH0SSAL")
    2045                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2046                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$255       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2050                      .dwattr $C$DW$255, DW_AT_name("DMACH0SSAU")
    2051                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2052                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2053                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$256       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2056                      .dwattr $C$DW$256, DW_AT_name("DMACH0DSAL")
    2057                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2058                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2059                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$257       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2062                      .dwattr $C$DW$257, DW_AT_name("DMACH0DSAU")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   55

    2063                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_DMACH0DSAU")
    2064                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2065                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$258       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2068                      .dwattr $C$DW$258, DW_AT_name("DMACH0TCR1")
    2069                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2070                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2071                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2072              $C$DW$259       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2074                      .dwattr $C$DW$259, DW_AT_name("DMACH0TCR2")
    2075                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2076                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2077                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$260       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    2080                      .dwattr $C$DW$260, DW_AT_name("RSVD0")
    2081                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_RSVD0")
    2082                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2083                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$261       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2086                      .dwattr $C$DW$261, DW_AT_name("DMACH1SSAL")
    2087                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2088                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2089                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2090              $C$DW$262       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2092                      .dwattr $C$DW$262, DW_AT_name("DMACH1SSAU")
    2093                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2094                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2095                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$263       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2098                      .dwattr $C$DW$263, DW_AT_name("DMACH1DSAL")
    2099                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_DMACH1DSAL")
    2100                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2101                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2102              $C$DW$264       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2104                      .dwattr $C$DW$264, DW_AT_name("DMACH1DSAU")
    2105                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_DMACH1DSAU")
    2106                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2107                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$265       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2110                      .dwattr $C$DW$265, DW_AT_name("DMACH1TCR1")
    2111                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_DMACH1TCR1")
    2112                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2113                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$266       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2116                      .dwattr $C$DW$266, DW_AT_name("DMACH1TCR2")
    2117                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_DMACH1TCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   56

    2118                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2119                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2120              $C$DW$267       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    2122                      .dwattr $C$DW$267, DW_AT_name("RSVD1")
    2123                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RSVD1")
    2124                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2125                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$268       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2128                      .dwattr $C$DW$268, DW_AT_name("DMACH2SSAL")
    2129                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2130                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2131                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$269       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2134                      .dwattr $C$DW$269, DW_AT_name("DMACH2SSAU")
    2135                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DMACH2SSAU")
    2136                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2137                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$270       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    2140                      .dwattr $C$DW$270, DW_AT_name("DMACH2DSAL")
    2141                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2142                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2143                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$271       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2146                      .dwattr $C$DW$271, DW_AT_name("DMACH2DSAU")
    2147                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2148                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2149                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$272       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2152                      .dwattr $C$DW$272, DW_AT_name("DMACH2TCR1")
    2153                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2154                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2155                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$273       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2158                      .dwattr $C$DW$273, DW_AT_name("DMACH2TCR2")
    2159                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2160                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2161                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2162              $C$DW$274       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    2164                      .dwattr $C$DW$274, DW_AT_name("RSVD2")
    2165                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_RSVD2")
    2166                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2167                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$275       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2170                      .dwattr $C$DW$275, DW_AT_name("DMACH3SSAL")
    2171                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2172                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   57

    2173                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$276       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2176                      .dwattr $C$DW$276, DW_AT_name("DMACH3SSAU")
    2177                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2178                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2179                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$277       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2182                      .dwattr $C$DW$277, DW_AT_name("DMACH3DSAL")
    2183                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2184                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2185                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$278       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2188                      .dwattr $C$DW$278, DW_AT_name("DMACH3DSAU")
    2189                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2190                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2191                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$279       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2194                      .dwattr $C$DW$279, DW_AT_name("DMACH3TCR1")
    2195                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2196                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2197                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2198              $C$DW$280       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2200                      .dwattr $C$DW$280, DW_AT_name("DMACH3TCR2")
    2201                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2202                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2203                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2204                      .dwendtag $C$DW$T$22
    2205              
    2206              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2207                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    2208                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2209              $C$DW$281       .dwtag  DW_TAG_TI_far_type
    2210                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$23)
    2211              $C$DW$282       .dwtag  DW_TAG_TI_ioport_type
    2212                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$281)
    2213              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2214                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$282)
    2215              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2216                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2217                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    2218              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2219                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2220                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2221              
    2222              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2223                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    2224              $C$DW$283       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$26)
    2226                      .dwattr $C$DW$283, DW_AT_name("dmaRegs")
    2227                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_dmaRegs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   58

    2228                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$284       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$28)
    2232                      .dwattr $C$DW$284, DW_AT_name("chanNum")
    2233                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_chanNum")
    2234                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2235                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$285       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$30)
    2238                      .dwattr $C$DW$285, DW_AT_name("dmaInstNum")
    2239                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_dmaInstNum")
    2240                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2241                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$286       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$31)
    2244                      .dwattr $C$DW$286, DW_AT_name("isChanFree")
    2245                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_isChanFree")
    2246                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2247                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$287       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$33)
    2250                      .dwattr $C$DW$287, DW_AT_name("chanDir")
    2251                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_chanDir")
    2252                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2253                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$288       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$35)
    2256                      .dwattr $C$DW$288, DW_AT_name("trigger")
    2257                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_trigger")
    2258                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2259                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$289       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$37)
    2262                      .dwattr $C$DW$289, DW_AT_name("trfType")
    2263                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_trfType")
    2264                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2265                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$290       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$39)
    2268                      .dwattr $C$DW$290, DW_AT_name("dmaInt")
    2269                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_dmaInt")
    2270                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2271                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$291       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$31)
    2274                      .dwattr $C$DW$291, DW_AT_name("pingPongEnabled")
    2275                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_pingPongEnabled")
    2276                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2277                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2278                      .dwendtag $C$DW$T$40
    2279              
    2280              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    2281                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$40)
    2282                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   59

    2283              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    2284                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2285                      .dwattr $C$DW$T$98, DW_AT_address_class(0x17)
    2286              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    2287                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    2288                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2289              
    2290              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2291                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
    2292              $C$DW$292       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$42)
    2294                      .dwattr $C$DW$292, DW_AT_name("pingPongMode")
    2295                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_pingPongMode")
    2296                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2297                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$293       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$44)
    2300                      .dwattr $C$DW$293, DW_AT_name("autoMode")
    2301                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_autoMode")
    2302                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2303                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$294       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$46)
    2306                      .dwattr $C$DW$294, DW_AT_name("burstLen")
    2307                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_burstLen")
    2308                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2309                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$295       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$35)
    2312                      .dwattr $C$DW$295, DW_AT_name("trigger")
    2313                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_trigger")
    2314                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2315                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$296       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$48)
    2318                      .dwattr $C$DW$296, DW_AT_name("dmaEvt")
    2319                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_dmaEvt")
    2320                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2321                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$297       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$39)
    2324                      .dwattr $C$DW$297, DW_AT_name("dmaInt")
    2325                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_dmaInt")
    2326                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2327                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$298       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$33)
    2330                      .dwattr $C$DW$298, DW_AT_name("chanDir")
    2331                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_chanDir")
    2332                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2333                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$299       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$37)
    2336                      .dwattr $C$DW$299, DW_AT_name("trfType")
    2337                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_trfType")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   60

    2338                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2339                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$300       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$300, DW_AT_name("dataLen")
    2343                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_dataLen")
    2344                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2345                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$301       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$49)
    2348                      .dwattr $C$DW$301, DW_AT_name("srcAddr")
    2349                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_srcAddr")
    2350                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2351                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$302       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$49)
    2354                      .dwattr $C$DW$302, DW_AT_name("destAddr")
    2355                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_destAddr")
    2356                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2357                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2358                      .dwendtag $C$DW$T$50
    2359              
    2360              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2361                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$50)
    2362                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2363              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    2364                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    2365                      .dwattr $C$DW$T$108, DW_AT_address_class(0x17)
    2366              
    2367              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2368                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x2e)
    2369              $C$DW$303       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    2371                      .dwattr $C$DW$303, DW_AT_name("I2SSCTRL")
    2372                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_I2SSCTRL")
    2373                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2375              $C$DW$304       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$51)
    2377                      .dwattr $C$DW$304, DW_AT_name("RSVD0")
    2378                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_RSVD0")
    2379                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2380                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$305       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    2383                      .dwattr $C$DW$305, DW_AT_name("I2SSRATE")
    2384                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_I2SSRATE")
    2385                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2386                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2387              $C$DW$306       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$51)
    2389                      .dwattr $C$DW$306, DW_AT_name("RSVD1")
    2390                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_RSVD1")
    2391                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2392                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   61

    2393              $C$DW$307       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    2395                      .dwattr $C$DW$307, DW_AT_name("I2STXLT0")
    2396                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_I2STXLT0")
    2397                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2398                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$308       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2401                      .dwattr $C$DW$308, DW_AT_name("I2STXLT1")
    2402                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_I2STXLT1")
    2403                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2404                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$309       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$52)
    2407                      .dwattr $C$DW$309, DW_AT_name("RSVD2")
    2408                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD2")
    2409                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2410                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2411              $C$DW$310       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2413                      .dwattr $C$DW$310, DW_AT_name("I2STXRT0")
    2414                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_I2STXRT0")
    2415                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2416                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2417              $C$DW$311       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2419                      .dwattr $C$DW$311, DW_AT_name("I2STXRT1")
    2420                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_I2STXRT1")
    2421                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2422                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2423              $C$DW$312       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$52)
    2425                      .dwattr $C$DW$312, DW_AT_name("RSVD3")
    2426                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD3")
    2427                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2428                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$313       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    2431                      .dwattr $C$DW$313, DW_AT_name("I2SINTFL")
    2432                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_I2SINTFL")
    2433                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2434                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$314       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$51)
    2437                      .dwattr $C$DW$314, DW_AT_name("RSVD4")
    2438                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD4")
    2439                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2440                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2441              $C$DW$315       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    2443                      .dwattr $C$DW$315, DW_AT_name("I2SINTMASK")
    2444                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_I2SINTMASK")
    2445                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2446                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$316       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   62

    2448                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$53)
    2449                      .dwattr $C$DW$316, DW_AT_name("RSVD5")
    2450                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_RSVD5")
    2451                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2452                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2453              $C$DW$317       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    2455                      .dwattr $C$DW$317, DW_AT_name("I2SRXLT0")
    2456                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_I2SRXLT0")
    2457                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2458                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2459              $C$DW$318       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    2461                      .dwattr $C$DW$318, DW_AT_name("I2SRXLT1")
    2462                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_I2SRXLT1")
    2463                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2464                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2465              $C$DW$319       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$52)
    2467                      .dwattr $C$DW$319, DW_AT_name("RSVD6")
    2468                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_RSVD6")
    2469                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2470                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2471              $C$DW$320       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    2473                      .dwattr $C$DW$320, DW_AT_name("I2SRXRT0")
    2474                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_I2SRXRT0")
    2475                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2476                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$321       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    2479                      .dwattr $C$DW$321, DW_AT_name("I2SRXRT1")
    2480                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_I2SRXRT1")
    2481                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2482                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2483                      .dwendtag $C$DW$T$54
    2484              
    2485              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
    2486                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$54)
    2487                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2488              $C$DW$322       .dwtag  DW_TAG_TI_far_type
    2489                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$61)
    2490              $C$DW$323       .dwtag  DW_TAG_TI_ioport_type
    2491                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$322)
    2492              $C$DW$T$62      .dwtag  DW_TAG_volatile_type
    2493                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$323)
    2494              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2495                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2496                      .dwattr $C$DW$T$63, DW_AT_address_class(0x10)
    2497              
    2498              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    2499                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
    2500              $C$DW$324       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$56)
    2502                      .dwattr $C$DW$324, DW_AT_name("i2sNum")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   63

    2503                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_i2sNum")
    2504                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$325       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$58)
    2508                      .dwattr $C$DW$325, DW_AT_name("opMode")
    2509                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_opMode")
    2510                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2511                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$326       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$60)
    2514                      .dwattr $C$DW$326, DW_AT_name("chType")
    2515                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_chType")
    2516                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2517                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$327       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$63)
    2520                      .dwattr $C$DW$327, DW_AT_name("hwRegs")
    2521                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_hwRegs")
    2522                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2523                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$328       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    2526                      .dwattr $C$DW$328, DW_AT_name("configured")
    2527                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_configured")
    2528                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2529                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$329       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$65)
    2532                      .dwattr $C$DW$329, DW_AT_name("datapack")
    2533                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_datapack")
    2534                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2535                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$330       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$67)
    2538                      .dwattr $C$DW$330, DW_AT_name("fsDiv")
    2539                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_fsDiv")
    2540                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2541                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$331       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$69)
    2544                      .dwattr $C$DW$331, DW_AT_name("wordLen")
    2545                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_wordLen")
    2546                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2547                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$332       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$71)
    2550                      .dwattr $C$DW$332, DW_AT_name("loopBackMode")
    2551                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_loopBackMode")
    2552                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2553                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$333       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$31)
    2556                      .dwattr $C$DW$333, DW_AT_name("firstRead")
    2557                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_firstRead")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   64

    2558                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2559                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2560                      .dwendtag $C$DW$T$72
    2561              
    2562              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
    2563                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$72)
    2564                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2565              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    2566                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    2567                      .dwattr $C$DW$T$110, DW_AT_address_class(0x17)
    2568              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
    2569                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    2570                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2571              
    2572              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    2573                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x0e)
    2574              $C$DW$334       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$74)
    2576                      .dwattr $C$DW$334, DW_AT_name("dataType")
    2577                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_dataType")
    2578                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$335       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$71)
    2582                      .dwattr $C$DW$335, DW_AT_name("loopBackMode")
    2583                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_loopBackMode")
    2584                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2585                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$336       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$76)
    2588                      .dwattr $C$DW$336, DW_AT_name("fsPol")
    2589                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_fsPol")
    2590                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2591                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$337       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$78)
    2594                      .dwattr $C$DW$337, DW_AT_name("clkPol")
    2595                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_clkPol")
    2596                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2597                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$338       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$80)
    2600                      .dwattr $C$DW$338, DW_AT_name("datadelay")
    2601                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_datadelay")
    2602                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2603                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2604              $C$DW$339       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$65)
    2606                      .dwattr $C$DW$339, DW_AT_name("datapack")
    2607                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_datapack")
    2608                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2609                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$340       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$82)
    2612                      .dwattr $C$DW$340, DW_AT_name("signext")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   65

    2613                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_signext")
    2614                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2615                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$341       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$69)
    2618                      .dwattr $C$DW$341, DW_AT_name("wordLen")
    2619                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_wordLen")
    2620                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2621                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$342       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$84)
    2624                      .dwattr $C$DW$342, DW_AT_name("i2sMode")
    2625                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_i2sMode")
    2626                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2627                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$343       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$86)
    2630                      .dwattr $C$DW$343, DW_AT_name("dataFormat")
    2631                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_dataFormat")
    2632                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2633                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$344       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$67)
    2636                      .dwattr $C$DW$344, DW_AT_name("fsDiv")
    2637                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_fsDiv")
    2638                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2639                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$345       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$88)
    2642                      .dwattr $C$DW$345, DW_AT_name("clkDiv")
    2643                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_clkDiv")
    2644                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2645                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$346       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$90)
    2648                      .dwattr $C$DW$346, DW_AT_name("FError")
    2649                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_FError")
    2650                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2651                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$347       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$92)
    2654                      .dwattr $C$DW$347, DW_AT_name("OuError")
    2655                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_OuError")
    2656                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2657                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2658                      .dwendtag $C$DW$T$93
    2659              
    2660              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    2661                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$93)
    2662                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2663              $C$DW$T$115     .dwtag  DW_TAG_pointer_type
    2664                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    2665                      .dwattr $C$DW$T$115, DW_AT_address_class(0x17)
    2666              
    2667              $C$DW$T$96      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   66

    2668                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x48)
    2669              $C$DW$348       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    2671                      .dwattr $C$DW$348, DW_AT_name("EBSR")
    2672                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_EBSR")
    2673                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2675              $C$DW$349       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    2677                      .dwattr $C$DW$349, DW_AT_name("RSVD0")
    2678                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD0")
    2679                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2680                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2681              $C$DW$350       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    2683                      .dwattr $C$DW$350, DW_AT_name("PCGCR1")
    2684                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_PCGCR1")
    2685                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2686                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2687              $C$DW$351       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    2689                      .dwattr $C$DW$351, DW_AT_name("PCGCR2")
    2690                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_PCGCR2")
    2691                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2692                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2693              $C$DW$352       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    2695                      .dwattr $C$DW$352, DW_AT_name("PSRCR")
    2696                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_PSRCR")
    2697                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2698                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2699              $C$DW$353       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    2701                      .dwattr $C$DW$353, DW_AT_name("PRCR")
    2702                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_PRCR")
    2703                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2704                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2705              $C$DW$354       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$94)
    2707                      .dwattr $C$DW$354, DW_AT_name("RSVD1")
    2708                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_RSVD1")
    2709                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2710                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2711              $C$DW$355       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    2713                      .dwattr $C$DW$355, DW_AT_name("TIAFR")
    2714                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_TIAFR")
    2715                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2716                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2717              $C$DW$356       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2719                      .dwattr $C$DW$356, DW_AT_name("RSVD2")
    2720                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_RSVD2")
    2721                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2722                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   67

    2723              $C$DW$357       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    2725                      .dwattr $C$DW$357, DW_AT_name("ODSCR")
    2726                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ODSCR")
    2727                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2728                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$358       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    2731                      .dwattr $C$DW$358, DW_AT_name("PDINHIBR1")
    2732                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_PDINHIBR1")
    2733                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2734                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2735              $C$DW$359       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    2737                      .dwattr $C$DW$359, DW_AT_name("PDINHIBR2")
    2738                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_PDINHIBR2")
    2739                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2740                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2741              $C$DW$360       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    2743                      .dwattr $C$DW$360, DW_AT_name("PDINHIBR3")
    2744                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_PDINHIBR3")
    2745                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2746                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2747              $C$DW$361       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    2749                      .dwattr $C$DW$361, DW_AT_name("DMA0CESR1")
    2750                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DMA0CESR1")
    2751                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2752                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2753              $C$DW$362       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2755                      .dwattr $C$DW$362, DW_AT_name("DMA0CESR2")
    2756                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_DMA0CESR2")
    2757                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2758                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2759              $C$DW$363       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    2761                      .dwattr $C$DW$363, DW_AT_name("DMA1CESR1")
    2762                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_DMA1CESR1")
    2763                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2764                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2765              $C$DW$364       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2767                      .dwattr $C$DW$364, DW_AT_name("DMA1CESR2")
    2768                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_DMA1CESR2")
    2769                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2770                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2771              $C$DW$365       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2773                      .dwattr $C$DW$365, DW_AT_name("SDRAMCCR")
    2774                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_SDRAMCCR")
    2775                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2776                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2777              $C$DW$366       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   68

    2778                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2779                      .dwattr $C$DW$366, DW_AT_name("CCR2")
    2780                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_CCR2")
    2781                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2782                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2783              $C$DW$367       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2785                      .dwattr $C$DW$367, DW_AT_name("CGCR1")
    2786                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_CGCR1")
    2787                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2788                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2789              $C$DW$368       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2791                      .dwattr $C$DW$368, DW_AT_name("CGICR")
    2792                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_CGICR")
    2793                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2794                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2795              $C$DW$369       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2797                      .dwattr $C$DW$369, DW_AT_name("CGCR2")
    2798                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_CGCR2")
    2799                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2800                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$370       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2803                      .dwattr $C$DW$370, DW_AT_name("CGOCR")
    2804                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_CGOCR")
    2805                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2806                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2807              $C$DW$371       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2809                      .dwattr $C$DW$371, DW_AT_name("CCSSR")
    2810                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_CCSSR")
    2811                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2812                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2813              $C$DW$372       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2815                      .dwattr $C$DW$372, DW_AT_name("RSVD3")
    2816                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD3")
    2817                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2818                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2819              $C$DW$373       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2821                      .dwattr $C$DW$373, DW_AT_name("ECDR")
    2822                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ECDR")
    2823                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2824                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$374       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2827                      .dwattr $C$DW$374, DW_AT_name("RSVD4")
    2828                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RSVD4")
    2829                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2830                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$375       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   69

    2833                      .dwattr $C$DW$375, DW_AT_name("RAMSLPMDCNTLR1")
    2834                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2835                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2836                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2837              $C$DW$376       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2839                      .dwattr $C$DW$376, DW_AT_name("RSVD5")
    2840                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_RSVD5")
    2841                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2842                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2843              $C$DW$377       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2845                      .dwattr $C$DW$377, DW_AT_name("RAMSLPMDCNTLR2")
    2846                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2847                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2848                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2849              $C$DW$378       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    2851                      .dwattr $C$DW$378, DW_AT_name("RAMSLPMDCNTLR3")
    2852                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2853                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2854                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2855              $C$DW$379       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    2857                      .dwattr $C$DW$379, DW_AT_name("RAMSLPMDCNTLR4")
    2858                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2859                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2860                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2861              $C$DW$380       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    2863                      .dwattr $C$DW$380, DW_AT_name("RAMSLPMDCNTLR5")
    2864                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2865                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2866                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2867              $C$DW$381       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$52)
    2869                      .dwattr $C$DW$381, DW_AT_name("RSVD6")
    2870                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD6")
    2871                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2872                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2873              $C$DW$382       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2875                      .dwattr $C$DW$382, DW_AT_name("DMAIFR")
    2876                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_DMAIFR")
    2877                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2878                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$383       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    2881                      .dwattr $C$DW$383, DW_AT_name("DMAIER")
    2882                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_DMAIER")
    2883                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2884                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$384       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    2887                      .dwattr $C$DW$384, DW_AT_name("USBSCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   70

    2888                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_USBSCR")
    2889                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2890                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$385       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    2893                      .dwattr $C$DW$385, DW_AT_name("ESCR")
    2894                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ESCR")
    2895                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2896                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2897              $C$DW$386       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$52)
    2899                      .dwattr $C$DW$386, DW_AT_name("RSVD7")
    2900                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD7")
    2901                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2902                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2903              $C$DW$387       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    2905                      .dwattr $C$DW$387, DW_AT_name("DMA2CESR1")
    2906                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DMA2CESR1")
    2907                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2908                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2909              $C$DW$388       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    2911                      .dwattr $C$DW$388, DW_AT_name("DMA2CESR2")
    2912                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DMA2CESR2")
    2913                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2914                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2915              $C$DW$389       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    2917                      .dwattr $C$DW$389, DW_AT_name("DMA3CESR1")
    2918                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_DMA3CESR1")
    2919                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2920                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$390       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    2923                      .dwattr $C$DW$390, DW_AT_name("DMA3CESR2")
    2924                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DMA3CESR2")
    2925                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2926                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2927              $C$DW$391       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    2929                      .dwattr $C$DW$391, DW_AT_name("CLKSTOP")
    2930                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_CLKSTOP")
    2931                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2932                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2933              $C$DW$392       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$95)
    2935                      .dwattr $C$DW$392, DW_AT_name("RSVD8")
    2936                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_RSVD8")
    2937                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2938                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$393       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    2941                      .dwattr $C$DW$393, DW_AT_name("DIEIDR0")
    2942                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DIEIDR0")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   71

    2943                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2944                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$394       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    2947                      .dwattr $C$DW$394, DW_AT_name("DIEIDR1")
    2948                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DIEIDR1")
    2949                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2950                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2951              $C$DW$395       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    2953                      .dwattr $C$DW$395, DW_AT_name("DIEIDR2")
    2954                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DIEIDR2")
    2955                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2956                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2957              $C$DW$396       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    2959                      .dwattr $C$DW$396, DW_AT_name("DIEIDR3")
    2960                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DIEIDR3")
    2961                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2962                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$397       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    2965                      .dwattr $C$DW$397, DW_AT_name("DIEIDR4")
    2966                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DIEIDR4")
    2967                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2968                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$398       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    2971                      .dwattr $C$DW$398, DW_AT_name("DIEIDR5")
    2972                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DIEIDR5")
    2973                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2974                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$399       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    2977                      .dwattr $C$DW$399, DW_AT_name("DIEIDR6")
    2978                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_DIEIDR6")
    2979                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2980                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$400       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    2983                      .dwattr $C$DW$400, DW_AT_name("DIEIDR7")
    2984                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_DIEIDR7")
    2985                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2986                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2987                      .dwendtag $C$DW$T$96
    2988              
    2989              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2990                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$96)
    2991                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    2992              $C$DW$401       .dwtag  DW_TAG_TI_far_type
    2993                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$116)
    2994              $C$DW$402       .dwtag  DW_TAG_TI_ioport_type
    2995                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$401)
    2996              $C$DW$T$117     .dwtag  DW_TAG_volatile_type
    2997                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$402)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_DmaExample.asm                                               PAGE   72

    2998              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    2999                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3000                      .dwattr $C$DW$T$118, DW_AT_address_class(0x10)
    3001              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3002                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3003                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3004                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3005              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3006                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3007                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3008                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3009              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3010                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3011                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3012                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3013              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3014                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3015                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3016                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3017              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3018                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3019                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3020                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3021              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3022                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$8)
    3023                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3024              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    3025                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    3026                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3027              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    3028                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    3029                      .dwattr $C$DW$T$102, DW_AT_address_class(0x17)
    3030              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    3031                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$100)
    3032              $C$DW$T$135     .dwtag  DW_TAG_volatile_type
    3033                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$403)
    3034              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3035                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3036                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3037                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
