TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE    1

    5928              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:56 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3817              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    3818                      .dwendtag $C$DW$T$74
    3819              
    3820              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    3821                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3822                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3823              
    3824              $C$DW$T$76      .dwtag  DW_TAG_enumeration_type
    3825                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
    3826              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    3827              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    3828              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  110

    3829              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    3830              $C$DW$323       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    3831                      .dwendtag $C$DW$T$76
    3832              
    3833              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    3834                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    3835                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3836              
    3837              $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    3838                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
    3839              $C$DW$324       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    3840              $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    3841              $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
    3842                      .dwendtag $C$DW$T$78
    3843              
    3844              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    3845                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3846                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3847              
    3848              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    3849                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    3850              $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    3851              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    3852              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    3853                      .dwendtag $C$DW$T$80
    3854              
    3855              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    3856                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    3857                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3858              
    3859              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3860                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3861              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    3862              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    3863              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    3864              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    3865                      .dwendtag $C$DW$T$82
    3866              
    3867              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    3868                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3869                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3870              
    3871              $C$DW$T$84      .dwtag  DW_TAG_enumeration_type
    3872                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x01)
    3873              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    3874              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    3875              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    3876              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    3877                      .dwendtag $C$DW$T$84
    3878              
    3879              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    3880                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3881                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3882              
    3883              $C$DW$T$27      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  111

    3884                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    3885              $C$DW$338       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    3887                      .dwattr $C$DW$338, DW_AT_name("REV")
    3888                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_REV")
    3889                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3890                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$339       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    3893                      .dwattr $C$DW$339, DW_AT_name("STATUS")
    3894                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_STATUS")
    3895                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3896                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$340       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$21)
    3899                      .dwattr $C$DW$340, DW_AT_name("RSVD0")
    3900                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD0")
    3901                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3902                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$341       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    3905                      .dwattr $C$DW$341, DW_AT_name("AWCCR1")
    3906                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_AWCCR1")
    3907                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3908                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$342       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    3911                      .dwattr $C$DW$342, DW_AT_name("AWCCR2")
    3912                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_AWCCR2")
    3913                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3914                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3915              $C$DW$343       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$21)
    3917                      .dwattr $C$DW$343, DW_AT_name("RSVD1")
    3918                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD1")
    3919                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3920                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3921              $C$DW$344       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    3923                      .dwattr $C$DW$344, DW_AT_name("SDCR1")
    3924                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_SDCR1")
    3925                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3926                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$345       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3929                      .dwattr $C$DW$345, DW_AT_name("SDCR2")
    3930                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_SDCR2")
    3931                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3932                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3933              $C$DW$346       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    3935                      .dwattr $C$DW$346, DW_AT_name("RSVD2")
    3936                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD2")
    3937                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3938                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  112

    3939              $C$DW$347       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    3941                      .dwattr $C$DW$347, DW_AT_name("SDRCR")
    3942                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_SDRCR")
    3943                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3944                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$348       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    3947                      .dwattr $C$DW$348, DW_AT_name("RSVD3")
    3948                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_RSVD3")
    3949                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3950                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3951              $C$DW$349       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3953                      .dwattr $C$DW$349, DW_AT_name("ACS2CR1")
    3954                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_ACS2CR1")
    3955                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3956                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3957              $C$DW$350       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    3959                      .dwattr $C$DW$350, DW_AT_name("ACS2CR2")
    3960                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ACS2CR2")
    3961                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3962                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3963              $C$DW$351       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$21)
    3965                      .dwattr $C$DW$351, DW_AT_name("RSVD4")
    3966                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RSVD4")
    3967                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3968                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3969              $C$DW$352       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    3971                      .dwattr $C$DW$352, DW_AT_name("ACS3CR1")
    3972                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_ACS3CR1")
    3973                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3974                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$353       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    3977                      .dwattr $C$DW$353, DW_AT_name("ACS3CR2")
    3978                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_ACS3CR2")
    3979                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3980                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$354       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    3983                      .dwattr $C$DW$354, DW_AT_name("RSVD5")
    3984                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_RSVD5")
    3985                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3986                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$355       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    3989                      .dwattr $C$DW$355, DW_AT_name("ACS4CR1")
    3990                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ACS4CR1")
    3991                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3992                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3993              $C$DW$356       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  113

    3994                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    3995                      .dwattr $C$DW$356, DW_AT_name("ACS4CR2")
    3996                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_ACS4CR2")
    3997                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3998                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3999              $C$DW$357       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    4001                      .dwattr $C$DW$357, DW_AT_name("RSVD6")
    4002                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_RSVD6")
    4003                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4004                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$358       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    4007                      .dwattr $C$DW$358, DW_AT_name("ACS5CR1")
    4008                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_ACS5CR1")
    4009                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4010                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$359       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    4013                      .dwattr $C$DW$359, DW_AT_name("ACS5CR2")
    4014                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ACS5CR2")
    4015                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4016                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4017              $C$DW$360       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
    4019                      .dwattr $C$DW$360, DW_AT_name("RSVD7")
    4020                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD7")
    4021                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4022                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$361       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    4025                      .dwattr $C$DW$361, DW_AT_name("SDTIMR1")
    4026                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_SDTIMR1")
    4027                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4028                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$362       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    4031                      .dwattr $C$DW$362, DW_AT_name("RSVD8")
    4032                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RSVD8")
    4033                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4034                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$363       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    4037                      .dwattr $C$DW$363, DW_AT_name("SDSRETR")
    4038                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_SDSRETR")
    4039                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4040                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4041              $C$DW$364       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    4043                      .dwattr $C$DW$364, DW_AT_name("RSVD9")
    4044                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD9")
    4045                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    4046                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$365       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  114

    4049                      .dwattr $C$DW$365, DW_AT_name("EIRR")
    4050                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_EIRR")
    4051                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4052                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$366       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    4055                      .dwattr $C$DW$366, DW_AT_name("RSVD10")
    4056                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RSVD10")
    4057                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4058                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$367       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    4061                      .dwattr $C$DW$367, DW_AT_name("EIMR")
    4062                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_EIMR")
    4063                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4064                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$368       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    4067                      .dwattr $C$DW$368, DW_AT_name("RSVD11")
    4068                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RSVD11")
    4069                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4070                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$369       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    4073                      .dwattr $C$DW$369, DW_AT_name("EIMSR")
    4074                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_EIMSR")
    4075                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4076                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$370       .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$22)
    4079                      .dwattr $C$DW$370, DW_AT_name("RSVD12")
    4080                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_RSVD12")
    4081                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    4082                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$371       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    4085                      .dwattr $C$DW$371, DW_AT_name("EIMCR")
    4086                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_EIMCR")
    4087                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4088                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$372       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$24)
    4091                      .dwattr $C$DW$372, DW_AT_name("RSVD13")
    4092                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD13")
    4093                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    4094                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$373       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    4097                      .dwattr $C$DW$373, DW_AT_name("NANDFCR")
    4098                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_NANDFCR")
    4099                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4100                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$374       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$22)
    4103                      .dwattr $C$DW$374, DW_AT_name("RSVD14")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  115

    4104                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RSVD14")
    4105                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4106                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$375       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    4109                      .dwattr $C$DW$375, DW_AT_name("NANDFSR1")
    4110                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_NANDFSR1")
    4111                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4112                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$376       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    4115                      .dwattr $C$DW$376, DW_AT_name("NANDFSR2")
    4116                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_NANDFSR2")
    4117                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4118                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$377       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    4121                      .dwattr $C$DW$377, DW_AT_name("RSVD15")
    4122                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RSVD15")
    4123                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    4124                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$378       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    4127                      .dwattr $C$DW$378, DW_AT_name("PAGEMODCTRL1")
    4128                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    4129                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4130                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$379       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    4133                      .dwattr $C$DW$379, DW_AT_name("PAGEMODCTRL2")
    4134                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    4135                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    4136                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$380       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$25)
    4139                      .dwattr $C$DW$380, DW_AT_name("RSVD16")
    4140                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_RSVD16")
    4141                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    4142                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4143              $C$DW$381       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    4145                      .dwattr $C$DW$381, DW_AT_name("NCS2ECC1")
    4146                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_NCS2ECC1")
    4147                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4148                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4149              $C$DW$382       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    4151                      .dwattr $C$DW$382, DW_AT_name("NCS2ECC2")
    4152                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_NCS2ECC2")
    4153                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    4154                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4155              $C$DW$383       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    4157                      .dwattr $C$DW$383, DW_AT_name("RSVD17")
    4158                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD17")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  116

    4159                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    4160                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$384       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    4163                      .dwattr $C$DW$384, DW_AT_name("NCS3ECC1")
    4164                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_NCS3ECC1")
    4165                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4166                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$385       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    4169                      .dwattr $C$DW$385, DW_AT_name("NCS3ECC2")
    4170                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_NCS3ECC2")
    4171                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
    4172                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$386       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    4175                      .dwattr $C$DW$386, DW_AT_name("RSVD18")
    4176                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD18")
    4177                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    4178                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4179              $C$DW$387       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    4181                      .dwattr $C$DW$387, DW_AT_name("NCS4ECC1")
    4182                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_NCS4ECC1")
    4183                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4184                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4185              $C$DW$388       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    4187                      .dwattr $C$DW$388, DW_AT_name("NCS4ECC2")
    4188                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_NCS4ECC2")
    4189                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    4190                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4191              $C$DW$389       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
    4193                      .dwattr $C$DW$389, DW_AT_name("RSVD19")
    4194                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RSVD19")
    4195                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4196                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4197              $C$DW$390       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    4199                      .dwattr $C$DW$390, DW_AT_name("NCS5ECC1")
    4200                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_NCS5ECC1")
    4201                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4202                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4203              $C$DW$391       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    4205                      .dwattr $C$DW$391, DW_AT_name("NCS5ECC2")
    4206                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_NCS5ECC2")
    4207                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    4208                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4209              $C$DW$392       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$26)
    4211                      .dwattr $C$DW$392, DW_AT_name("RSVD20")
    4212                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_RSVD20")
    4213                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  117

    4214                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$393       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    4217                      .dwattr $C$DW$393, DW_AT_name("NAND4BITECCLOAD")
    4218                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    4219                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4220                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$394       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$22)
    4223                      .dwattr $C$DW$394, DW_AT_name("RSVD21")
    4224                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_RSVD21")
    4225                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    4226                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$395       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    4229                      .dwattr $C$DW$395, DW_AT_name("NAND4BITECC1")
    4230                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_NAND4BITECC1")
    4231                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4232                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$396       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    4235                      .dwattr $C$DW$396, DW_AT_name("NAND4BITECC2")
    4236                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_NAND4BITECC2")
    4237                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    4238                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$397       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    4241                      .dwattr $C$DW$397, DW_AT_name("RSVD22")
    4242                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_RSVD22")
    4243                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    4244                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$398       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    4247                      .dwattr $C$DW$398, DW_AT_name("NAND4BITECC3")
    4248                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_NAND4BITECC3")
    4249                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4250                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$399       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    4253                      .dwattr $C$DW$399, DW_AT_name("NAND4BITECC4")
    4254                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_NAND4BITECC4")
    4255                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4256                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$400       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    4259                      .dwattr $C$DW$400, DW_AT_name("RSVD23")
    4260                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_RSVD23")
    4261                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4262                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$401       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    4265                      .dwattr $C$DW$401, DW_AT_name("NAND4BITECC5")
    4266                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_NAND4BITECC5")
    4267                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4268                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  118

    4269              $C$DW$402       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    4271                      .dwattr $C$DW$402, DW_AT_name("NAND4BITECC6")
    4272                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_NAND4BITECC6")
    4273                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    4274                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$403       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    4277                      .dwattr $C$DW$403, DW_AT_name("RSVD24")
    4278                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_RSVD24")
    4279                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4280                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$404       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    4283                      .dwattr $C$DW$404, DW_AT_name("NAND4BITECC7")
    4284                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_NAND4BITECC7")
    4285                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4286                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$405       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    4289                      .dwattr $C$DW$405, DW_AT_name("NAND4BITECC8")
    4290                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_NAND4BITECC8")
    4291                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    4292                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$406       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    4295                      .dwattr $C$DW$406, DW_AT_name("RSVD25")
    4296                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD25")
    4297                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4298                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$407       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    4301                      .dwattr $C$DW$407, DW_AT_name("NANDERRADD1")
    4302                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_NANDERRADD1")
    4303                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4304                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$408       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    4307                      .dwattr $C$DW$408, DW_AT_name("NANDERRADD2")
    4308                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_NANDERRADD2")
    4309                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    4310                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$409       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    4313                      .dwattr $C$DW$409, DW_AT_name("RSVD26")
    4314                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD26")
    4315                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4316                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$410       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    4319                      .dwattr $C$DW$410, DW_AT_name("NANDERRADD3")
    4320                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_NANDERRADD3")
    4321                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4322                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$411       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  119

    4324                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    4325                      .dwattr $C$DW$411, DW_AT_name("NANDERRADD4")
    4326                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_NANDERRADD4")
    4327                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    4328                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$412       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$21)
    4331                      .dwattr $C$DW$412, DW_AT_name("RSVD27")
    4332                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RSVD27")
    4333                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4334                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$413       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    4337                      .dwattr $C$DW$413, DW_AT_name("NANDERRVAL1")
    4338                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_NANDERRVAL1")
    4339                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4340                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$414       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    4343                      .dwattr $C$DW$414, DW_AT_name("NANDERRVAL2")
    4344                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_NANDERRVAL2")
    4345                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    4346                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$415       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    4349                      .dwattr $C$DW$415, DW_AT_name("RSVD28")
    4350                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RSVD28")
    4351                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4352                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$416       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    4355                      .dwattr $C$DW$416, DW_AT_name("NANDERRVAL3")
    4356                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_NANDERRVAL3")
    4357                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4358                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$417       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    4361                      .dwattr $C$DW$417, DW_AT_name("NANDERRVAL4")
    4362                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_NANDERRVAL4")
    4363                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    4364                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4365                      .dwendtag $C$DW$T$27
    4366              
    4367              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    4368                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$27)
    4369                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4370              $C$DW$418       .dwtag  DW_TAG_TI_far_type
    4371                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$91)
    4372              $C$DW$419       .dwtag  DW_TAG_TI_ioport_type
    4373                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$418)
    4374              $C$DW$T$92      .dwtag  DW_TAG_volatile_type
    4375                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$419)
    4376              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    4377                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4378                      .dwattr $C$DW$T$93, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  120

    4379              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    4380                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4381                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4382              
    4383              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4384                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    4385              $C$DW$420       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    4387                      .dwattr $C$DW$420, DW_AT_name("EBSR")
    4388                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_EBSR")
    4389                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4390                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4391              $C$DW$421       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    4393                      .dwattr $C$DW$421, DW_AT_name("RSVD0")
    4394                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_RSVD0")
    4395                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4396                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4397              $C$DW$422       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    4399                      .dwattr $C$DW$422, DW_AT_name("PCGCR1")
    4400                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_PCGCR1")
    4401                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4402                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4403              $C$DW$423       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    4405                      .dwattr $C$DW$423, DW_AT_name("PCGCR2")
    4406                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_PCGCR2")
    4407                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4408                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4409              $C$DW$424       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    4411                      .dwattr $C$DW$424, DW_AT_name("PSRCR")
    4412                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_PSRCR")
    4413                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4414                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4415              $C$DW$425       .dwtag  DW_TAG_member
    4416                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    4417                      .dwattr $C$DW$425, DW_AT_name("PRCR")
    4418                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_PRCR")
    4419                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4420                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4421              $C$DW$426       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$28)
    4423                      .dwattr $C$DW$426, DW_AT_name("RSVD1")
    4424                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_RSVD1")
    4425                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4426                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4427              $C$DW$427       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4429                      .dwattr $C$DW$427, DW_AT_name("TIAFR")
    4430                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_TIAFR")
    4431                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4432                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4433              $C$DW$428       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  121

    4434                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4435                      .dwattr $C$DW$428, DW_AT_name("RSVD2")
    4436                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_RSVD2")
    4437                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4438                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4439              $C$DW$429       .dwtag  DW_TAG_member
    4440                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4441                      .dwattr $C$DW$429, DW_AT_name("ODSCR")
    4442                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_ODSCR")
    4443                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4444                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$430       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4447                      .dwattr $C$DW$430, DW_AT_name("PDINHIBR1")
    4448                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_PDINHIBR1")
    4449                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4450                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4451              $C$DW$431       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4453                      .dwattr $C$DW$431, DW_AT_name("PDINHIBR2")
    4454                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_PDINHIBR2")
    4455                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4456                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$432       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    4459                      .dwattr $C$DW$432, DW_AT_name("PDINHIBR3")
    4460                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_PDINHIBR3")
    4461                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4462                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4463              $C$DW$433       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    4465                      .dwattr $C$DW$433, DW_AT_name("DMA0CESR1")
    4466                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMA0CESR1")
    4467                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4468                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4469              $C$DW$434       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    4471                      .dwattr $C$DW$434, DW_AT_name("DMA0CESR2")
    4472                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_DMA0CESR2")
    4473                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4474                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4475              $C$DW$435       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4477                      .dwattr $C$DW$435, DW_AT_name("DMA1CESR1")
    4478                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMA1CESR1")
    4479                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4480                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4481              $C$DW$436       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4483                      .dwattr $C$DW$436, DW_AT_name("DMA1CESR2")
    4484                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMA1CESR2")
    4485                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4486                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4487              $C$DW$437       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  122

    4489                      .dwattr $C$DW$437, DW_AT_name("SDRAMCCR")
    4490                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_SDRAMCCR")
    4491                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4492                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4493              $C$DW$438       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4495                      .dwattr $C$DW$438, DW_AT_name("CCR2")
    4496                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_CCR2")
    4497                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4498                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4499              $C$DW$439       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4501                      .dwattr $C$DW$439, DW_AT_name("CGCR1")
    4502                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_CGCR1")
    4503                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4504                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4505              $C$DW$440       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    4507                      .dwattr $C$DW$440, DW_AT_name("CGICR")
    4508                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_CGICR")
    4509                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4510                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$441       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    4513                      .dwattr $C$DW$441, DW_AT_name("CGCR2")
    4514                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_CGCR2")
    4515                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4516                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4517              $C$DW$442       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    4519                      .dwattr $C$DW$442, DW_AT_name("CGOCR")
    4520                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_CGOCR")
    4521                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4522                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$443       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    4525                      .dwattr $C$DW$443, DW_AT_name("CCSSR")
    4526                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_CCSSR")
    4527                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4528                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4529              $C$DW$444       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    4531                      .dwattr $C$DW$444, DW_AT_name("RSVD3")
    4532                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD3")
    4533                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4534                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4535              $C$DW$445       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    4537                      .dwattr $C$DW$445, DW_AT_name("ECDR")
    4538                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ECDR")
    4539                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4540                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4541              $C$DW$446       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4543                      .dwattr $C$DW$446, DW_AT_name("RSVD4")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  123

    4544                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD4")
    4545                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4546                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4547              $C$DW$447       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    4549                      .dwattr $C$DW$447, DW_AT_name("RAMSLPMDCNTLR1")
    4550                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4551                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4552                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$448       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    4555                      .dwattr $C$DW$448, DW_AT_name("RSVD5")
    4556                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_RSVD5")
    4557                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4558                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$449       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4561                      .dwattr $C$DW$449, DW_AT_name("RAMSLPMDCNTLR2")
    4562                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4563                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4564                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$450       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4567                      .dwattr $C$DW$450, DW_AT_name("RAMSLPMDCNTLR3")
    4568                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4569                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4570                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$451       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4573                      .dwattr $C$DW$451, DW_AT_name("RAMSLPMDCNTLR4")
    4574                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4575                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4576                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$452       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4579                      .dwattr $C$DW$452, DW_AT_name("RAMSLPMDCNTLR5")
    4580                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4581                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4582                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$453       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    4585                      .dwattr $C$DW$453, DW_AT_name("RSVD6")
    4586                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD6")
    4587                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4588                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$454       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4591                      .dwattr $C$DW$454, DW_AT_name("DMAIFR")
    4592                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_DMAIFR")
    4593                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4594                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$455       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4597                      .dwattr $C$DW$455, DW_AT_name("DMAIER")
    4598                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_DMAIER")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  124

    4599                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4600                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$456       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4603                      .dwattr $C$DW$456, DW_AT_name("USBSCR")
    4604                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_USBSCR")
    4605                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4606                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$457       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4609                      .dwattr $C$DW$457, DW_AT_name("ESCR")
    4610                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_ESCR")
    4611                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4612                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$458       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$21)
    4615                      .dwattr $C$DW$458, DW_AT_name("RSVD7")
    4616                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_RSVD7")
    4617                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4618                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$459       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4621                      .dwattr $C$DW$459, DW_AT_name("DMA2CESR1")
    4622                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_DMA2CESR1")
    4623                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4624                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4625              $C$DW$460       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4627                      .dwattr $C$DW$460, DW_AT_name("DMA2CESR2")
    4628                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_DMA2CESR2")
    4629                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4630                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4631              $C$DW$461       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4633                      .dwattr $C$DW$461, DW_AT_name("DMA3CESR1")
    4634                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_DMA3CESR1")
    4635                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4636                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4637              $C$DW$462       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4639                      .dwattr $C$DW$462, DW_AT_name("DMA3CESR2")
    4640                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_DMA3CESR2")
    4641                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4642                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4643              $C$DW$463       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4645                      .dwattr $C$DW$463, DW_AT_name("CLKSTOP")
    4646                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_CLKSTOP")
    4647                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4648                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$464       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$29)
    4651                      .dwattr $C$DW$464, DW_AT_name("RSVD8")
    4652                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_RSVD8")
    4653                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  125

    4654                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$465       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    4657                      .dwattr $C$DW$465, DW_AT_name("DIEIDR0")
    4658                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_DIEIDR0")
    4659                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4660                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4661              $C$DW$466       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4663                      .dwattr $C$DW$466, DW_AT_name("DIEIDR1")
    4664                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_DIEIDR1")
    4665                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4666                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4667              $C$DW$467       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    4669                      .dwattr $C$DW$467, DW_AT_name("DIEIDR2")
    4670                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_DIEIDR2")
    4671                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4672                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4673              $C$DW$468       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    4675                      .dwattr $C$DW$468, DW_AT_name("DIEIDR3")
    4676                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_DIEIDR3")
    4677                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4678                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4679              $C$DW$469       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    4681                      .dwattr $C$DW$469, DW_AT_name("DIEIDR4")
    4682                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_DIEIDR4")
    4683                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4684                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4685              $C$DW$470       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    4687                      .dwattr $C$DW$470, DW_AT_name("DIEIDR5")
    4688                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_DIEIDR5")
    4689                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4690                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4691              $C$DW$471       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    4693                      .dwattr $C$DW$471, DW_AT_name("DIEIDR6")
    4694                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_DIEIDR6")
    4695                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4696                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4697              $C$DW$472       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    4699                      .dwattr $C$DW$472, DW_AT_name("DIEIDR7")
    4700                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_DIEIDR7")
    4701                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4702                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4703                      .dwendtag $C$DW$T$30
    4704              
    4705              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4706                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$30)
    4707                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4708              $C$DW$473       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  126

    4709                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$95)
    4710              $C$DW$474       .dwtag  DW_TAG_TI_ioport_type
    4711                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$473)
    4712              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
    4713                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$474)
    4714              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4715                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4716                      .dwattr $C$DW$T$97, DW_AT_address_class(0x10)
    4717              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4718                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4719                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4720              
    4721              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4722                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x66)
    4723              $C$DW$475       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    4725                      .dwattr $C$DW$475, DW_AT_name("DMACH0SSAL")
    4726                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_DMACH0SSAL")
    4727                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4728                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$476       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    4731                      .dwattr $C$DW$476, DW_AT_name("DMACH0SSAU")
    4732                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_DMACH0SSAU")
    4733                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4734                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$477       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    4737                      .dwattr $C$DW$477, DW_AT_name("DMACH0DSAL")
    4738                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_DMACH0DSAL")
    4739                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4740                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4741              $C$DW$478       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    4743                      .dwattr $C$DW$478, DW_AT_name("DMACH0DSAU")
    4744                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_DMACH0DSAU")
    4745                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4746                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4747              $C$DW$479       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    4749                      .dwattr $C$DW$479, DW_AT_name("DMACH0TCR1")
    4750                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_DMACH0TCR1")
    4751                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4752                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4753              $C$DW$480       .dwtag  DW_TAG_member
    4754                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    4755                      .dwattr $C$DW$480, DW_AT_name("DMACH0TCR2")
    4756                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_DMACH0TCR2")
    4757                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4758                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4759              $C$DW$481       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$31)
    4761                      .dwattr $C$DW$481, DW_AT_name("RSVD0")
    4762                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RSVD0")
    4763                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  127

    4764                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$482       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    4767                      .dwattr $C$DW$482, DW_AT_name("DMACH1SSAL")
    4768                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_DMACH1SSAL")
    4769                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4770                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4771              $C$DW$483       .dwtag  DW_TAG_member
    4772                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    4773                      .dwattr $C$DW$483, DW_AT_name("DMACH1SSAU")
    4774                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_DMACH1SSAU")
    4775                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4776                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4777              $C$DW$484       .dwtag  DW_TAG_member
    4778                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    4779                      .dwattr $C$DW$484, DW_AT_name("DMACH1DSAL")
    4780                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_DMACH1DSAL")
    4781                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4782                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4783              $C$DW$485       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    4785                      .dwattr $C$DW$485, DW_AT_name("DMACH1DSAU")
    4786                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_DMACH1DSAU")
    4787                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4788                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4789              $C$DW$486       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    4791                      .dwattr $C$DW$486, DW_AT_name("DMACH1TCR1")
    4792                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_DMACH1TCR1")
    4793                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4794                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4795              $C$DW$487       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    4797                      .dwattr $C$DW$487, DW_AT_name("DMACH1TCR2")
    4798                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_DMACH1TCR2")
    4799                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4800                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4801              $C$DW$488       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$31)
    4803                      .dwattr $C$DW$488, DW_AT_name("RSVD1")
    4804                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD1")
    4805                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4806                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4807              $C$DW$489       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
    4809                      .dwattr $C$DW$489, DW_AT_name("DMACH2SSAL")
    4810                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_DMACH2SSAL")
    4811                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4812                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$490       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    4815                      .dwattr $C$DW$490, DW_AT_name("DMACH2SSAU")
    4816                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_DMACH2SSAU")
    4817                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4818                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  128

    4819              $C$DW$491       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
    4821                      .dwattr $C$DW$491, DW_AT_name("DMACH2DSAL")
    4822                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_DMACH2DSAL")
    4823                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4824                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4825              $C$DW$492       .dwtag  DW_TAG_member
    4826                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    4827                      .dwattr $C$DW$492, DW_AT_name("DMACH2DSAU")
    4828                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_DMACH2DSAU")
    4829                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4830                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$493       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    4833                      .dwattr $C$DW$493, DW_AT_name("DMACH2TCR1")
    4834                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_DMACH2TCR1")
    4835                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4836                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4837              $C$DW$494       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    4839                      .dwattr $C$DW$494, DW_AT_name("DMACH2TCR2")
    4840                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_DMACH2TCR2")
    4841                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4842                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$495       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$31)
    4845                      .dwattr $C$DW$495, DW_AT_name("RSVD2")
    4846                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_RSVD2")
    4847                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4848                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4849              $C$DW$496       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
    4851                      .dwattr $C$DW$496, DW_AT_name("DMACH3SSAL")
    4852                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_DMACH3SSAL")
    4853                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4854                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4855              $C$DW$497       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    4857                      .dwattr $C$DW$497, DW_AT_name("DMACH3SSAU")
    4858                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_DMACH3SSAU")
    4859                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4860                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4861              $C$DW$498       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    4863                      .dwattr $C$DW$498, DW_AT_name("DMACH3DSAL")
    4864                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_DMACH3DSAL")
    4865                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4866                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4867              $C$DW$499       .dwtag  DW_TAG_member
    4868                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    4869                      .dwattr $C$DW$499, DW_AT_name("DMACH3DSAU")
    4870                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_DMACH3DSAU")
    4871                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4872                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$500       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  129

    4874                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    4875                      .dwattr $C$DW$500, DW_AT_name("DMACH3TCR1")
    4876                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_DMACH3TCR1")
    4877                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4878                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4879              $C$DW$501       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
    4881                      .dwattr $C$DW$501, DW_AT_name("DMACH3TCR2")
    4882                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_DMACH3TCR2")
    4883                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4884                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4885                      .dwendtag $C$DW$T$32
    4886              
    4887              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    4888                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4889                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4890              $C$DW$502       .dwtag  DW_TAG_TI_far_type
    4891                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$33)
    4892              $C$DW$503       .dwtag  DW_TAG_TI_ioport_type
    4893                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$502)
    4894              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    4895                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$503)
    4896              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4897                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4898                      .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    4899              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    4900                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4901                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4902              
    4903              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4904                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x09)
    4905              $C$DW$504       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$36)
    4907                      .dwattr $C$DW$504, DW_AT_name("dmaRegs")
    4908                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_dmaRegs")
    4909                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4910                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$505       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$38)
    4913                      .dwattr $C$DW$505, DW_AT_name("chanNum")
    4914                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_chanNum")
    4915                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4916                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$506       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$40)
    4919                      .dwattr $C$DW$506, DW_AT_name("dmaInstNum")
    4920                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_dmaInstNum")
    4921                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4922                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4923              $C$DW$507       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$41)
    4925                      .dwattr $C$DW$507, DW_AT_name("isChanFree")
    4926                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_isChanFree")
    4927                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4928                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  130

    4929              $C$DW$508       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$43)
    4931                      .dwattr $C$DW$508, DW_AT_name("chanDir")
    4932                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_chanDir")
    4933                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4934                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$509       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$45)
    4937                      .dwattr $C$DW$509, DW_AT_name("trigger")
    4938                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_trigger")
    4939                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4940                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$510       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$47)
    4943                      .dwattr $C$DW$510, DW_AT_name("trfType")
    4944                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_trfType")
    4945                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4946                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4947              $C$DW$511       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$49)
    4949                      .dwattr $C$DW$511, DW_AT_name("dmaInt")
    4950                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_dmaInt")
    4951                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4952                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4953              $C$DW$512       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$41)
    4955                      .dwattr $C$DW$512, DW_AT_name("pingPongEnabled")
    4956                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_pingPongEnabled")
    4957                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4958                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4959                      .dwendtag $C$DW$T$50
    4960              
    4961              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    4962                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$50)
    4963                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4964              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4965                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4966                      .dwattr $C$DW$T$104, DW_AT_address_class(0x17)
    4967              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    4968                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    4969                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4970              
    4971              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4972                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x0e)
    4973              $C$DW$513       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$52)
    4975                      .dwattr $C$DW$513, DW_AT_name("pingPongMode")
    4976                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_pingPongMode")
    4977                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4978                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4979              $C$DW$514       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4981                      .dwattr $C$DW$514, DW_AT_name("autoMode")
    4982                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_autoMode")
    4983                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dma_example.asm                                             PAGE  131

    4984                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4985              $C$DW$515       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$56)
    4987                      .dwattr $C$DW$515, DW_AT_name("burstLen")
    4988                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_burstLen")
    4989                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4990                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4991              $C$DW$516       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$45)
    4993                      .dwattr $C$DW$516, DW_AT_name("trigger")
    4994                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_trigger")
    4995                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4996                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$517       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$58)
    4999                      .dwattr $C$DW$517, DW_AT_name("dmaEvt")
    5000                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_dmaEvt")
    5001                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5002                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$518       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$49)
    5005                      .dwattr $C$DW$518, DW_AT_name("dmaInt")
    5006                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_dmaInt")
    5007                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5008                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5009              $C$DW$519       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$43)
    5011                      .dwattr $C$DW$519, DW_AT_name("chanDir")
    5012                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_chanDir")
    5013                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5014                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$520       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$47)
    5017                      .dwattr $C$DW$520, DW_AT_name("trfType")
    5018                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_trfType")
