TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE    1

    1496              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:40 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     653                      .dwendtag $C$DW$50
     654              
     655              
     656              $C$DW$57        .dwtag  DW_TAG_TI_loop
     657                      .dwattr $C$DW$57, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L9:1:1538287780")
     658                      .dwattr $C$DW$57, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv
     659                      .dwattr $C$DW$57, DW_AT_TI_begin_line(0x4e)
     660                      .dwattr $C$DW$57, DW_AT_TI_end_line(0x53)
     661              $C$DW$58        .dwtag  DW_TAG_TI_loop_range
     662                      .dwattr $C$DW$58, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$12$B)
     663                      .dwattr $C$DW$58, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$12$E)
     664              $C$DW$59        .dwtag  DW_TAG_TI_loop_range
     665                      .dwattr $C$DW$59, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$16$B)
     666                      .dwattr $C$DW$59, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$16$E)
     667              
     668              $C$DW$60        .dwtag  DW_TAG_TI_loop
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   16

     669                      .dwattr $C$DW$60, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L10:2:1538287780")
     670                      .dwattr $C$DW$60, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv
     671                      .dwattr $C$DW$60, DW_AT_TI_begin_line(0x51)
     672                      .dwattr $C$DW$60, DW_AT_TI_end_line(0x52)
     673              $C$DW$61        .dwtag  DW_TAG_TI_loop_range
     674                      .dwattr $C$DW$61, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$13$B)
     675                      .dwattr $C$DW$61, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$13$E)
     676              $C$DW$62        .dwtag  DW_TAG_TI_loop_range
     677                      .dwattr $C$DW$62, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$14$B)
     678                      .dwattr $C$DW$62, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$14$E)
     679              $C$DW$63        .dwtag  DW_TAG_TI_loop_range
     680                      .dwattr $C$DW$63, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$15$B)
     681                      .dwattr $C$DW$63, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$15$E)
     682                      .dwendtag $C$DW$60
     683              
     684                      .dwendtag $C$DW$57
     685              
     686              
     687              $C$DW$64        .dwtag  DW_TAG_TI_loop
     688                      .dwattr $C$DW$64, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L6:1:1538287780")
     689                      .dwattr $C$DW$64, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv
     690                      .dwattr $C$DW$64, DW_AT_TI_begin_line(0x48)
     691                      .dwattr $C$DW$64, DW_AT_TI_end_line(0x4b)
     692              $C$DW$65        .dwtag  DW_TAG_TI_loop_range
     693                      .dwattr $C$DW$65, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$7$B)
     694                      .dwattr $C$DW$65, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$7$E)
     695              $C$DW$66        .dwtag  DW_TAG_TI_loop_range
     696                      .dwattr $C$DW$66, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$8$B)
     697                      .dwattr $C$DW$66, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$8$E)
     698              $C$DW$67        .dwtag  DW_TAG_TI_loop_range
     699                      .dwattr $C$DW$67, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$9$B)
     700                      .dwattr $C$DW$67, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$9$E)
     701                      .dwendtag $C$DW$64
     702              
     703                      .dwattr $C$DW$25, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/a
     704                      .dwattr $C$DW$25, DW_AT_TI_end_line(0x66)
     705                      .dwattr $C$DW$25, DW_AT_TI_end_column(0x01)
     706                      .dwendentry
     707                      .dwendtag $C$DW$25
     708              
     709              ;******************************************************************************
     710              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     711              ;******************************************************************************
     712                      .global __AtaReadSector
     713                      .global __AtaCalculatePhySectorAndOffsetOfFatEntry
     714                      .global __AtaReadFatEntryAtPhySector
     715                      .global __mpyli
     716                      .global __divul
     717              
     718              ;*******************************************************************************
     719              ;* TYPE INFORMATION                                                            *
     720              ;*******************************************************************************
     721              
     722              $C$DW$T$49      .dwtag  DW_TAG_structure_type
     723                      .dwattr $C$DW$T$49, DW_AT_name("AtaStateStruct")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   17

     724                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x44)
     725              $C$DW$68        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     727                      .dwattr $C$DW$68, DW_AT_name("BootPhySector")
     728                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_BootPhySector")
     729                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     731              $C$DW$69        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
     733                      .dwattr $C$DW$69, DW_AT_name("FatType")
     734                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_FatType")
     735                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     736                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$70        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
     739                      .dwattr $C$DW$70, DW_AT_name("WordsPerLogSector")
     740                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_WordsPerLogSector")
     741                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     742                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     743              $C$DW$71        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
     745                      .dwattr $C$DW$71, DW_AT_name("LogSectorsPerCluster")
     746                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
     747                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     748                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     749              $C$DW$72        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
     751                      .dwattr $C$DW$72, DW_AT_name("RootDirEntries")
     752                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RootDirEntries")
     753                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     754                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     755              $C$DW$73        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
     757                      .dwattr $C$DW$73, DW_AT_name("LogSectorsPerFat")
     758                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_LogSectorsPerFat")
     759                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     760                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     761              $C$DW$74        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
     763                      .dwattr $C$DW$74, DW_AT_name("FirstFatSector")
     764                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_FirstFatSector")
     765                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     766                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$75        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
     769                      .dwattr $C$DW$75, DW_AT_name("RootDirSector")
     770                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RootDirSector")
     771                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     772                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$76        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
     775                      .dwattr $C$DW$76, DW_AT_name("FirstDataSector")
     776                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_FirstDataSector")
     777                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     778                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   18

     779              $C$DW$77        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
     781                      .dwattr $C$DW$77, DW_AT_name("TotalSectors")
     782                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_TotalSectors")
     783                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     784                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$78        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
     787                      .dwattr $C$DW$78, DW_AT_name("Data")
     788                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Data")
     789                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     790                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     791              $C$DW$79        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
     793                      .dwattr $C$DW$79, DW_AT_name("CurrentWord")
     794                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CurrentWord")
     795                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     796                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     797              $C$DW$80        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     799                      .dwattr $C$DW$80, DW_AT_name("CurrentPhySector")
     800                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_CurrentPhySector")
     801                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     802                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$81        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
     805                      .dwattr $C$DW$81, DW_AT_name("WordsPerCluster")
     806                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_WordsPerCluster")
     807                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     808                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$82        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
     811                      .dwattr $C$DW$82, DW_AT_name("NumberOfFats")
     812                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_NumberOfFats")
     813                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     814                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     815              $C$DW$83        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
     817                      .dwattr $C$DW$83, DW_AT_name("MFWFlag")
     818                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_MFWFlag")
     819                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     820                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$84        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
     823                      .dwattr $C$DW$84, DW_AT_name("Err_Status")
     824                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Err_Status")
     825                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     826                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     827              $C$DW$85        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$3)
     829                      .dwattr $C$DW$85, DW_AT_name("pAtaMediaState")
     830                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_pAtaMediaState")
     831                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     832                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     833              $C$DW$86        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   19

     834                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$26)
     835                      .dwattr $C$DW$86, DW_AT_name("AtaReset")
     836                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_AtaReset")
     837                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     838                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$87        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$28)
     841                      .dwattr $C$DW$87, DW_AT_name("AtaCommandReadyStatusCheck")
     842                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
     843                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     844                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$88        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$26)
     847                      .dwattr $C$DW$88, DW_AT_name("AtaBusyStatusCheck")
     848                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
     849                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     850                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     851              $C$DW$89        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$33)
     853                      .dwattr $C$DW$89, DW_AT_name("AtaGetSerialID")
     854                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_AtaGetSerialID")
     855                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     856                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     857              $C$DW$90        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$35)
     859                      .dwattr $C$DW$90, DW_AT_name("AtaIssueReadCommand")
     860                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
     861                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     862                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     863              $C$DW$91        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
     865                      .dwattr $C$DW$91, DW_AT_name("AtaDataReadyStatusCheck")
     866                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
     867                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     868                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     869              $C$DW$92        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$38)
     871                      .dwattr $C$DW$92, DW_AT_name("AtaReadNextWord")
     872                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_AtaReadNextWord")
     873                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     874                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$93        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$40)
     877                      .dwattr $C$DW$93, DW_AT_name("AtaReadNextWord1")
     878                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_AtaReadNextWord1")
     879                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     880                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     881              $C$DW$94        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$40)
     883                      .dwattr $C$DW$94, DW_AT_name("AtaReadNextNWords")
     884                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_AtaReadNextNWords")
     885                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     886                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$95        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$42)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   20

     889                      .dwattr $C$DW$95, DW_AT_name("AtaWriteSector")
     890                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_AtaWriteSector")
     891                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     892                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$96        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
     895                      .dwattr $C$DW$96, DW_AT_name("AtaWriteSectorFlush")
     896                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
     897                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     898                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     899              $C$DW$97        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
     901                      .dwattr $C$DW$97, DW_AT_name("AtaInitAtaMediaState")
     902                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
     903                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     904                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$98        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
     907                      .dwattr $C$DW$98, DW_AT_name("AtaFlushFat")
     908                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_AtaFlushFat")
     909                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     910                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     911              $C$DW$99        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$44)
     913                      .dwattr $C$DW$99, DW_AT_name("AtaErrorCallback")
     914                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_AtaErrorCallback")
     915                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     916                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$100       .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$46)
     919                      .dwattr $C$DW$100, DW_AT_name("AtaFileSystemType")
     920                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_AtaFileSystemType")
     921                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     922                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$101       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$48)
     925                      .dwattr $C$DW$101, DW_AT_name("get_mod_time")
     926                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_get_mod_time")
     927                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     928                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$102       .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$48)
     931                      .dwattr $C$DW$102, DW_AT_name("get_mod_date")
     932                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_get_mod_date")
     933                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     934                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$103       .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$48)
     937                      .dwattr $C$DW$103, DW_AT_name("get_time")
     938                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_get_time")
     939                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     940                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$104       .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$48)
     943                      .dwattr $C$DW$104, DW_AT_name("get_date")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   21

     944                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_get_date")
     945                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     946                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$105       .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
     949                      .dwattr $C$DW$105, DW_AT_name("_AtaWriteBuffer")
     950                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("__AtaWriteBuffer")
     951                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     952                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     953              $C$DW$106       .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     955                      .dwattr $C$DW$106, DW_AT_name("_AtaWriteCurrentPhySector")
     956                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
     957                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     958                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     959                      .dwendtag $C$DW$T$49
     960              
     961              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
     962                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     963                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     964              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
     965                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     966                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
     967              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     968                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
     969              
     970              $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
     971                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     972              $C$DW$107       .dwtag  DW_TAG_formal_parameter
     973                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$9)
     974                      .dwendtag $C$DW$T$43
     975              
     976              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
     977                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     978                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
     979              $C$DW$T$4       .dwtag  DW_TAG_base_type
     980                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     981                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     982                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     983              $C$DW$T$5       .dwtag  DW_TAG_base_type
     984                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     985                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     986                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     987              $C$DW$T$6       .dwtag  DW_TAG_base_type
     988                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     989                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     990                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     991              $C$DW$T$7       .dwtag  DW_TAG_base_type
     992                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     993                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     994                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     995              $C$DW$T$8       .dwtag  DW_TAG_base_type
     996                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     997                      .dwattr $C$DW$T$8, DW_AT_name("short")
     998                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadisk.asm                                                          PAGE   22

     999              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1000                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1001                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1002                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1003              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1004                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    1005                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1006              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
    1007                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1008                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1009              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("AtaError")
    1010                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
