TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    1

     939              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:41 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     109              $C$DW$13        .dwtag  DW_TAG_variable, DW_AT_name("result2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    3

     110                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_result2")
     111                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$23)
     112                      .dwattr $C$DW$13, DW_AT_location[DW_OP_bregx 0x24 6]
     113              $C$DW$14        .dwtag  DW_TAG_variable, DW_AT_name("ret_stat1")
     114                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ret_stat1")
     115                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$24)
     116                      .dwattr $C$DW$14, DW_AT_location[DW_OP_bregx 0x24 8]
     117              $C$DW$15        .dwtag  DW_TAG_variable, DW_AT_name("ret_stat2")
     118                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ret_stat2")
     119                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$24)
     120                      .dwattr $C$DW$15, DW_AT_location[DW_OP_bregx 0x24 9]
     121 000002 EB04          MOV XAR1, dbl(*SP(#2))
         000004 95   
     122 000005 EB00          MOV XAR0, dbl(*SP(#0))
         000007 85   
     123                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadiskfree.c"
     124 000008 EC10          AMAR *SP(#8), XAR1
         00000a 9E   
     125              $C$DW$16        .dwtag  DW_TAG_TI_branch
     126                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     127                      .dwattr $C$DW$16, DW_AT_name("_ATA_diskSize")
     128                      .dwattr $C$DW$16, DW_AT_TI_call
     129 00000b 6C00          CALL #_ATA_diskSize ; |29| 
         00000d 0000!
     130                                                      ; call occurs [#_ATA_diskSize] ; |29| 
     131 00000f EB08          MOV AC0, dbl(*SP(#4)) ; |29| 
         000011 08   
     132                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadiskfree.c"
     133 000012 EC12          AMAR *SP(#9), XAR1
         000014 9E   
     134 000015 ED00          MOV dbl(*SP(#0)), XAR0
         000017 8F   
     135              $C$DW$17        .dwtag  DW_TAG_TI_branch
     136                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     137                      .dwattr $C$DW$17, DW_AT_name("_ATA_diskUsed")
     138                      .dwattr $C$DW$17, DW_AT_TI_call
     139 000018 6C00          CALL #_ATA_diskUsed ; |30| 
         00001a 0000!
     140                                                      ; call occurs [#_ATA_diskUsed] ; |30| 
     141 00001c EB0C          MOV AC0, dbl(*SP(#6)) ; |30| 
         00001e 08   
     142                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadiskfree.c"
     143 00001f ED04          MOV dbl(*SP(#2)), XAR3
         000021 BF   
     144 000022 A912          MOV *SP(#9), AR1 ; |31| 
     145 000024 DA10          OR *SP(#8), AR1, AR1 ; |31| 
         000026 99   
     146 000027 C961          MOV AR1, *AR3 ; |31| 
     147                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadiskfree.c"
     148 000029 ED0C          MOV dbl(*SP(#6)), AC0 ; |32| 
         00002b 08   
     149 00002c ED08          SUB AC0, dbl(*SP(#4)), AC0 ; |32| 
         00002e 04   
     150                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadiskfree.c"
     151 00002f 4E0B          AADD #11, SP
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    4

     152                      .dwcfi  cfa_offset, 1
     153              $C$DW$18        .dwtag  DW_TAG_TI_branch
     154                      .dwattr $C$DW$18, DW_AT_low_pc(0x00)
     155                      .dwattr $C$DW$18, DW_AT_TI_return
     156 000031 4804          RET
     157                                                      ; return occurs
     158                      .dwattr $C$DW$7, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/at
     159                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x21)
     160                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     161                      .dwendentry
     162                      .dwendtag $C$DW$7
     163              
     164              ;******************************************************************************
     165              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     166              ;******************************************************************************
     167                      .global _ATA_diskSize
     168                      .global _ATA_diskUsed
     169              
     170              ;*******************************************************************************
     171              ;* TYPE INFORMATION                                                            *
     172              ;*******************************************************************************
     173              
     174              $C$DW$T$49      .dwtag  DW_TAG_structure_type
     175                      .dwattr $C$DW$T$49, DW_AT_name("AtaStateStruct")
     176                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x44)
     177              $C$DW$19        .dwtag  DW_TAG_member
     178                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     179                      .dwattr $C$DW$19, DW_AT_name("BootPhySector")
     180                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_BootPhySector")
     181                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     182                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     183              $C$DW$20        .dwtag  DW_TAG_member
     184                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     185                      .dwattr $C$DW$20, DW_AT_name("FatType")
     186                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_FatType")
     187                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     188                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     189              $C$DW$21        .dwtag  DW_TAG_member
     190                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     191                      .dwattr $C$DW$21, DW_AT_name("WordsPerLogSector")
     192                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_WordsPerLogSector")
     193                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     194                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     195              $C$DW$22        .dwtag  DW_TAG_member
     196                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     197                      .dwattr $C$DW$22, DW_AT_name("LogSectorsPerCluster")
     198                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
     199                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     200                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     201              $C$DW$23        .dwtag  DW_TAG_member
     202                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     203                      .dwattr $C$DW$23, DW_AT_name("RootDirEntries")
     204                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_RootDirEntries")
     205                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     206                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    5

     207              $C$DW$24        .dwtag  DW_TAG_member
     208                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$23)
     209                      .dwattr $C$DW$24, DW_AT_name("LogSectorsPerFat")
     210                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_LogSectorsPerFat")
     211                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     212                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     213              $C$DW$25        .dwtag  DW_TAG_member
     214                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     215                      .dwattr $C$DW$25, DW_AT_name("FirstFatSector")
     216                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_FirstFatSector")
     217                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     218                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     219              $C$DW$26        .dwtag  DW_TAG_member
     220                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     221                      .dwattr $C$DW$26, DW_AT_name("RootDirSector")
     222                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_RootDirSector")
     223                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     224                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     225              $C$DW$27        .dwtag  DW_TAG_member
     226                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
     227                      .dwattr $C$DW$27, DW_AT_name("FirstDataSector")
     228                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_FirstDataSector")
     229                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     230                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     231              $C$DW$28        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     233                      .dwattr $C$DW$28, DW_AT_name("TotalSectors")
     234                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_TotalSectors")
     235                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     236                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     237              $C$DW$29        .dwtag  DW_TAG_member
     238                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     239                      .dwattr $C$DW$29, DW_AT_name("Data")
     240                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_Data")
     241                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     242                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     243              $C$DW$30        .dwtag  DW_TAG_member
     244                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     245                      .dwattr $C$DW$30, DW_AT_name("CurrentWord")
     246                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_CurrentWord")
     247                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     248                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     249              $C$DW$31        .dwtag  DW_TAG_member
     250                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     251                      .dwattr $C$DW$31, DW_AT_name("CurrentPhySector")
     252                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_CurrentPhySector")
     253                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     254                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     255              $C$DW$32        .dwtag  DW_TAG_member
     256                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     257                      .dwattr $C$DW$32, DW_AT_name("WordsPerCluster")
     258                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_WordsPerCluster")
     259                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     260                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     261              $C$DW$33        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    6

     262                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     263                      .dwattr $C$DW$33, DW_AT_name("NumberOfFats")
     264                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_NumberOfFats")
     265                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     266                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     267              $C$DW$34        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     269                      .dwattr $C$DW$34, DW_AT_name("MFWFlag")
     270                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_MFWFlag")
     271                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     272                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     273              $C$DW$35        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$24)
     275                      .dwattr $C$DW$35, DW_AT_name("Err_Status")
     276                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Err_Status")
     277                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     278                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     279              $C$DW$36        .dwtag  DW_TAG_member
     280                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$3)
     281                      .dwattr $C$DW$36, DW_AT_name("pAtaMediaState")
     282                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_pAtaMediaState")
     283                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     284                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     285              $C$DW$37        .dwtag  DW_TAG_member
     286                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$26)
     287                      .dwattr $C$DW$37, DW_AT_name("AtaReset")
     288                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_AtaReset")
     289                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     290                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     291              $C$DW$38        .dwtag  DW_TAG_member
     292                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$28)
     293                      .dwattr $C$DW$38, DW_AT_name("AtaCommandReadyStatusCheck")
     294                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
     295                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     296                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     297              $C$DW$39        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$26)
     299                      .dwattr $C$DW$39, DW_AT_name("AtaBusyStatusCheck")
     300                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
     301                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     302                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     303              $C$DW$40        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$33)
     305                      .dwattr $C$DW$40, DW_AT_name("AtaGetSerialID")
     306                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_AtaGetSerialID")
     307                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     308                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     309              $C$DW$41        .dwtag  DW_TAG_member
     310                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$35)
     311                      .dwattr $C$DW$41, DW_AT_name("AtaIssueReadCommand")
     312                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
     313                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     314                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     315              $C$DW$42        .dwtag  DW_TAG_member
     316                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$26)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    7

     317                      .dwattr $C$DW$42, DW_AT_name("AtaDataReadyStatusCheck")
     318                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
     319                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     320                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     321              $C$DW$43        .dwtag  DW_TAG_member
     322                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$38)
     323                      .dwattr $C$DW$43, DW_AT_name("AtaReadNextWord")
     324                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AtaReadNextWord")
     325                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     326                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     327              $C$DW$44        .dwtag  DW_TAG_member
     328                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$40)
     329                      .dwattr $C$DW$44, DW_AT_name("AtaReadNextWord1")
     330                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_AtaReadNextWord1")
     331                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     332                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     333              $C$DW$45        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$40)
     335                      .dwattr $C$DW$45, DW_AT_name("AtaReadNextNWords")
     336                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_AtaReadNextNWords")
     337                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     338                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     339              $C$DW$46        .dwtag  DW_TAG_member
     340                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$42)
     341                      .dwattr $C$DW$46, DW_AT_name("AtaWriteSector")
     342                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_AtaWriteSector")
     343                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     344                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     345              $C$DW$47        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$26)
     347                      .dwattr $C$DW$47, DW_AT_name("AtaWriteSectorFlush")
     348                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
     349                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     350                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     351              $C$DW$48        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
     353                      .dwattr $C$DW$48, DW_AT_name("AtaInitAtaMediaState")
     354                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
     355                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     356                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     357              $C$DW$49        .dwtag  DW_TAG_member
     358                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$26)
     359                      .dwattr $C$DW$49, DW_AT_name("AtaFlushFat")
     360                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_AtaFlushFat")
     361                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     362                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     363              $C$DW$50        .dwtag  DW_TAG_member
     364                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$44)
     365                      .dwattr $C$DW$50, DW_AT_name("AtaErrorCallback")
     366                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_AtaErrorCallback")
     367                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     368                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     369              $C$DW$51        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$46)
     371                      .dwattr $C$DW$51, DW_AT_name("AtaFileSystemType")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    8

     372                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_AtaFileSystemType")
     373                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     374                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     375              $C$DW$52        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$48)
     377                      .dwattr $C$DW$52, DW_AT_name("get_mod_time")
     378                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_get_mod_time")
     379                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     380                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     381              $C$DW$53        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$48)
     383                      .dwattr $C$DW$53, DW_AT_name("get_mod_date")
     384                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_get_mod_date")
     385                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     386                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     387              $C$DW$54        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$48)
     389                      .dwattr $C$DW$54, DW_AT_name("get_time")
     390                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_get_time")
     391                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     392                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     393              $C$DW$55        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$48)
     395                      .dwattr $C$DW$55, DW_AT_name("get_date")
     396                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_get_date")
     397                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     398                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     399              $C$DW$56        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$36)
     401                      .dwattr $C$DW$56, DW_AT_name("_AtaWriteBuffer")
     402                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("__AtaWriteBuffer")
     403                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     404                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     405              $C$DW$57        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     407                      .dwattr $C$DW$57, DW_AT_name("_AtaWriteCurrentPhySector")
     408                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
     409                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     410                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     411                      .dwendtag $C$DW$T$49
     412              
     413              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
     414                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     415                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     416              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
     417                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     418                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
     419              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     420                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
     421              
     422              $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
     423                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     424              $C$DW$58        .dwtag  DW_TAG_formal_parameter
     425                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$9)
     426                      .dwendtag $C$DW$T$43
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:41 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
Atadiskfree.asm                                                      PAGE    9

     427              
     428              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
     429                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     430                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
     431              $C$DW$T$4       .dwtag  DW_TAG_base_type
     432                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     433                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     434                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     435              $C$DW$T$5       .dwtag  DW_TAG_base_type
     436                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     437                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     438                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     439              $C$DW$T$6       .dwtag  DW_TAG_base_type
     440                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     441                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     442                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     443              $C$DW$T$7       .dwtag  DW_TAG_base_type
     444                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     445                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     446                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     447              $C$DW$T$8       .dwtag  DW_TAG_base_type
     448                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     449                      .dwattr $C$DW$T$8, DW_AT_name("short")
     450                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     451              $C$DW$T$9       .dwtag  DW_TAG_base_type
     452                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     453                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     454                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     455              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
     456                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
     457                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     458              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
     459                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     460                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     461              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("AtaError")
     462                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
