TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE    1

    2556              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:11 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1137              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1138                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1139              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1140              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1141              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1142              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1143              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1144                      .dwendtag $C$DW$T$32
    1145              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   32

    1146              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1147                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1148                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1149              
    1150              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1151                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1152              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1153              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1154                      .dwendtag $C$DW$T$38
    1155              
    1156              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1157                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1158                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1159              
    1160              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1161                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1162              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1163              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1164              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1165              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1166              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1167                      .dwendtag $C$DW$T$41
    1168              
    1169              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1170                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1171                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1172              
    1173              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1174                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1175              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1176              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1177                      .dwendtag $C$DW$T$43
    1178              
    1179              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1180                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1181                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1182              
    1183              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1184                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1185              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1186              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1187                      .dwendtag $C$DW$T$45
    1188              
    1189              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1190                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1191                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1192              
    1193              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1194                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1195              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
    1196              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1197                      .dwendtag $C$DW$T$47
    1198              
    1199              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1200                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   33

    1201                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1202              
    1203              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1204                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1205              $C$DW$123       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1207                      .dwattr $C$DW$123, DW_AT_name("LCDREVMIN")
    1208                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_LCDREVMIN")
    1209                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$124       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1213                      .dwattr $C$DW$124, DW_AT_name("LCDREVMAJ")
    1214                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1215                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1216                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$125       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1219                      .dwattr $C$DW$125, DW_AT_name("RSVD0")
    1220                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_RSVD0")
    1221                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1222                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$126       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1225                      .dwattr $C$DW$126, DW_AT_name("LCDCR")
    1226                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_LCDCR")
    1227                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1228                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$127       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$22)
    1231                      .dwattr $C$DW$127, DW_AT_name("RSVD1")
    1232                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RSVD1")
    1233                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1234                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$128       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1237                      .dwattr $C$DW$128, DW_AT_name("LCDSR")
    1238                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_LCDSR")
    1239                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1240                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$129       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    1243                      .dwattr $C$DW$129, DW_AT_name("RSVD2")
    1244                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD2")
    1245                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1246                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$130       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1249                      .dwattr $C$DW$130, DW_AT_name("LCDLIDDCR")
    1250                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1251                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1252                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$131       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
    1255                      .dwattr $C$DW$131, DW_AT_name("RSVD3")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   34

    1256                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RSVD3")
    1257                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1258                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$132       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1261                      .dwattr $C$DW$132, DW_AT_name("LCDLIDDCS0CONFIG0")
    1262                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1263                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1264                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$133       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1267                      .dwattr $C$DW$133, DW_AT_name("LCDLIDDCS0CONFIG1")
    1268                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1269                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1270                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$134       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1273                      .dwattr $C$DW$134, DW_AT_name("RSVD4")
    1274                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_RSVD4")
    1275                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1276                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$135       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1279                      .dwattr $C$DW$135, DW_AT_name("LCDLIDDCS0ADDR")
    1280                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1281                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1282                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$136       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1285                      .dwattr $C$DW$136, DW_AT_name("RSVD5")
    1286                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RSVD5")
    1287                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1288                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$137       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1291                      .dwattr $C$DW$137, DW_AT_name("LCDLIDDCS0DATA")
    1292                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1293                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1294                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1295              $C$DW$138       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    1297                      .dwattr $C$DW$138, DW_AT_name("RSVD6")
    1298                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RSVD6")
    1299                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1300                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$139       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1303                      .dwattr $C$DW$139, DW_AT_name("LCDLIDDCS1CONFIG0")
    1304                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1305                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1306                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$140       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1309                      .dwattr $C$DW$140, DW_AT_name("LCDLIDDCS1CONFIG1")
    1310                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   35

    1311                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1312                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$141       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    1315                      .dwattr $C$DW$141, DW_AT_name("RSVD7")
    1316                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_RSVD7")
    1317                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1318                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$142       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1321                      .dwattr $C$DW$142, DW_AT_name("LCDLIDDCS1ADDR")
    1322                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1323                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1324                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$143       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    1327                      .dwattr $C$DW$143, DW_AT_name("RSVD8")
    1328                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RSVD8")
    1329                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1330                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$144       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1333                      .dwattr $C$DW$144, DW_AT_name("LCDLIDDCS1DATA")
    1334                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1335                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1336                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$145       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$23)
    1339                      .dwattr $C$DW$145, DW_AT_name("RSVD9")
    1340                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RSVD9")
    1341                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1342                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$146       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1345                      .dwattr $C$DW$146, DW_AT_name("LCDDMACR")
    1346                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_LCDDMACR")
    1347                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1348                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$147       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1351                      .dwattr $C$DW$147, DW_AT_name("RSVD10")
    1352                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RSVD10")
    1353                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1354                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$148       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1357                      .dwattr $C$DW$148, DW_AT_name("LCDDMAFB0BAR0")
    1358                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1359                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1360                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$149       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1363                      .dwattr $C$DW$149, DW_AT_name("LCDDMAFB0BAR1")
    1364                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1365                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   36

    1366                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$150       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1369                      .dwattr $C$DW$150, DW_AT_name("RSVD11")
    1370                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_RSVD11")
    1371                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1372                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$151       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    1375                      .dwattr $C$DW$151, DW_AT_name("LCDDMAFB0CAR0")
    1376                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1377                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1378                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$152       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    1381                      .dwattr $C$DW$152, DW_AT_name("LCDDMAFB0CAR1")
    1382                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1383                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1384                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$153       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1387                      .dwattr $C$DW$153, DW_AT_name("RSVD12")
    1388                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_RSVD12")
    1389                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1390                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$154       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1393                      .dwattr $C$DW$154, DW_AT_name("LCDDMAFB1BAR0")
    1394                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    1395                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1396                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$155       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    1399                      .dwattr $C$DW$155, DW_AT_name("LCDDMAFB1BAR1")
    1400                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1401                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1402                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$156       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    1405                      .dwattr $C$DW$156, DW_AT_name("RSVD13")
    1406                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RSVD13")
    1407                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1408                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$157       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1411                      .dwattr $C$DW$157, DW_AT_name("LCDDMAFB1CAR0")
    1412                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1413                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1414                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1415              $C$DW$158       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1417                      .dwattr $C$DW$158, DW_AT_name("LCDDMAFB1CAR1")
    1418                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1419                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1420                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   37

    1421                      .dwendtag $C$DW$T$24
    1422              
    1423              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1424                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$24)
    1425                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1426              $C$DW$159       .dwtag  DW_TAG_TI_far_type
    1427                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$56)
    1428              $C$DW$160       .dwtag  DW_TAG_TI_ioport_type
    1429                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$159)
    1430              $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1431                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$160)
    1432              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1433                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1434                      .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    1435              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    1436                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1437                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1438              
    1439              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1440                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    1441              $C$DW$161       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$161, DW_AT_name("clkDiv")
    1444                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_clkDiv")
    1445                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$162       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$26)
    1449                      .dwattr $C$DW$162, DW_AT_name("fdoneIntEn")
    1450                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_fdoneIntEn")
    1451                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1452                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$163       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$28)
    1455                      .dwattr $C$DW$163, DW_AT_name("dmaCs0Cs1")
    1456                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    1457                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1458                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$164       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    1461                      .dwattr $C$DW$164, DW_AT_name("dmaEnable")
    1462                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_dmaEnable")
    1463                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1464                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$165       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1467                      .dwattr $C$DW$165, DW_AT_name("polControl")
    1468                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_polControl")
    1469                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1470                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$166       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$33)
    1473                      .dwattr $C$DW$166, DW_AT_name("modeSel")
    1474                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_modeSel")
    1475                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   38

    1476                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1477                      .dwendtag $C$DW$T$34
    1478              
    1479              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    1480                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    1481                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1482              
    1483              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1484                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    1485              $C$DW$167       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1487                      .dwattr $C$DW$167, DW_AT_name("wSu")
    1488                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_wSu")
    1489                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$168       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$168, DW_AT_name("wStrobe")
    1494                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_wStrobe")
    1495                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1496                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$169       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$169, DW_AT_name("wHold")
    1500                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_wHold")
    1501                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1502                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$170       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$170, DW_AT_name("rSu")
    1506                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rSu")
    1507                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1508                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$171       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$171, DW_AT_name("rStrobe")
    1512                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rStrobe")
    1513                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1514                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$172       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$172, DW_AT_name("rHold")
    1518                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rHold")
    1519                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1520                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$173       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$173, DW_AT_name("ta")
    1524                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ta")
    1525                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1526                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1527                      .dwendtag $C$DW$T$35
    1528              
    1529              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    1530                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   39

    1531                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1532              
    1533              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1534                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    1535              $C$DW$174       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$3)
    1537                      .dwattr $C$DW$174, DW_AT_name("extendSetup")
    1538                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_extendSetup")
    1539                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$175       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$36)
    1543                      .dwattr $C$DW$175, DW_AT_name("config")
    1544                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_config")
    1545                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1546                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$176       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$37)
    1549                      .dwattr $C$DW$176, DW_AT_name("timingCs0")
    1550                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_timingCs0")
    1551                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1552                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$177       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$39)
    1555                      .dwattr $C$DW$177, DW_AT_name("useCs1")
    1556                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_useCs1")
    1557                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1558                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$178       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$37)
    1561                      .dwattr $C$DW$178, DW_AT_name("timingCs1")
    1562                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_timingCs1")
    1563                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1564                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1565                      .dwendtag $C$DW$T$40
    1566              
    1567              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    1568                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$40)
    1569                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1570              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1571                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1572                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1573              
    1574              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1575                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    1576              $C$DW$179       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$42)
    1578                      .dwattr $C$DW$179, DW_AT_name("burstSize")
    1579                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_burstSize")
    1580                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$180       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$44)
    1584                      .dwattr $C$DW$180, DW_AT_name("eofIntEn")
    1585                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_eofIntEn")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   40

    1586                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1587                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$181       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$46)
    1590                      .dwattr $C$DW$181, DW_AT_name("bigEndian")
    1591                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bigEndian")
    1592                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1593                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$182       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$48)
    1596                      .dwattr $C$DW$182, DW_AT_name("frameMode")
    1597                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_frameMode")
    1598                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1599                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$183       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$49)
    1602                      .dwattr $C$DW$183, DW_AT_name("fb0Base")
    1603                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_fb0Base")
    1604                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1605                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$184       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$49)
    1608                      .dwattr $C$DW$184, DW_AT_name("fb0Ceil")
    1609                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_fb0Ceil")
    1610                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1611                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$185       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$49)
    1614                      .dwattr $C$DW$185, DW_AT_name("fb1Base")
    1615                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_fb1Base")
    1616                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1617                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$186       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$49)
    1620                      .dwattr $C$DW$186, DW_AT_name("fb1Ceil")
    1621                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_fb1Ceil")
    1622                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1623                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1624                      .dwendtag $C$DW$T$50
    1625              
    1626              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    1627                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$50)
    1628                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1629              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1630                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1631                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    1632              
    1633              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1634                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    1635              $C$DW$187       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    1637                      .dwattr $C$DW$187, DW_AT_name("EBSR")
    1638                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_EBSR")
    1639                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   41

    1641              $C$DW$188       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1643                      .dwattr $C$DW$188, DW_AT_name("RSVD0")
    1644                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD0")
    1645                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1646                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$189       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1649                      .dwattr $C$DW$189, DW_AT_name("PCGCR1")
    1650                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCGCR1")
    1651                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1652                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$190       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1655                      .dwattr $C$DW$190, DW_AT_name("PCGCR2")
    1656                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCGCR2")
    1657                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1658                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$191       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1661                      .dwattr $C$DW$191, DW_AT_name("PSRCR")
    1662                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PSRCR")
    1663                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1664                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$192       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1667                      .dwattr $C$DW$192, DW_AT_name("PRCR")
    1668                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PRCR")
    1669                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1670                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$193       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$51)
    1673                      .dwattr $C$DW$193, DW_AT_name("RSVD1")
    1674                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD1")
    1675                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1676                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$194       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    1679                      .dwattr $C$DW$194, DW_AT_name("TIAFR")
    1680                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_TIAFR")
    1681                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1682                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$195       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1685                      .dwattr $C$DW$195, DW_AT_name("RSVD2")
    1686                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD2")
    1687                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1688                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$196       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1691                      .dwattr $C$DW$196, DW_AT_name("ODSCR")
    1692                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ODSCR")
    1693                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1694                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$197       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   42

    1696                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1697                      .dwattr $C$DW$197, DW_AT_name("PDINHIBR1")
    1698                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PDINHIBR1")
    1699                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1700                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$198       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    1703                      .dwattr $C$DW$198, DW_AT_name("PDINHIBR2")
    1704                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PDINHIBR2")
    1705                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1706                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$199       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1709                      .dwattr $C$DW$199, DW_AT_name("PDINHIBR3")
    1710                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PDINHIBR3")
    1711                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1712                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$200       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1715                      .dwattr $C$DW$200, DW_AT_name("DMA0CESR1")
    1716                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_DMA0CESR1")
    1717                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1718                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$201       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1721                      .dwattr $C$DW$201, DW_AT_name("DMA0CESR2")
    1722                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DMA0CESR2")
    1723                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1724                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$202       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1727                      .dwattr $C$DW$202, DW_AT_name("DMA1CESR1")
    1728                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DMA1CESR1")
    1729                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1730                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$203       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    1733                      .dwattr $C$DW$203, DW_AT_name("DMA1CESR2")
    1734                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_DMA1CESR2")
    1735                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1736                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$204       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    1739                      .dwattr $C$DW$204, DW_AT_name("SDRAMCCR")
    1740                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SDRAMCCR")
    1741                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1742                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$205       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    1745                      .dwattr $C$DW$205, DW_AT_name("CCR2")
    1746                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CCR2")
    1747                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1748                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$206       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   43

    1751                      .dwattr $C$DW$206, DW_AT_name("CGCR1")
    1752                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CGCR1")
    1753                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1754                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$207       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    1757                      .dwattr $C$DW$207, DW_AT_name("CGICR")
    1758                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CGICR")
    1759                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1760                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$208       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    1763                      .dwattr $C$DW$208, DW_AT_name("CGCR2")
    1764                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CGCR2")
    1765                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1766                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$209       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    1769                      .dwattr $C$DW$209, DW_AT_name("CGOCR")
    1770                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_CGOCR")
    1771                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1772                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$210       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$210, DW_AT_name("CCSSR")
    1776                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CCSSR")
    1777                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1778                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$211       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    1781                      .dwattr $C$DW$211, DW_AT_name("RSVD3")
    1782                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD3")
    1783                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1784                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$212       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    1787                      .dwattr $C$DW$212, DW_AT_name("ECDR")
    1788                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ECDR")
    1789                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1790                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$213       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$213, DW_AT_name("RSVD4")
    1794                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RSVD4")
    1795                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1796                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$214       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    1799                      .dwattr $C$DW$214, DW_AT_name("RAMSLPMDCNTLR1")
    1800                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1801                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1802                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$215       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    1805                      .dwattr $C$DW$215, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   44

    1806                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_RSVD5")
    1807                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1808                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$216       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    1811                      .dwattr $C$DW$216, DW_AT_name("RAMSLPMDCNTLR2")
    1812                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1813                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1814                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$217       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$217, DW_AT_name("RAMSLPMDCNTLR3")
    1818                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1819                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1820                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$218       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    1823                      .dwattr $C$DW$218, DW_AT_name("RAMSLPMDCNTLR4")
    1824                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1825                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1826                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$219       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    1829                      .dwattr $C$DW$219, DW_AT_name("RAMSLPMDCNTLR5")
    1830                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1831                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1832                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$220       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    1835                      .dwattr $C$DW$220, DW_AT_name("RSVD6")
    1836                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RSVD6")
    1837                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1838                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$221       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    1841                      .dwattr $C$DW$221, DW_AT_name("DMAIFR")
    1842                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMAIFR")
    1843                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1844                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$222       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    1847                      .dwattr $C$DW$222, DW_AT_name("DMAIER")
    1848                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMAIER")
    1849                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1850                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$223       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    1853                      .dwattr $C$DW$223, DW_AT_name("USBSCR")
    1854                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_USBSCR")
    1855                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1856                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$224       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    1859                      .dwattr $C$DW$224, DW_AT_name("ESCR")
    1860                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ESCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   45

    1861                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1862                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$225       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    1865                      .dwattr $C$DW$225, DW_AT_name("RSVD7")
    1866                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RSVD7")
    1867                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1868                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$226       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    1871                      .dwattr $C$DW$226, DW_AT_name("DMA2CESR1")
    1872                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_DMA2CESR1")
    1873                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1874                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$227       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    1877                      .dwattr $C$DW$227, DW_AT_name("DMA2CESR2")
    1878                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_DMA2CESR2")
    1879                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1880                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$228       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    1883                      .dwattr $C$DW$228, DW_AT_name("DMA3CESR1")
    1884                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_DMA3CESR1")
    1885                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1886                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$229       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    1889                      .dwattr $C$DW$229, DW_AT_name("DMA3CESR2")
    1890                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_DMA3CESR2")
    1891                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1892                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$230       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    1895                      .dwattr $C$DW$230, DW_AT_name("CLKSTOP")
    1896                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_CLKSTOP")
    1897                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1898                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$231       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$52)
    1901                      .dwattr $C$DW$231, DW_AT_name("RSVD8")
    1902                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RSVD8")
    1903                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1904                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$232       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    1907                      .dwattr $C$DW$232, DW_AT_name("DIEIDR0")
    1908                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DIEIDR0")
    1909                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1910                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$233       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    1913                      .dwattr $C$DW$233, DW_AT_name("DIEIDR1")
    1914                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DIEIDR1")
    1915                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   46

    1916                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$234       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    1919                      .dwattr $C$DW$234, DW_AT_name("DIEIDR2")
    1920                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DIEIDR2")
    1921                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1922                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$235       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    1925                      .dwattr $C$DW$235, DW_AT_name("DIEIDR3")
    1926                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DIEIDR3")
    1927                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1928                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$236       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    1931                      .dwattr $C$DW$236, DW_AT_name("DIEIDR4")
    1932                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_DIEIDR4")
    1933                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1934                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$237       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    1937                      .dwattr $C$DW$237, DW_AT_name("DIEIDR5")
    1938                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DIEIDR5")
    1939                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1940                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$238       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    1943                      .dwattr $C$DW$238, DW_AT_name("DIEIDR6")
    1944                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DIEIDR6")
    1945                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1946                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$239       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1949                      .dwattr $C$DW$239, DW_AT_name("DIEIDR7")
    1950                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DIEIDR7")
    1951                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1952                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1953                      .dwendtag $C$DW$T$53
    1954              
    1955              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1956                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$53)
    1957                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1958              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    1959                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$67)
    1960              $C$DW$241       .dwtag  DW_TAG_TI_ioport_type
    1961                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$240)
    1962              $C$DW$T$68      .dwtag  DW_TAG_volatile_type
    1963                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$241)
    1964              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    1965                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1966                      .dwattr $C$DW$T$69, DW_AT_address_class(0x10)
    1967              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1968                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1969                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1970              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   47

    1971              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1972                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
    1973              $C$DW$242       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$54)
    1975                      .dwattr $C$DW$242, DW_AT_name("RSVD0")
    1976                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD0")
    1977                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1979              $C$DW$243       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    1981                      .dwattr $C$DW$243, DW_AT_name("IODIR1")
    1982                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_IODIR1")
    1983                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1984                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$244       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    1987                      .dwattr $C$DW$244, DW_AT_name("IODIR2")
    1988                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_IODIR2")
    1989                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1990                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1991              $C$DW$245       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    1993                      .dwattr $C$DW$245, DW_AT_name("IOINDATA1")
    1994                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_IOINDATA1")
    1995                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1996                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1997              $C$DW$246       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    1999                      .dwattr $C$DW$246, DW_AT_name("IOINDATA2")
    2000                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_IOINDATA2")
    2001                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2002                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2003              $C$DW$247       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2005                      .dwattr $C$DW$247, DW_AT_name("IOOUTDATA1")
    2006                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_IOOUTDATA1")
    2007                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2008                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2009              $C$DW$248       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2011                      .dwattr $C$DW$248, DW_AT_name("IOOUTDATA2")
    2012                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_IOOUTDATA2")
    2013                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2014                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$249       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2017                      .dwattr $C$DW$249, DW_AT_name("IOINTEDG1")
    2018                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_IOINTEDG1")
    2019                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2020                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$250       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2023                      .dwattr $C$DW$250, DW_AT_name("IOINTEDG2")
    2024                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_IOINTEDG2")
    2025                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   48

    2026                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$251       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2029                      .dwattr $C$DW$251, DW_AT_name("IOINTEN1")
    2030                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_IOINTEN1")
    2031                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2032                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$252       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2035                      .dwattr $C$DW$252, DW_AT_name("IOINTEN2")
    2036                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_IOINTEN2")
    2037                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2038                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2039              $C$DW$253       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2041                      .dwattr $C$DW$253, DW_AT_name("IOINTFLG1")
    2042                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_IOINTFLG1")
    2043                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2044                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2045              $C$DW$254       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2047                      .dwattr $C$DW$254, DW_AT_name("IOINTFLG2")
    2048                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_IOINTFLG2")
    2049                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2050                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2051                      .dwendtag $C$DW$T$55
    2052              
    2053              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    2054                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$55)
    2055                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2056              $C$DW$255       .dwtag  DW_TAG_TI_far_type
    2057                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$71)
    2058              $C$DW$256       .dwtag  DW_TAG_TI_ioport_type
    2059                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$255)
    2060              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2061                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$256)
    2062              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2063                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2064                      .dwattr $C$DW$T$73, DW_AT_address_class(0x10)
    2065              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    2066                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2067                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2068              
    2069              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2070                      .dwattr $C$DW$T$62, DW_AT_name("CSL_LcdcObj")
    2071                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2072              $C$DW$257       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$59)
    2074                      .dwattr $C$DW$257, DW_AT_name("regs")
    2075                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_regs")
    2076                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$258       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$61)
    2080                      .dwattr $C$DW$258, DW_AT_name("perNum")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaPolledExample.asm                                        PAGE   49

    2081                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_perNum")
    2082                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2083                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2084                      .dwendtag $C$DW$T$62
    2085              
    2086              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2087                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$62)
    2088                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2089              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2090                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2091                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    2092              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2093                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2094                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2095              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2096                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2097              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2098                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2099                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2100                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2101              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2102                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2103                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2104                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2105              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2106                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2107                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2108                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2109              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2110                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2111                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2112                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2113              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2114                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2115                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2116                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2117              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2118                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2119                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2120              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2121                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2122                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2123              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2124                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$60)
    2125                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2126              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    2127                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    2128                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    2129              $C$DW$259       .dwtag  DW_TAG_TI_far_type
    2130                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$60)
    2131              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    2132                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$259)
    2133              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2134                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2135                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:11 2018

