TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE    1

    3053              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:47 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1704              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    1705              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    1706              $C$DW$183       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    1707              $C$DW$184       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    1708              $C$DW$185       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    1709              $C$DW$186       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    1710              $C$DW$187       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    1711              $C$DW$188       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    1712              $C$DW$189       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    1713              $C$DW$190       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    1714              $C$DW$191       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    1715              $C$DW$192       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    1716                      .dwendtag $C$DW$T$62
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   47

    1717              
    1718              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    1719                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1720                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1721              
    1722              $C$DW$T$70      .dwtag  DW_TAG_enumeration_type
    1723                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
    1724              $C$DW$193       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    1725              $C$DW$194       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    1726              $C$DW$195       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    1727              $C$DW$196       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    1728              $C$DW$197       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    1729              $C$DW$198       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    1730              $C$DW$199       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    1731                      .dwendtag $C$DW$T$70
    1732              
    1733              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    1734                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1735                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1736              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    1737                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1738                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    1739              
    1740              $C$DW$T$73      .dwtag  DW_TAG_enumeration_type
    1741                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    1742              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
    1743              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    1744                      .dwendtag $C$DW$T$73
    1745              
    1746              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    1747                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1748                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1749              
    1750              $C$DW$T$75      .dwtag  DW_TAG_enumeration_type
    1751                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    1752              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    1753              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    1754              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    1755              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    1756              $C$DW$206       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    1757              $C$DW$207       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    1758              $C$DW$208       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    1759                      .dwendtag $C$DW$T$75
    1760              
    1761              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    1762                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1763                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1764              
    1765              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1766                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    1767              $C$DW$209       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    1769                      .dwattr $C$DW$209, DW_AT_name("RSVD0")
    1770                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD0")
    1771                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   48

    1772                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$210       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$210, DW_AT_name("USBLDOCNTL")
    1776                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_USBLDOCNTL")
    1777                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1778                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$211       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    1781                      .dwattr $C$DW$211, DW_AT_name("RSVD1")
    1782                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD1")
    1783                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1784                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$212       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    1787                      .dwattr $C$DW$212, DW_AT_name("SARCTRL")
    1788                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_SARCTRL")
    1789                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1790                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$213       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$213, DW_AT_name("RSVD2")
    1794                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RSVD2")
    1795                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1796                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$214       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    1799                      .dwattr $C$DW$214, DW_AT_name("SARDATA")
    1800                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_SARDATA")
    1801                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1802                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$215       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    1805                      .dwattr $C$DW$215, DW_AT_name("RSVD3")
    1806                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_RSVD3")
    1807                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1808                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$216       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    1811                      .dwattr $C$DW$216, DW_AT_name("SARCLKCTRL")
    1812                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_SARCLKCTRL")
    1813                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1814                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$217       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$217, DW_AT_name("RSVD4")
    1818                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_RSVD4")
    1819                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1820                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$218       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    1823                      .dwattr $C$DW$218, DW_AT_name("SARPINCTRL")
    1824                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_SARPINCTRL")
    1825                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1826                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   49

    1827              $C$DW$219       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    1829                      .dwattr $C$DW$219, DW_AT_name("RSVD5")
    1830                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RSVD5")
    1831                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1832                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$220       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    1835                      .dwattr $C$DW$220, DW_AT_name("SARGPOCTRL")
    1836                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_SARGPOCTRL")
    1837                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1838                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1839                      .dwendtag $C$DW$T$23
    1840              
    1841              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    1842                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1843                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1844              $C$DW$221       .dwtag  DW_TAG_TI_far_type
    1845                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    1846              $C$DW$222       .dwtag  DW_TAG_TI_ioport_type
    1847                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$221)
    1848              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1849                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$222)
    1850              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1851                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1852                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1853              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    1854                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1855                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1856              
    1857              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1858                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    1859              $C$DW$223       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    1861                      .dwattr $C$DW$223, DW_AT_name("baseAddr")
    1862                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_baseAddr")
    1863                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1865              $C$DW$224       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$224, DW_AT_name("chanNo")
    1868                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_chanNo")
    1869                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1870                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1871              $C$DW$225       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$225, DW_AT_name("status")
    1874                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_status")
    1875                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1876                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1877                      .dwendtag $C$DW$T$28
    1878              
    1879              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
    1880                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$28)
    1881                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   50

    1882              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1883                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1884                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    1885              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    1886                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1887                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1888              
    1889              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1890                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1891              $C$DW$226       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$226, DW_AT_name("SysClkDiv")
    1894                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_SysClkDiv")
    1895                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$227       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$30)
    1899                      .dwattr $C$DW$227, DW_AT_name("OpMode")
    1900                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_OpMode")
    1901                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1902                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$228       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$32)
    1905                      .dwattr $C$DW$228, DW_AT_name("MultiCh")
    1906                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_MultiCh")
    1907                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1908                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$229       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$34)
    1911                      .dwattr $C$DW$229, DW_AT_name("RefVoltage")
    1912                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RefVoltage")
    1913                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1914                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1915                      .dwendtag $C$DW$T$35
    1916              
    1917              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    1918                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$35)
    1919                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1920              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1921                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1922                      .dwattr $C$DW$T$81, DW_AT_address_class(0x17)
    1923              
    1924              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1925                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x66)
    1926              $C$DW$230       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    1928                      .dwattr $C$DW$230, DW_AT_name("DMACH0SSAL")
    1929                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_DMACH0SSAL")
    1930                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$231       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    1934                      .dwattr $C$DW$231, DW_AT_name("DMACH0SSAU")
    1935                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_DMACH0SSAU")
    1936                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   51

    1937                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$232       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    1940                      .dwattr $C$DW$232, DW_AT_name("DMACH0DSAL")
    1941                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DMACH0DSAL")
    1942                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1943                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$233       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    1946                      .dwattr $C$DW$233, DW_AT_name("DMACH0DSAU")
    1947                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DMACH0DSAU")
    1948                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1949                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$234       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    1952                      .dwattr $C$DW$234, DW_AT_name("DMACH0TCR1")
    1953                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMACH0TCR1")
    1954                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1955                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$235       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    1958                      .dwattr $C$DW$235, DW_AT_name("DMACH0TCR2")
    1959                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMACH0TCR2")
    1960                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1961                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$236       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$36)
    1964                      .dwattr $C$DW$236, DW_AT_name("RSVD0")
    1965                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD0")
    1966                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1967                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1968              $C$DW$237       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    1970                      .dwattr $C$DW$237, DW_AT_name("DMACH1SSAL")
    1971                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DMACH1SSAL")
    1972                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1973                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$238       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    1976                      .dwattr $C$DW$238, DW_AT_name("DMACH1SSAU")
    1977                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DMACH1SSAU")
    1978                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1979                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1980              $C$DW$239       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1982                      .dwattr $C$DW$239, DW_AT_name("DMACH1DSAL")
    1983                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DMACH1DSAL")
    1984                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1985                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1986              $C$DW$240       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    1988                      .dwattr $C$DW$240, DW_AT_name("DMACH1DSAU")
    1989                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DMACH1DSAU")
    1990                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1991                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   52

    1992              $C$DW$241       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    1994                      .dwattr $C$DW$241, DW_AT_name("DMACH1TCR1")
    1995                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMACH1TCR1")
    1996                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1997                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$242       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2000                      .dwattr $C$DW$242, DW_AT_name("DMACH1TCR2")
    2001                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMACH1TCR2")
    2002                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2003                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$243       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$36)
    2006                      .dwattr $C$DW$243, DW_AT_name("RSVD1")
    2007                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_RSVD1")
    2008                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2009                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$244       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2012                      .dwattr $C$DW$244, DW_AT_name("DMACH2SSAL")
    2013                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2014                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2015                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$245       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2018                      .dwattr $C$DW$245, DW_AT_name("DMACH2SSAU")
    2019                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DMACH2SSAU")
    2020                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2021                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$246       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2024                      .dwattr $C$DW$246, DW_AT_name("DMACH2DSAL")
    2025                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2026                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2027                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$247       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2030                      .dwattr $C$DW$247, DW_AT_name("DMACH2DSAU")
    2031                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2032                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2033                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$248       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2036                      .dwattr $C$DW$248, DW_AT_name("DMACH2TCR1")
    2037                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2038                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2039                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$249       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2042                      .dwattr $C$DW$249, DW_AT_name("DMACH2TCR2")
    2043                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2044                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2045                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2046              $C$DW$250       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   53

    2047                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$36)
    2048                      .dwattr $C$DW$250, DW_AT_name("RSVD2")
    2049                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_RSVD2")
    2050                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2051                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$251       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2054                      .dwattr $C$DW$251, DW_AT_name("DMACH3SSAL")
    2055                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2056                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2057                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$252       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2060                      .dwattr $C$DW$252, DW_AT_name("DMACH3SSAU")
    2061                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2062                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2063                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2064              $C$DW$253       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2066                      .dwattr $C$DW$253, DW_AT_name("DMACH3DSAL")
    2067                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2068                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2069                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$254       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2072                      .dwattr $C$DW$254, DW_AT_name("DMACH3DSAU")
    2073                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2074                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2075                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2076              $C$DW$255       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2078                      .dwattr $C$DW$255, DW_AT_name("DMACH3TCR1")
    2079                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2080                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2081                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$256       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2084                      .dwattr $C$DW$256, DW_AT_name("DMACH3TCR2")
    2085                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2086                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2087                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2088                      .dwendtag $C$DW$T$37
    2089              
    2090              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2091                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2092                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2093              $C$DW$257       .dwtag  DW_TAG_TI_far_type
    2094                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$38)
    2095              $C$DW$258       .dwtag  DW_TAG_TI_ioport_type
    2096                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$257)
    2097              $C$DW$T$39      .dwtag  DW_TAG_volatile_type
    2098                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$258)
    2099              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2100                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2101                      .dwattr $C$DW$T$40, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   54

    2102              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2103                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2104                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2105              
    2106              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2107                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x09)
    2108              $C$DW$259       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$41)
    2110                      .dwattr $C$DW$259, DW_AT_name("dmaRegs")
    2111                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_dmaRegs")
    2112                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$260       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$43)
    2116                      .dwattr $C$DW$260, DW_AT_name("chanNum")
    2117                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_chanNum")
    2118                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2119                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2120              $C$DW$261       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$45)
    2122                      .dwattr $C$DW$261, DW_AT_name("dmaInstNum")
    2123                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_dmaInstNum")
    2124                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2125                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$262       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$46)
    2128                      .dwattr $C$DW$262, DW_AT_name("isChanFree")
    2129                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_isChanFree")
    2130                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2131                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$263       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$48)
    2134                      .dwattr $C$DW$263, DW_AT_name("chanDir")
    2135                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_chanDir")
    2136                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2137                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$264       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$50)
    2140                      .dwattr $C$DW$264, DW_AT_name("trigger")
    2141                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_trigger")
    2142                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2143                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$265       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$52)
    2146                      .dwattr $C$DW$265, DW_AT_name("trfType")
    2147                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_trfType")
    2148                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2149                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$266       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$54)
    2152                      .dwattr $C$DW$266, DW_AT_name("dmaInt")
    2153                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_dmaInt")
    2154                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2155                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$267       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   55

    2157                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$46)
    2158                      .dwattr $C$DW$267, DW_AT_name("pingPongEnabled")
    2159                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_pingPongEnabled")
    2160                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2161                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2162                      .dwendtag $C$DW$T$55
    2163              
    2164              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    2165                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$55)
    2166                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2167              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2168                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2169                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    2170              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    2171                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2172                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2173              
    2174              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    2175                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x0e)
    2176              $C$DW$268       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$57)
    2178                      .dwattr $C$DW$268, DW_AT_name("pingPongMode")
    2179                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_pingPongMode")
    2180                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2181                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$269       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$59)
    2184                      .dwattr $C$DW$269, DW_AT_name("autoMode")
    2185                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_autoMode")
    2186                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2187                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$270       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$61)
    2190                      .dwattr $C$DW$270, DW_AT_name("burstLen")
    2191                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_burstLen")
    2192                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2193                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$271       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$50)
    2196                      .dwattr $C$DW$271, DW_AT_name("trigger")
    2197                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_trigger")
    2198                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2199                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$272       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$63)
    2202                      .dwattr $C$DW$272, DW_AT_name("dmaEvt")
    2203                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_dmaEvt")
    2204                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2205                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$273       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$54)
    2208                      .dwattr $C$DW$273, DW_AT_name("dmaInt")
    2209                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_dmaInt")
    2210                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2211                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   56

    2212              $C$DW$274       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$48)
    2214                      .dwattr $C$DW$274, DW_AT_name("chanDir")
    2215                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_chanDir")
    2216                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2217                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$275       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$52)
    2220                      .dwattr $C$DW$275, DW_AT_name("trfType")
    2221                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_trfType")
    2222                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2223                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$276       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$276, DW_AT_name("dataLen")
    2227                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_dataLen")
    2228                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2229                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$277       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$64)
    2232                      .dwattr $C$DW$277, DW_AT_name("srcAddr")
    2233                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_srcAddr")
    2234                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2235                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$278       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$64)
    2238                      .dwattr $C$DW$278, DW_AT_name("destAddr")
    2239                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_destAddr")
    2240                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2241                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2242                      .dwendtag $C$DW$T$65
    2243              
    2244              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2245                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$65)
    2246                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2247              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    2248                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2249                      .dwattr $C$DW$T$91, DW_AT_address_class(0x17)
    2250              
    2251              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    2252                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x48)
    2253              $C$DW$279       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2255                      .dwattr $C$DW$279, DW_AT_name("EBSR")
    2256                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_EBSR")
    2257                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$280       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2261                      .dwattr $C$DW$280, DW_AT_name("RSVD0")
    2262                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_RSVD0")
    2263                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2264                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$281       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   57

    2267                      .dwattr $C$DW$281, DW_AT_name("PCGCR1")
    2268                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_PCGCR1")
    2269                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2270                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$282       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2273                      .dwattr $C$DW$282, DW_AT_name("PCGCR2")
    2274                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_PCGCR2")
    2275                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2276                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$283       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2279                      .dwattr $C$DW$283, DW_AT_name("PSRCR")
    2280                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_PSRCR")
    2281                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2282                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$284       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2285                      .dwattr $C$DW$284, DW_AT_name("PRCR")
    2286                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_PRCR")
    2287                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2288                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$285       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$66)
    2291                      .dwattr $C$DW$285, DW_AT_name("RSVD1")
    2292                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RSVD1")
    2293                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2294                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$286       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2297                      .dwattr $C$DW$286, DW_AT_name("TIAFR")
    2298                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_TIAFR")
    2299                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2300                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$287       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    2303                      .dwattr $C$DW$287, DW_AT_name("RSVD2")
    2304                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD2")
    2305                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2306                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$288       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2309                      .dwattr $C$DW$288, DW_AT_name("ODSCR")
    2310                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ODSCR")
    2311                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2312                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$289       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2315                      .dwattr $C$DW$289, DW_AT_name("PDINHIBR1")
    2316                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_PDINHIBR1")
    2317                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2318                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$290       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2321                      .dwattr $C$DW$290, DW_AT_name("PDINHIBR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   58

    2322                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_PDINHIBR2")
    2323                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2324                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$291       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    2327                      .dwattr $C$DW$291, DW_AT_name("PDINHIBR3")
    2328                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_PDINHIBR3")
    2329                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2330                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$292       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2333                      .dwattr $C$DW$292, DW_AT_name("DMA0CESR1")
    2334                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_DMA0CESR1")
    2335                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2336                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$293       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    2339                      .dwattr $C$DW$293, DW_AT_name("DMA0CESR2")
    2340                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_DMA0CESR2")
    2341                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2342                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$294       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2345                      .dwattr $C$DW$294, DW_AT_name("DMA1CESR1")
    2346                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_DMA1CESR1")
    2347                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2348                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$295       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    2351                      .dwattr $C$DW$295, DW_AT_name("DMA1CESR2")
    2352                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_DMA1CESR2")
    2353                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2354                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$296       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2357                      .dwattr $C$DW$296, DW_AT_name("SDRAMCCR")
    2358                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_SDRAMCCR")
    2359                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2360                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$297       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2363                      .dwattr $C$DW$297, DW_AT_name("CCR2")
    2364                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_CCR2")
    2365                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2366                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$298       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2369                      .dwattr $C$DW$298, DW_AT_name("CGCR1")
    2370                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_CGCR1")
    2371                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2372                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$299       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    2375                      .dwattr $C$DW$299, DW_AT_name("CGICR")
    2376                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_CGICR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   59

    2377                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2378                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$300       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2381                      .dwattr $C$DW$300, DW_AT_name("CGCR2")
    2382                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_CGCR2")
    2383                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2384                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$301       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    2387                      .dwattr $C$DW$301, DW_AT_name("CGOCR")
    2388                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_CGOCR")
    2389                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2390                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$302       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    2393                      .dwattr $C$DW$302, DW_AT_name("CCSSR")
    2394                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_CCSSR")
    2395                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2396                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$303       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    2399                      .dwattr $C$DW$303, DW_AT_name("RSVD3")
    2400                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_RSVD3")
    2401                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2402                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$304       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2405                      .dwattr $C$DW$304, DW_AT_name("ECDR")
    2406                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ECDR")
    2407                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2408                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$305       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    2411                      .dwattr $C$DW$305, DW_AT_name("RSVD4")
    2412                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD4")
    2413                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2414                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$306       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2417                      .dwattr $C$DW$306, DW_AT_name("RAMSLPMDCNTLR1")
    2418                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2419                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2420                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$307       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    2423                      .dwattr $C$DW$307, DW_AT_name("RSVD5")
    2424                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD5")
    2425                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2426                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$308       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2429                      .dwattr $C$DW$308, DW_AT_name("RAMSLPMDCNTLR2")
    2430                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2431                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   60

    2432                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$309       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    2435                      .dwattr $C$DW$309, DW_AT_name("RAMSLPMDCNTLR3")
    2436                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2437                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2438                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$310       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2441                      .dwattr $C$DW$310, DW_AT_name("RAMSLPMDCNTLR4")
    2442                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2443                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2444                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$311       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2447                      .dwattr $C$DW$311, DW_AT_name("RAMSLPMDCNTLR5")
    2448                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2449                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2450                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$312       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$67)
    2453                      .dwattr $C$DW$312, DW_AT_name("RSVD6")
    2454                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD6")
    2455                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2456                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$313       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    2459                      .dwattr $C$DW$313, DW_AT_name("DMAIFR")
    2460                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_DMAIFR")
    2461                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2462                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$314       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    2465                      .dwattr $C$DW$314, DW_AT_name("DMAIER")
    2466                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_DMAIER")
    2467                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2468                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2469              $C$DW$315       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    2471                      .dwattr $C$DW$315, DW_AT_name("USBSCR")
    2472                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_USBSCR")
    2473                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2474                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$316       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2477                      .dwattr $C$DW$316, DW_AT_name("ESCR")
    2478                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_ESCR")
    2479                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2480                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2481              $C$DW$317       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$67)
    2483                      .dwattr $C$DW$317, DW_AT_name("RSVD7")
    2484                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD7")
    2485                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2486                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   61

    2487              $C$DW$318       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    2489                      .dwattr $C$DW$318, DW_AT_name("DMA2CESR1")
    2490                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_DMA2CESR1")
    2491                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2492                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2493              $C$DW$319       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    2495                      .dwattr $C$DW$319, DW_AT_name("DMA2CESR2")
    2496                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_DMA2CESR2")
    2497                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2498                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2499              $C$DW$320       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    2501                      .dwattr $C$DW$320, DW_AT_name("DMA3CESR1")
    2502                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_DMA3CESR1")
    2503                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2504                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2505              $C$DW$321       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    2507                      .dwattr $C$DW$321, DW_AT_name("DMA3CESR2")
    2508                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_DMA3CESR2")
    2509                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2510                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2511              $C$DW$322       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    2513                      .dwattr $C$DW$322, DW_AT_name("CLKSTOP")
    2514                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_CLKSTOP")
    2515                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2516                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$323       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$68)
    2519                      .dwattr $C$DW$323, DW_AT_name("RSVD8")
    2520                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD8")
    2521                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2522                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$324       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    2525                      .dwattr $C$DW$324, DW_AT_name("DIEIDR0")
    2526                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_DIEIDR0")
    2527                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2528                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$325       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    2531                      .dwattr $C$DW$325, DW_AT_name("DIEIDR1")
    2532                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_DIEIDR1")
    2533                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2534                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$326       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    2537                      .dwattr $C$DW$326, DW_AT_name("DIEIDR2")
    2538                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_DIEIDR2")
    2539                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2540                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$327       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   62

    2542                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    2543                      .dwattr $C$DW$327, DW_AT_name("DIEIDR3")
    2544                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_DIEIDR3")
    2545                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2546                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$328       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    2549                      .dwattr $C$DW$328, DW_AT_name("DIEIDR4")
    2550                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_DIEIDR4")
    2551                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2552                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$329       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    2555                      .dwattr $C$DW$329, DW_AT_name("DIEIDR5")
    2556                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_DIEIDR5")
    2557                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2558                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$330       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    2561                      .dwattr $C$DW$330, DW_AT_name("DIEIDR6")
    2562                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_DIEIDR6")
    2563                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2564                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$331       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    2567                      .dwattr $C$DW$331, DW_AT_name("DIEIDR7")
    2568                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_DIEIDR7")
    2569                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2570                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2571                      .dwendtag $C$DW$T$69
    2572              
    2573              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2574                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$69)
    2575                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2576              $C$DW$332       .dwtag  DW_TAG_TI_far_type
    2577                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$92)
    2578              $C$DW$333       .dwtag  DW_TAG_TI_ioport_type
    2579                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$332)
    2580              $C$DW$T$93      .dwtag  DW_TAG_volatile_type
    2581                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$333)
    2582              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2583                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2584                      .dwattr $C$DW$T$94, DW_AT_address_class(0x10)
    2585              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2586                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    2587                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2588              
    2589              $C$DW$T$96      .dwtag  DW_TAG_subroutine_type
    2590                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2591              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2592                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2593                      .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    2594              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2595                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2596                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_DmaExample.asm                                               PAGE   63

    2597              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2598                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2599                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2600                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2601              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2602                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2603                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2604                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2605              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2606                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2607                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2608                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2609              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2610                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2611                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2612                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2613              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2614                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2615                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2616                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2617              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2618                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    2619                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2620              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2621                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
