TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE    1

    2336              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:06 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     955              ;******************************************************************************
     956                      .global _strcpy
     957                      .global _strcat
     958                      .global _printf
     959                      .global _LCD_init
     960                      .global _LCD_open
     961                      .global _LCD_setup
     962                      .global _LCD_close
     963                      .global _delay
     964                      .global _lcdTextPrintDMA
     965                      .global _lcdClearLine
     966                      .global _lcdClearPanel
     967                      .global _panelSetup
     968                      .global _draw_string
     969              
     970              ;*******************************************************************************
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   32

     971              ;* TYPE INFORMATION                                                            *
     972              ;*******************************************************************************
     973              
     974              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
     975                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     976              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_FDONE_DISABLE"), DW_AT_const_value(0x00)
     977              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_FDONE_ENABLE"), DW_AT_const_value(0x01)
     978                      .dwendtag $C$DW$T$25
     979              
     980              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFdoneCtl")
     981                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
     982                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     983              
     984              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
     985                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     986              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
     987              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
     988                      .dwendtag $C$DW$T$27
     989              
     990              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
     991                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     992                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     993              
     994              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
     995                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     996              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_DMA_DISABLE"), DW_AT_const_value(0x00)
     997              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_DMA_ENABLE"), DW_AT_const_value(0x01)
     998                      .dwendtag $C$DW$T$29
     999              
    1000              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaCtl")
    1001                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1002                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1003              
    1004              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1005                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1006              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1007              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1008              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1009              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1010              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1011                      .dwendtag $C$DW$T$32
    1012              
    1013              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1014                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1015                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1016              
    1017              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1018                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1019              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1020              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1021                      .dwendtag $C$DW$T$38
    1022              
    1023              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1024                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1025                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   33

    1026              
    1027              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1028                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1029              $C$DW$109       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1031                      .dwattr $C$DW$109, DW_AT_name("LCDREVMIN")
    1032                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_LCDREVMIN")
    1033                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$110       .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1037                      .dwattr $C$DW$110, DW_AT_name("LCDREVMAJ")
    1038                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1039                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1040                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1041              $C$DW$111       .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1043                      .dwattr $C$DW$111, DW_AT_name("RSVD0")
    1044                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_RSVD0")
    1045                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1046                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$112       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1049                      .dwattr $C$DW$112, DW_AT_name("LCDCR")
    1050                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LCDCR")
    1051                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1052                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$113       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
    1055                      .dwattr $C$DW$113, DW_AT_name("RSVD1")
    1056                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RSVD1")
    1057                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1058                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$114       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1061                      .dwattr $C$DW$114, DW_AT_name("LCDSR")
    1062                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_LCDSR")
    1063                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1064                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$115       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1067                      .dwattr $C$DW$115, DW_AT_name("RSVD2")
    1068                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD2")
    1069                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1070                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$116       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1073                      .dwattr $C$DW$116, DW_AT_name("LCDLIDDCR")
    1074                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1075                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1076                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$117       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$22)
    1079                      .dwattr $C$DW$117, DW_AT_name("RSVD3")
    1080                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RSVD3")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   34

    1081                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1082                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$118       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1085                      .dwattr $C$DW$118, DW_AT_name("LCDLIDDCS0CONFIG0")
    1086                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1087                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1088                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1089              $C$DW$119       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1091                      .dwattr $C$DW$119, DW_AT_name("LCDLIDDCS0CONFIG1")
    1092                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1093                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1094                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1095              $C$DW$120       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    1097                      .dwattr $C$DW$120, DW_AT_name("RSVD4")
    1098                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RSVD4")
    1099                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1100                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1101              $C$DW$121       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1103                      .dwattr $C$DW$121, DW_AT_name("LCDLIDDCS0ADDR")
    1104                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1105                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1106                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$122       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$22)
    1109                      .dwattr $C$DW$122, DW_AT_name("RSVD5")
    1110                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD5")
    1111                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1112                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$123       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1115                      .dwattr $C$DW$123, DW_AT_name("LCDLIDDCS0DATA")
    1116                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1117                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1118                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$124       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$22)
    1121                      .dwattr $C$DW$124, DW_AT_name("RSVD6")
    1122                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RSVD6")
    1123                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1124                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$125       .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1127                      .dwattr $C$DW$125, DW_AT_name("LCDLIDDCS1CONFIG0")
    1128                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1129                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1130                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$126       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1133                      .dwattr $C$DW$126, DW_AT_name("LCDLIDDCS1CONFIG1")
    1134                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    1135                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   35

    1136                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$127       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1139                      .dwattr $C$DW$127, DW_AT_name("RSVD7")
    1140                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RSVD7")
    1141                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1142                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$128       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1145                      .dwattr $C$DW$128, DW_AT_name("LCDLIDDCS1ADDR")
    1146                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1147                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1148                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$129       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    1151                      .dwattr $C$DW$129, DW_AT_name("RSVD8")
    1152                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD8")
    1153                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1154                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$130       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1157                      .dwattr $C$DW$130, DW_AT_name("LCDLIDDCS1DATA")
    1158                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1159                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1160                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1161              $C$DW$131       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$23)
    1163                      .dwattr $C$DW$131, DW_AT_name("RSVD9")
    1164                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RSVD9")
    1165                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1166                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$132       .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1169                      .dwattr $C$DW$132, DW_AT_name("LCDDMACR")
    1170                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_LCDDMACR")
    1171                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1172                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$133       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
    1175                      .dwattr $C$DW$133, DW_AT_name("RSVD10")
    1176                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_RSVD10")
    1177                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1178                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$134       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1181                      .dwattr $C$DW$134, DW_AT_name("LCDDMAFB0BAR0")
    1182                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1183                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1184                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1185              $C$DW$135       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1187                      .dwattr $C$DW$135, DW_AT_name("LCDDMAFB0BAR1")
    1188                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1189                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1190                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   36

    1191              $C$DW$136       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1193                      .dwattr $C$DW$136, DW_AT_name("RSVD11")
    1194                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RSVD11")
    1195                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1196                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$137       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1199                      .dwattr $C$DW$137, DW_AT_name("LCDDMAFB0CAR0")
    1200                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1201                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1202                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$138       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1205                      .dwattr $C$DW$138, DW_AT_name("LCDDMAFB0CAR1")
    1206                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1207                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1208                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$139       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1211                      .dwattr $C$DW$139, DW_AT_name("RSVD12")
    1212                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_RSVD12")
    1213                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1214                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$140       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1217                      .dwattr $C$DW$140, DW_AT_name("LCDDMAFB1BAR0")
    1218                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    1219                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1220                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$141       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1223                      .dwattr $C$DW$141, DW_AT_name("LCDDMAFB1BAR1")
    1224                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1225                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1226                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1227              $C$DW$142       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1229                      .dwattr $C$DW$142, DW_AT_name("RSVD13")
    1230                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RSVD13")
    1231                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1232                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$143       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1235                      .dwattr $C$DW$143, DW_AT_name("LCDDMAFB1CAR0")
    1236                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1237                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1238                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$144       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1241                      .dwattr $C$DW$144, DW_AT_name("LCDDMAFB1CAR1")
    1242                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1243                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1244                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1245                      .dwendtag $C$DW$T$24
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   37

    1246              
    1247              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1248                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
    1249                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1250              $C$DW$145       .dwtag  DW_TAG_TI_far_type
    1251                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$46)
    1252              $C$DW$146       .dwtag  DW_TAG_TI_ioport_type
    1253                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$145)
    1254              $C$DW$T$47      .dwtag  DW_TAG_volatile_type
    1255                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$146)
    1256              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    1257                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1258                      .dwattr $C$DW$T$48, DW_AT_address_class(0x10)
    1259              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    1260                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1261                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1262              
    1263              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1264                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    1265              $C$DW$147       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$147, DW_AT_name("clkDiv")
    1268                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_clkDiv")
    1269                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$148       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$26)
    1273                      .dwattr $C$DW$148, DW_AT_name("fdoneIntEn")
    1274                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_fdoneIntEn")
    1275                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1276                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$149       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
    1279                      .dwattr $C$DW$149, DW_AT_name("dmaCs0Cs1")
    1280                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    1281                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1282                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$150       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    1285                      .dwattr $C$DW$150, DW_AT_name("dmaEnable")
    1286                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_dmaEnable")
    1287                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1288                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$151       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1291                      .dwattr $C$DW$151, DW_AT_name("polControl")
    1292                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_polControl")
    1293                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1294                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1295              $C$DW$152       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$33)
    1297                      .dwattr $C$DW$152, DW_AT_name("modeSel")
    1298                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_modeSel")
    1299                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1300                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   38

    1301                      .dwendtag $C$DW$T$34
    1302              
    1303              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    1304                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    1305                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1306              
    1307              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1308                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    1309              $C$DW$153       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$153, DW_AT_name("wSu")
    1312                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_wSu")
    1313                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$154       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$154, DW_AT_name("wStrobe")
    1318                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_wStrobe")
    1319                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1320                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$155       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$155, DW_AT_name("wHold")
    1324                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_wHold")
    1325                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1326                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$156       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$156, DW_AT_name("rSu")
    1330                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rSu")
    1331                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1332                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$157       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$157, DW_AT_name("rStrobe")
    1336                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rStrobe")
    1337                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1338                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$158       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$158, DW_AT_name("rHold")
    1342                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rHold")
    1343                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1344                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$159       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$159, DW_AT_name("ta")
    1348                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ta")
    1349                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1350                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1351                      .dwendtag $C$DW$T$35
    1352              
    1353              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    1354                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    1355                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   39

    1356              
    1357              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1358                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    1359              $C$DW$160       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$3)
    1361                      .dwattr $C$DW$160, DW_AT_name("extendSetup")
    1362                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_extendSetup")
    1363                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1365              $C$DW$161       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$36)
    1367                      .dwattr $C$DW$161, DW_AT_name("config")
    1368                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_config")
    1369                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1370                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$162       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$37)
    1373                      .dwattr $C$DW$162, DW_AT_name("timingCs0")
    1374                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_timingCs0")
    1375                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1376                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$163       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$39)
    1379                      .dwattr $C$DW$163, DW_AT_name("useCs1")
    1380                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_useCs1")
    1381                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1382                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$164       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$37)
    1385                      .dwattr $C$DW$164, DW_AT_name("timingCs1")
    1386                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_timingCs1")
    1387                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1388                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1389                      .dwendtag $C$DW$T$40
    1390              
    1391              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    1392                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
    1393                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1394              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1395                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1396                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1397              
    1398              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1399                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x48)
    1400              $C$DW$165       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1402                      .dwattr $C$DW$165, DW_AT_name("EBSR")
    1403                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_EBSR")
    1404                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$166       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1408                      .dwattr $C$DW$166, DW_AT_name("RSVD0")
    1409                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD0")
    1410                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   40

    1411                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$167       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1414                      .dwattr $C$DW$167, DW_AT_name("PCGCR1")
    1415                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCGCR1")
    1416                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1417                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$168       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1420                      .dwattr $C$DW$168, DW_AT_name("PCGCR2")
    1421                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PCGCR2")
    1422                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1423                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$169       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1426                      .dwattr $C$DW$169, DW_AT_name("PSRCR")
    1427                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PSRCR")
    1428                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1429                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$170       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1432                      .dwattr $C$DW$170, DW_AT_name("PRCR")
    1433                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PRCR")
    1434                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1435                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$171       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$41)
    1438                      .dwattr $C$DW$171, DW_AT_name("RSVD1")
    1439                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD1")
    1440                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1441                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$172       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1444                      .dwattr $C$DW$172, DW_AT_name("TIAFR")
    1445                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_TIAFR")
    1446                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1447                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$173       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1450                      .dwattr $C$DW$173, DW_AT_name("RSVD2")
    1451                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD2")
    1452                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1453                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$174       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1456                      .dwattr $C$DW$174, DW_AT_name("ODSCR")
    1457                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ODSCR")
    1458                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1459                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$175       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1462                      .dwattr $C$DW$175, DW_AT_name("PDINHIBR1")
    1463                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PDINHIBR1")
    1464                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1465                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   41

    1466              $C$DW$176       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1468                      .dwattr $C$DW$176, DW_AT_name("PDINHIBR2")
    1469                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PDINHIBR2")
    1470                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1471                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$177       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1474                      .dwattr $C$DW$177, DW_AT_name("PDINHIBR3")
    1475                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PDINHIBR3")
    1476                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1477                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$178       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1480                      .dwattr $C$DW$178, DW_AT_name("DMA0CESR1")
    1481                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DMA0CESR1")
    1482                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1483                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$179       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1486                      .dwattr $C$DW$179, DW_AT_name("DMA0CESR2")
    1487                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DMA0CESR2")
    1488                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1489                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$180       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1492                      .dwattr $C$DW$180, DW_AT_name("DMA1CESR1")
    1493                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA1CESR1")
    1494                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1495                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$181       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1498                      .dwattr $C$DW$181, DW_AT_name("DMA1CESR2")
    1499                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA1CESR2")
    1500                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1501                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$182       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1504                      .dwattr $C$DW$182, DW_AT_name("SDRAMCCR")
    1505                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SDRAMCCR")
    1506                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1507                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$183       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$183, DW_AT_name("CCR2")
    1511                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CCR2")
    1512                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1513                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$184       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1516                      .dwattr $C$DW$184, DW_AT_name("CGCR1")
    1517                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CGCR1")
    1518                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1519                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$185       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   42

    1521                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1522                      .dwattr $C$DW$185, DW_AT_name("CGICR")
    1523                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CGICR")
    1524                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1525                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$186       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1528                      .dwattr $C$DW$186, DW_AT_name("CGCR2")
    1529                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CGCR2")
    1530                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1531                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$187       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    1534                      .dwattr $C$DW$187, DW_AT_name("CGOCR")
    1535                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CGOCR")
    1536                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1537                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$188       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1540                      .dwattr $C$DW$188, DW_AT_name("CCSSR")
    1541                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CCSSR")
    1542                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1543                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$189       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1546                      .dwattr $C$DW$189, DW_AT_name("RSVD3")
    1547                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RSVD3")
    1548                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1549                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$190       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1552                      .dwattr $C$DW$190, DW_AT_name("ECDR")
    1553                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ECDR")
    1554                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1555                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$191       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1558                      .dwattr $C$DW$191, DW_AT_name("RSVD4")
    1559                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD4")
    1560                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1561                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$192       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1564                      .dwattr $C$DW$192, DW_AT_name("RAMSLPMDCNTLR1")
    1565                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1566                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1567                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$193       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1570                      .dwattr $C$DW$193, DW_AT_name("RSVD5")
    1571                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD5")
    1572                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1573                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$194       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   43

    1576                      .dwattr $C$DW$194, DW_AT_name("RAMSLPMDCNTLR2")
    1577                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1578                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1579                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$195       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1582                      .dwattr $C$DW$195, DW_AT_name("RAMSLPMDCNTLR3")
    1583                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1584                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1585                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$196       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1588                      .dwattr $C$DW$196, DW_AT_name("RAMSLPMDCNTLR4")
    1589                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1590                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1591                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$197       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1594                      .dwattr $C$DW$197, DW_AT_name("RAMSLPMDCNTLR5")
    1595                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1596                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1597                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$198       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    1600                      .dwattr $C$DW$198, DW_AT_name("RSVD6")
    1601                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSVD6")
    1602                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1603                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$199       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1606                      .dwattr $C$DW$199, DW_AT_name("DMAIFR")
    1607                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DMAIFR")
    1608                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1609                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$200       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1612                      .dwattr $C$DW$200, DW_AT_name("DMAIER")
    1613                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_DMAIER")
    1614                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1615                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$201       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1618                      .dwattr $C$DW$201, DW_AT_name("USBSCR")
    1619                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_USBSCR")
    1620                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1621                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$202       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1624                      .dwattr $C$DW$202, DW_AT_name("ESCR")
    1625                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ESCR")
    1626                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1627                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$203       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    1630                      .dwattr $C$DW$203, DW_AT_name("RSVD7")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   44

    1631                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RSVD7")
    1632                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1633                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$204       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    1636                      .dwattr $C$DW$204, DW_AT_name("DMA2CESR1")
    1637                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_DMA2CESR1")
    1638                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1639                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$205       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    1642                      .dwattr $C$DW$205, DW_AT_name("DMA2CESR2")
    1643                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_DMA2CESR2")
    1644                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1645                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$206       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    1648                      .dwattr $C$DW$206, DW_AT_name("DMA3CESR1")
    1649                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA3CESR1")
    1650                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1651                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$207       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    1654                      .dwattr $C$DW$207, DW_AT_name("DMA3CESR2")
    1655                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DMA3CESR2")
    1656                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1657                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$208       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    1660                      .dwattr $C$DW$208, DW_AT_name("CLKSTOP")
    1661                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CLKSTOP")
    1662                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1663                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$209       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    1666                      .dwattr $C$DW$209, DW_AT_name("RSVD8")
    1667                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD8")
    1668                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1669                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$210       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    1672                      .dwattr $C$DW$210, DW_AT_name("DIEIDR0")
    1673                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_DIEIDR0")
    1674                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1675                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1676              $C$DW$211       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    1678                      .dwattr $C$DW$211, DW_AT_name("DIEIDR1")
    1679                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_DIEIDR1")
    1680                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1681                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1682              $C$DW$212       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    1684                      .dwattr $C$DW$212, DW_AT_name("DIEIDR2")
    1685                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DIEIDR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   45

    1686                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1687                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1688              $C$DW$213       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    1690                      .dwattr $C$DW$213, DW_AT_name("DIEIDR3")
    1691                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DIEIDR3")
    1692                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1693                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1694              $C$DW$214       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    1696                      .dwattr $C$DW$214, DW_AT_name("DIEIDR4")
    1697                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DIEIDR4")
    1698                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1699                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1700              $C$DW$215       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    1702                      .dwattr $C$DW$215, DW_AT_name("DIEIDR5")
    1703                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR5")
    1704                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1705                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1706              $C$DW$216       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    1708                      .dwattr $C$DW$216, DW_AT_name("DIEIDR6")
    1709                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR6")
    1710                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1711                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1712              $C$DW$217       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    1714                      .dwattr $C$DW$217, DW_AT_name("DIEIDR7")
    1715                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DIEIDR7")
    1716                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1717                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1718                      .dwendtag $C$DW$T$43
    1719              
    1720              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1721                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$43)
    1722                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1723              $C$DW$218       .dwtag  DW_TAG_TI_far_type
    1724                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$55)
    1725              $C$DW$219       .dwtag  DW_TAG_TI_ioport_type
    1726                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$218)
    1727              $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    1728                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$219)
    1729              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1730                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1731                      .dwattr $C$DW$T$57, DW_AT_address_class(0x10)
    1732              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1733                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1734                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1735              
    1736              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1737                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    1738              $C$DW$220       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$44)
    1740                      .dwattr $C$DW$220, DW_AT_name("RSVD0")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   46

    1741                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RSVD0")
    1742                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$221       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    1746                      .dwattr $C$DW$221, DW_AT_name("IODIR1")
    1747                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_IODIR1")
    1748                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1749                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$222       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    1752                      .dwattr $C$DW$222, DW_AT_name("IODIR2")
    1753                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_IODIR2")
    1754                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1755                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$223       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    1758                      .dwattr $C$DW$223, DW_AT_name("IOINDATA1")
    1759                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_IOINDATA1")
    1760                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1761                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$224       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    1764                      .dwattr $C$DW$224, DW_AT_name("IOINDATA2")
    1765                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_IOINDATA2")
    1766                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1767                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$225       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    1770                      .dwattr $C$DW$225, DW_AT_name("IOOUTDATA1")
    1771                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_IOOUTDATA1")
    1772                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1773                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1774              $C$DW$226       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    1776                      .dwattr $C$DW$226, DW_AT_name("IOOUTDATA2")
    1777                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_IOOUTDATA2")
    1778                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1779                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$227       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    1782                      .dwattr $C$DW$227, DW_AT_name("IOINTEDG1")
    1783                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_IOINTEDG1")
    1784                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1785                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$228       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    1788                      .dwattr $C$DW$228, DW_AT_name("IOINTEDG2")
    1789                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_IOINTEDG2")
    1790                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1791                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$229       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    1794                      .dwattr $C$DW$229, DW_AT_name("IOINTEN1")
    1795                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_IOINTEN1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   47

    1796                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1797                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$230       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    1800                      .dwattr $C$DW$230, DW_AT_name("IOINTEN2")
    1801                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_IOINTEN2")
    1802                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1803                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1804              $C$DW$231       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    1806                      .dwattr $C$DW$231, DW_AT_name("IOINTFLG1")
    1807                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_IOINTFLG1")
    1808                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1809                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$232       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    1812                      .dwattr $C$DW$232, DW_AT_name("IOINTFLG2")
    1813                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_IOINTFLG2")
    1814                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1815                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1816                      .dwendtag $C$DW$T$45
    1817              
    1818              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    1819                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$45)
    1820                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1821              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    1822                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$59)
    1823              $C$DW$234       .dwtag  DW_TAG_TI_ioport_type
    1824                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$233)
    1825              $C$DW$T$60      .dwtag  DW_TAG_volatile_type
    1826                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$234)
    1827              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    1828                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1829                      .dwattr $C$DW$T$61, DW_AT_address_class(0x10)
    1830              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    1831                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1832                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1833              
    1834              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1835                      .dwattr $C$DW$T$52, DW_AT_name("CSL_LcdcObj")
    1836                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1837              $C$DW$235       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$49)
    1839                      .dwattr $C$DW$235, DW_AT_name("regs")
    1840                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_regs")
    1841                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$236       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$51)
    1845                      .dwattr $C$DW$236, DW_AT_name("perNum")
    1846                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_perNum")
    1847                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1848                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1849                      .dwendtag $C$DW$T$52
    1850              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:07 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_textDisplayExample.asm                                      PAGE   48

    1851              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    1852                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$52)
    1853                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1854              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1855                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1856                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1857              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    1858                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1859                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1860              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1861                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    1862              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1863                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1864                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1865                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1866              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1867                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1868                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1869                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1870              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1871                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1872                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1873                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1874              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1875                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$6)
    1876                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    1877              
    1878              $C$DW$T$79      .dwtag  DW_TAG_array_type
    1879                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$6)
    1880                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1881                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x80)
    1882              $C$DW$237       .dwtag  DW_TAG_subrange_type
    1883                      .dwattr $C$DW$237, DW_AT_upper_bound(0x7f)
    1884                      .dwendtag $C$DW$T$79
    1885              
    1886              
    1887              $C$DW$T$81      .dwtag  DW_TAG_array_type
    1888                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$6)
    1889                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1890                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x46)
    1891              $C$DW$238       .dwtag  DW_TAG_subrange_type
    1892                      .dwattr $C$DW$238, DW_AT_upper_bound(0x45)
    1893                      .dwendtag $C$DW$T$81
    1894              
    1895              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1896                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1897                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1898                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1899              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1900                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1901                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1902                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
