TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE    1

   15121              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:07 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

   14267              $C$DW$946       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
   14268              $C$DW$947       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
   14269                      .dwendtag $C$DW$T$25
   14270              
   14271              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
   14272                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
   14273                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
   14274              
   14275              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
   14276                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
   14277              $C$DW$948       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
   14278              $C$DW$949       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
   14279                      .dwendtag $C$DW$T$27
   14280              
   14281              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
   14282                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
   14283                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
   14284              
   14285              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
   14286                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
   14287              $C$DW$950       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
   14288              $C$DW$951       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
   14289                      .dwendtag $C$DW$T$29
   14290              
   14291              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
   14292                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
   14293                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
   14294              
   14295              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
   14296                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
   14297              $C$DW$952       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
   14298              $C$DW$953       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
   14299                      .dwendtag $C$DW$T$31
   14300              
   14301              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
   14302                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
   14303                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
   14304              
   14305              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
   14306                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
   14307              $C$DW$954       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
   14308              $C$DW$955       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
   14309                      .dwendtag $C$DW$T$42
   14310              
   14311              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  286

   14312                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
   14313                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   14314              
   14315              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
   14316                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
   14317              $C$DW$956       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_256"), DW_AT_const_value(0x00)
   14318              $C$DW$957       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_65K"), DW_AT_const_value(0x01)
   14319              $C$DW$958       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_1ST"), DW_AT_const_value(0x02)
   14320              $C$DW$959       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_2ND"), DW_AT_const_value(0x03)
   14321                      .dwendtag $C$DW$T$44
   14322              
   14323              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("eColourMode")
   14324                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
   14325                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
   14326              
   14327              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
   14328                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
   14329              $C$DW$960       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_NP"), DW_AT_const_value(0x00)
   14330              $C$DW$961       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_PS"), DW_AT_const_value(0x12)
   14331              $C$DW$962       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_NP"), DW_AT_const_value(0x05)
   14332              $C$DW$963       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_PS"), DW_AT_const_value(0x15)
   14333                      .dwendtag $C$DW$T$46
   14334              
   14335              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("ePowerSaveMode")
   14336                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
   14337                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
   14338              
   14339              $C$DW$T$24      .dwtag  DW_TAG_structure_type
   14340                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
   14341              $C$DW$964       .dwtag  DW_TAG_member
   14342                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$20)
   14343                      .dwattr $C$DW$964, DW_AT_name("LCDREVMIN")
   14344                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_LCDREVMIN")
   14345                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14346                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
   14347              $C$DW$965       .dwtag  DW_TAG_member
   14348                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$20)
   14349                      .dwattr $C$DW$965, DW_AT_name("LCDREVMAJ")
   14350                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_LCDREVMAJ")
   14351                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14352                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
   14353              $C$DW$966       .dwtag  DW_TAG_member
   14354                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$21)
   14355                      .dwattr $C$DW$966, DW_AT_name("RSVD0")
   14356                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_RSVD0")
   14357                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14358                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
   14359              $C$DW$967       .dwtag  DW_TAG_member
   14360                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$20)
   14361                      .dwattr $C$DW$967, DW_AT_name("LCDCR")
   14362                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_LCDCR")
   14363                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14364                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
   14365              $C$DW$968       .dwtag  DW_TAG_member
   14366                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  287

   14367                      .dwattr $C$DW$968, DW_AT_name("RSVD1")
   14368                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_RSVD1")
   14369                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14370                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
   14371              $C$DW$969       .dwtag  DW_TAG_member
   14372                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$20)
   14373                      .dwattr $C$DW$969, DW_AT_name("LCDSR")
   14374                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_LCDSR")
   14375                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14376                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
   14377              $C$DW$970       .dwtag  DW_TAG_member
   14378                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$22)
   14379                      .dwattr $C$DW$970, DW_AT_name("RSVD2")
   14380                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_RSVD2")
   14381                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14382                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
   14383              $C$DW$971       .dwtag  DW_TAG_member
   14384                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$20)
   14385                      .dwattr $C$DW$971, DW_AT_name("LCDLIDDCR")
   14386                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_LCDLIDDCR")
   14387                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14388                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
   14389              $C$DW$972       .dwtag  DW_TAG_member
   14390                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$22)
   14391                      .dwattr $C$DW$972, DW_AT_name("RSVD3")
   14392                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_RSVD3")
   14393                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   14394                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
   14395              $C$DW$973       .dwtag  DW_TAG_member
   14396                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$20)
   14397                      .dwattr $C$DW$973, DW_AT_name("LCDLIDDCS0CONFIG0")
   14398                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
   14399                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14400                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
   14401              $C$DW$974       .dwtag  DW_TAG_member
   14402                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$20)
   14403                      .dwattr $C$DW$974, DW_AT_name("LCDLIDDCS0CONFIG1")
   14404                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
   14405                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   14406                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
   14407              $C$DW$975       .dwtag  DW_TAG_member
   14408                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$21)
   14409                      .dwattr $C$DW$975, DW_AT_name("RSVD4")
   14410                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_RSVD4")
   14411                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14412                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
   14413              $C$DW$976       .dwtag  DW_TAG_member
   14414                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$20)
   14415                      .dwattr $C$DW$976, DW_AT_name("LCDLIDDCS0ADDR")
   14416                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
   14417                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14418                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
   14419              $C$DW$977       .dwtag  DW_TAG_member
   14420                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$22)
   14421                      .dwattr $C$DW$977, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  288

   14422                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_RSVD5")
   14423                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   14424                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
   14425              $C$DW$978       .dwtag  DW_TAG_member
   14426                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$20)
   14427                      .dwattr $C$DW$978, DW_AT_name("LCDLIDDCS0DATA")
   14428                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
   14429                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   14430                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
   14431              $C$DW$979       .dwtag  DW_TAG_member
   14432                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$22)
   14433                      .dwattr $C$DW$979, DW_AT_name("RSVD6")
   14434                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_RSVD6")
   14435                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   14436                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
   14437              $C$DW$980       .dwtag  DW_TAG_member
   14438                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$20)
   14439                      .dwattr $C$DW$980, DW_AT_name("LCDLIDDCS1CONFIG0")
   14440                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
   14441                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   14442                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
   14443              $C$DW$981       .dwtag  DW_TAG_member
   14444                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$20)
   14445                      .dwattr $C$DW$981, DW_AT_name("LCDLIDDCS1CONFIG1")
   14446                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
   14447                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   14448                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
   14449              $C$DW$982       .dwtag  DW_TAG_member
   14450                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$21)
   14451                      .dwattr $C$DW$982, DW_AT_name("RSVD7")
   14452                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_RSVD7")
   14453                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   14454                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
   14455              $C$DW$983       .dwtag  DW_TAG_member
   14456                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$20)
   14457                      .dwattr $C$DW$983, DW_AT_name("LCDLIDDCS1ADDR")
   14458                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
   14459                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   14460                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
   14461              $C$DW$984       .dwtag  DW_TAG_member
   14462                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$22)
   14463                      .dwattr $C$DW$984, DW_AT_name("RSVD8")
   14464                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_RSVD8")
   14465                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   14466                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
   14467              $C$DW$985       .dwtag  DW_TAG_member
   14468                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$20)
   14469                      .dwattr $C$DW$985, DW_AT_name("LCDLIDDCS1DATA")
   14470                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
   14471                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   14472                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
   14473              $C$DW$986       .dwtag  DW_TAG_member
   14474                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$23)
   14475                      .dwattr $C$DW$986, DW_AT_name("RSVD9")
   14476                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_RSVD9")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  289

   14477                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   14478                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
   14479              $C$DW$987       .dwtag  DW_TAG_member
   14480                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$20)
   14481                      .dwattr $C$DW$987, DW_AT_name("LCDDMACR")
   14482                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_LCDDMACR")
   14483                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14484                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
   14485              $C$DW$988       .dwtag  DW_TAG_member
   14486                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$22)
   14487                      .dwattr $C$DW$988, DW_AT_name("RSVD10")
   14488                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_RSVD10")
   14489                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   14490                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
   14491              $C$DW$989       .dwtag  DW_TAG_member
   14492                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$20)
   14493                      .dwattr $C$DW$989, DW_AT_name("LCDDMAFB0BAR0")
   14494                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
   14495                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14496                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
   14497              $C$DW$990       .dwtag  DW_TAG_member
   14498                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$20)
   14499                      .dwattr $C$DW$990, DW_AT_name("LCDDMAFB0BAR1")
   14500                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
   14501                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   14502                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
   14503              $C$DW$991       .dwtag  DW_TAG_member
   14504                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$21)
   14505                      .dwattr $C$DW$991, DW_AT_name("RSVD11")
   14506                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_RSVD11")
   14507                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14508                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
   14509              $C$DW$992       .dwtag  DW_TAG_member
   14510                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$20)
   14511                      .dwattr $C$DW$992, DW_AT_name("LCDDMAFB0CAR0")
   14512                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
   14513                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   14514                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
   14515              $C$DW$993       .dwtag  DW_TAG_member
   14516                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$20)
   14517                      .dwattr $C$DW$993, DW_AT_name("LCDDMAFB0CAR1")
   14518                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
   14519                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   14520                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
   14521              $C$DW$994       .dwtag  DW_TAG_member
   14522                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$21)
   14523                      .dwattr $C$DW$994, DW_AT_name("RSVD12")
   14524                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_RSVD12")
   14525                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   14526                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
   14527              $C$DW$995       .dwtag  DW_TAG_member
   14528                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$20)
   14529                      .dwattr $C$DW$995, DW_AT_name("LCDDMAFB1BAR0")
   14530                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
   14531                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  290

   14532                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
   14533              $C$DW$996       .dwtag  DW_TAG_member
   14534                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$20)
   14535                      .dwattr $C$DW$996, DW_AT_name("LCDDMAFB1BAR1")
   14536                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
   14537                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
   14538                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
   14539              $C$DW$997       .dwtag  DW_TAG_member
   14540                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$21)
   14541                      .dwattr $C$DW$997, DW_AT_name("RSVD13")
   14542                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_RSVD13")
   14543                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   14544                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
   14545              $C$DW$998       .dwtag  DW_TAG_member
   14546                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$20)
   14547                      .dwattr $C$DW$998, DW_AT_name("LCDDMAFB1CAR0")
   14548                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
   14549                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   14550                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
   14551              $C$DW$999       .dwtag  DW_TAG_member
   14552                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$20)
   14553                      .dwattr $C$DW$999, DW_AT_name("LCDDMAFB1CAR1")
   14554                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
   14555                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
   14556                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
   14557                      .dwendtag $C$DW$T$24
   14558              
   14559              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
   14560                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
   14561                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
   14562              $C$DW$1000      .dwtag  DW_TAG_TI_far_type
   14563                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$35)
   14564              $C$DW$1001      .dwtag  DW_TAG_TI_ioport_type
   14565                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$1000)
   14566              $C$DW$T$36      .dwtag  DW_TAG_volatile_type
   14567                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$1001)
   14568              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
   14569                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   14570                      .dwattr $C$DW$T$37, DW_AT_address_class(0x10)
   14571              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
   14572                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
   14573                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
   14574              
   14575              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   14576                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
   14577              $C$DW$1002      .dwtag  DW_TAG_member
   14578                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$26)
   14579                      .dwattr $C$DW$1002, DW_AT_name("burstSize")
   14580                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_burstSize")
   14581                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14582                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
   14583              $C$DW$1003      .dwtag  DW_TAG_member
   14584                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$28)
   14585                      .dwattr $C$DW$1003, DW_AT_name("eofIntEn")
   14586                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_eofIntEn")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  291

   14587                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14588                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
   14589              $C$DW$1004      .dwtag  DW_TAG_member
   14590                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$30)
   14591                      .dwattr $C$DW$1004, DW_AT_name("bigEndian")
   14592                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_bigEndian")
   14593                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14594                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
   14595              $C$DW$1005      .dwtag  DW_TAG_member
   14596                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$32)
   14597                      .dwattr $C$DW$1005, DW_AT_name("frameMode")
   14598                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_frameMode")
   14599                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14600                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
   14601              $C$DW$1006      .dwtag  DW_TAG_member
   14602                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$33)
   14603                      .dwattr $C$DW$1006, DW_AT_name("fb0Base")
   14604                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_fb0Base")
   14605                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14606                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
   14607              $C$DW$1007      .dwtag  DW_TAG_member
   14608                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$33)
   14609                      .dwattr $C$DW$1007, DW_AT_name("fb0Ceil")
   14610                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_fb0Ceil")
   14611                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14612                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
   14613              $C$DW$1008      .dwtag  DW_TAG_member
   14614                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$33)
   14615                      .dwattr $C$DW$1008, DW_AT_name("fb1Base")
   14616                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_fb1Base")
   14617                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14618                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
   14619              $C$DW$1009      .dwtag  DW_TAG_member
   14620                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$33)
   14621                      .dwattr $C$DW$1009, DW_AT_name("fb1Ceil")
   14622                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_fb1Ceil")
   14623                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14624                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
   14625                      .dwendtag $C$DW$T$34
   14626              
   14627              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
   14628                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$34)
   14629                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
   14630              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
   14631                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
   14632                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
   14633              
   14634              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   14635                      .dwattr $C$DW$T$41, DW_AT_name("CSL_LcdcObj")
   14636                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
   14637              $C$DW$1010      .dwtag  DW_TAG_member
   14638                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$38)
   14639                      .dwattr $C$DW$1010, DW_AT_name("regs")
   14640                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_regs")
   14641                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  292

   14642                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
   14643              $C$DW$1011      .dwtag  DW_TAG_member
   14644                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$40)
   14645                      .dwattr $C$DW$1011, DW_AT_name("perNum")
   14646                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_perNum")
   14647                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14648                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
   14649                      .dwendtag $C$DW$T$41
   14650              
   14651              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
   14652                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$41)
   14653                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
   14654              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
   14655                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   14656                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
   14657              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
   14658                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
   14659                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
   14660              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   14661                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
   14662              $C$DW$T$4       .dwtag  DW_TAG_base_type
   14663                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   14664                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   14665                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   14666              $C$DW$T$5       .dwtag  DW_TAG_base_type
   14667                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   14668                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   14669                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   14670              $C$DW$T$6       .dwtag  DW_TAG_base_type
   14671                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   14672                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   14673                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   14674              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
   14675                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$6)
   14676                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
   14677              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
   14678                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$6)
   14679                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
   14680              
   14681              $C$DW$T$83      .dwtag  DW_TAG_array_type
   14682                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$6)
   14683                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   14684                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x1000)
   14685              $C$DW$1012      .dwtag  DW_TAG_subrange_type
   14686                      .dwattr $C$DW$1012, DW_AT_upper_bound(0xfff)
   14687                      .dwendtag $C$DW$T$83
   14688              
   14689              $C$DW$T$7       .dwtag  DW_TAG_base_type
   14690                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   14691                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   14692                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
   14693              $C$DW$T$8       .dwtag  DW_TAG_base_type
   14694                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   14695                      .dwattr $C$DW$T$8, DW_AT_name("short")
   14696                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  293

   14697              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
   14698                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
   14699                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   14700              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
