TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE    1

    7247              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:18 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    5872              ;******************************************************************************
    5873              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    5874              ;******************************************************************************
    5875                      .global _LCD_init
    5876                      .global _LCD_open
    5877                      .global _LCD_setup
    5878                      .global _LCD_close
    5879                      .global _drawLine
    5880                      .global _panelSetup
    5881                      .global _draw_ti_logo
    5882                      .global _printf
    5883              
    5884              ;*******************************************************************************
    5885              ;* TYPE INFORMATION                                                            *
    5886              ;*******************************************************************************
    5887              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  116

    5888              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
    5889                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    5890              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_FDONE_DISABLE"), DW_AT_const_value(0x00)
    5891              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_FDONE_ENABLE"), DW_AT_const_value(0x01)
    5892                      .dwendtag $C$DW$T$25
    5893              
    5894              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFdoneCtl")
    5895                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    5896                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    5897              
    5898              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    5899                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5900              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
    5901              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
    5902                      .dwendtag $C$DW$T$27
    5903              
    5904              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
    5905                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    5906                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    5907              
    5908              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    5909                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5910              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_DMA_DISABLE"), DW_AT_const_value(0x00)
    5911              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_DMA_ENABLE"), DW_AT_const_value(0x01)
    5912                      .dwendtag $C$DW$T$29
    5913              
    5914              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaCtl")
    5915                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    5916                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    5917              
    5918              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    5919                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    5920              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    5921              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    5922              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    5923              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    5924              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    5925                      .dwendtag $C$DW$T$32
    5926              
    5927              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    5928                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    5929                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    5930              
    5931              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    5932                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    5933              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    5934              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    5935                      .dwendtag $C$DW$T$38
    5936              
    5937              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    5938                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    5939                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    5940              
    5941              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5942                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  117

    5943              $C$DW$82        .dwtag  DW_TAG_member
    5944                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    5945                      .dwattr $C$DW$82, DW_AT_name("LCDREVMIN")
    5946                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_LCDREVMIN")
    5947                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5948                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    5949              $C$DW$83        .dwtag  DW_TAG_member
    5950                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    5951                      .dwattr $C$DW$83, DW_AT_name("LCDREVMAJ")
    5952                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_LCDREVMAJ")
    5953                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5954                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    5955              $C$DW$84        .dwtag  DW_TAG_member
    5956                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    5957                      .dwattr $C$DW$84, DW_AT_name("RSVD0")
    5958                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_RSVD0")
    5959                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5960                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    5961              $C$DW$85        .dwtag  DW_TAG_member
    5962                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    5963                      .dwattr $C$DW$85, DW_AT_name("LCDCR")
    5964                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_LCDCR")
    5965                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5966                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    5967              $C$DW$86        .dwtag  DW_TAG_member
    5968                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
    5969                      .dwattr $C$DW$86, DW_AT_name("RSVD1")
    5970                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_RSVD1")
    5971                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5972                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    5973              $C$DW$87        .dwtag  DW_TAG_member
    5974                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    5975                      .dwattr $C$DW$87, DW_AT_name("LCDSR")
    5976                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_LCDSR")
    5977                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5978                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    5979              $C$DW$88        .dwtag  DW_TAG_member
    5980                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    5981                      .dwattr $C$DW$88, DW_AT_name("RSVD2")
    5982                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_RSVD2")
    5983                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5984                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    5985              $C$DW$89        .dwtag  DW_TAG_member
    5986                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    5987                      .dwattr $C$DW$89, DW_AT_name("LCDLIDDCR")
    5988                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LCDLIDDCR")
    5989                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5990                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    5991              $C$DW$90        .dwtag  DW_TAG_member
    5992                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
    5993                      .dwattr $C$DW$90, DW_AT_name("RSVD3")
    5994                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD3")
    5995                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5996                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    5997              $C$DW$91        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  118

    5998                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    5999                      .dwattr $C$DW$91, DW_AT_name("LCDLIDDCS0CONFIG0")
    6000                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    6001                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6002                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    6003              $C$DW$92        .dwtag  DW_TAG_member
    6004                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    6005                      .dwattr $C$DW$92, DW_AT_name("LCDLIDDCS0CONFIG1")
    6006                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    6007                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6008                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    6009              $C$DW$93        .dwtag  DW_TAG_member
    6010                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    6011                      .dwattr $C$DW$93, DW_AT_name("RSVD4")
    6012                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RSVD4")
    6013                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6014                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    6015              $C$DW$94        .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    6017                      .dwattr $C$DW$94, DW_AT_name("LCDLIDDCS0ADDR")
    6018                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    6019                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6020                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    6021              $C$DW$95        .dwtag  DW_TAG_member
    6022                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
    6023                      .dwattr $C$DW$95, DW_AT_name("RSVD5")
    6024                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RSVD5")
    6025                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6026                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    6027              $C$DW$96        .dwtag  DW_TAG_member
    6028                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    6029                      .dwattr $C$DW$96, DW_AT_name("LCDLIDDCS0DATA")
    6030                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    6031                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6032                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    6033              $C$DW$97        .dwtag  DW_TAG_member
    6034                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    6035                      .dwattr $C$DW$97, DW_AT_name("RSVD6")
    6036                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD6")
    6037                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6038                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    6039              $C$DW$98        .dwtag  DW_TAG_member
    6040                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    6041                      .dwattr $C$DW$98, DW_AT_name("LCDLIDDCS1CONFIG0")
    6042                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    6043                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6044                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    6045              $C$DW$99        .dwtag  DW_TAG_member
    6046                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    6047                      .dwattr $C$DW$99, DW_AT_name("LCDLIDDCS1CONFIG1")
    6048                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    6049                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6050                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    6051              $C$DW$100       .dwtag  DW_TAG_member
    6052                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  119

    6053                      .dwattr $C$DW$100, DW_AT_name("RSVD7")
    6054                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_RSVD7")
    6055                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6056                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    6057              $C$DW$101       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    6059                      .dwattr $C$DW$101, DW_AT_name("LCDLIDDCS1ADDR")
    6060                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    6061                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6062                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    6063              $C$DW$102       .dwtag  DW_TAG_member
    6064                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    6065                      .dwattr $C$DW$102, DW_AT_name("RSVD8")
    6066                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_RSVD8")
    6067                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6068                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    6069              $C$DW$103       .dwtag  DW_TAG_member
    6070                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    6071                      .dwattr $C$DW$103, DW_AT_name("LCDLIDDCS1DATA")
    6072                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    6073                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6074                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    6075              $C$DW$104       .dwtag  DW_TAG_member
    6076                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    6077                      .dwattr $C$DW$104, DW_AT_name("RSVD9")
    6078                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_RSVD9")
    6079                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6080                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    6081              $C$DW$105       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    6083                      .dwattr $C$DW$105, DW_AT_name("LCDDMACR")
    6084                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_LCDDMACR")
    6085                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6086                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    6087              $C$DW$106       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
    6089                      .dwattr $C$DW$106, DW_AT_name("RSVD10")
    6090                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_RSVD10")
    6091                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6092                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    6093              $C$DW$107       .dwtag  DW_TAG_member
    6094                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    6095                      .dwattr $C$DW$107, DW_AT_name("LCDDMAFB0BAR0")
    6096                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    6097                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6098                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    6099              $C$DW$108       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    6101                      .dwattr $C$DW$108, DW_AT_name("LCDDMAFB0BAR1")
    6102                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    6103                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6104                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    6105              $C$DW$109       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    6107                      .dwattr $C$DW$109, DW_AT_name("RSVD11")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  120

    6108                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_RSVD11")
    6109                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6110                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    6111              $C$DW$110       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    6113                      .dwattr $C$DW$110, DW_AT_name("LCDDMAFB0CAR0")
    6114                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    6115                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6116                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    6117              $C$DW$111       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    6119                      .dwattr $C$DW$111, DW_AT_name("LCDDMAFB0CAR1")
    6120                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    6121                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    6122                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    6123              $C$DW$112       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    6125                      .dwattr $C$DW$112, DW_AT_name("RSVD12")
    6126                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_RSVD12")
    6127                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6128                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    6129              $C$DW$113       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    6131                      .dwattr $C$DW$113, DW_AT_name("LCDDMAFB1BAR0")
    6132                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    6133                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6134                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    6135              $C$DW$114       .dwtag  DW_TAG_member
    6136                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    6137                      .dwattr $C$DW$114, DW_AT_name("LCDDMAFB1BAR1")
    6138                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    6139                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    6140                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    6141              $C$DW$115       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    6143                      .dwattr $C$DW$115, DW_AT_name("RSVD13")
    6144                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD13")
    6145                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6146                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    6147              $C$DW$116       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    6149                      .dwattr $C$DW$116, DW_AT_name("LCDDMAFB1CAR0")
    6150                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    6151                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6152                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    6153              $C$DW$117       .dwtag  DW_TAG_member
    6154                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    6155                      .dwattr $C$DW$117, DW_AT_name("LCDDMAFB1CAR1")
    6156                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    6157                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    6158                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    6159                      .dwendtag $C$DW$T$24
    6160              
    6161              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    6162                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  121

    6163                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6164              $C$DW$118       .dwtag  DW_TAG_TI_far_type
    6165                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$46)
    6166              $C$DW$119       .dwtag  DW_TAG_TI_ioport_type
    6167                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$118)
    6168              $C$DW$T$47      .dwtag  DW_TAG_volatile_type
    6169                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$119)
    6170              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    6171                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    6172                      .dwattr $C$DW$T$48, DW_AT_address_class(0x10)
    6173              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    6174                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6175                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6176              
    6177              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6178                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    6179              $C$DW$120       .dwtag  DW_TAG_member
    6180                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    6181                      .dwattr $C$DW$120, DW_AT_name("clkDiv")
    6182                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_clkDiv")
    6183                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6184                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    6185              $C$DW$121       .dwtag  DW_TAG_member
    6186                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$26)
    6187                      .dwattr $C$DW$121, DW_AT_name("fdoneIntEn")
    6188                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_fdoneIntEn")
    6189                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6190                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    6191              $C$DW$122       .dwtag  DW_TAG_member
    6192                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$28)
    6193                      .dwattr $C$DW$122, DW_AT_name("dmaCs0Cs1")
    6194                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    6195                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6196                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    6197              $C$DW$123       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    6199                      .dwattr $C$DW$123, DW_AT_name("dmaEnable")
    6200                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_dmaEnable")
    6201                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6202                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    6203              $C$DW$124       .dwtag  DW_TAG_member
    6204                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$31)
    6205                      .dwattr $C$DW$124, DW_AT_name("polControl")
    6206                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_polControl")
    6207                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6208                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    6209              $C$DW$125       .dwtag  DW_TAG_member
    6210                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$33)
    6211                      .dwattr $C$DW$125, DW_AT_name("modeSel")
    6212                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_modeSel")
    6213                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6214                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    6215                      .dwendtag $C$DW$T$34
    6216              
    6217              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  122

    6218                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    6219                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    6220              
    6221              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6222                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    6223              $C$DW$126       .dwtag  DW_TAG_member
    6224                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    6225                      .dwattr $C$DW$126, DW_AT_name("wSu")
    6226                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_wSu")
    6227                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6228                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    6229              $C$DW$127       .dwtag  DW_TAG_member
    6230                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    6231                      .dwattr $C$DW$127, DW_AT_name("wStrobe")
    6232                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_wStrobe")
    6233                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6234                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    6235              $C$DW$128       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    6237                      .dwattr $C$DW$128, DW_AT_name("wHold")
    6238                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_wHold")
    6239                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6240                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    6241              $C$DW$129       .dwtag  DW_TAG_member
    6242                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    6243                      .dwattr $C$DW$129, DW_AT_name("rSu")
    6244                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rSu")
    6245                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6246                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    6247              $C$DW$130       .dwtag  DW_TAG_member
    6248                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    6249                      .dwattr $C$DW$130, DW_AT_name("rStrobe")
    6250                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rStrobe")
    6251                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6252                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    6253              $C$DW$131       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    6255                      .dwattr $C$DW$131, DW_AT_name("rHold")
    6256                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rHold")
    6257                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6258                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    6259              $C$DW$132       .dwtag  DW_TAG_member
    6260                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    6261                      .dwattr $C$DW$132, DW_AT_name("ta")
    6262                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ta")
    6263                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6264                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    6265                      .dwendtag $C$DW$T$35
    6266              
    6267              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    6268                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    6269                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6270              
    6271              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6272                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  123

    6273              $C$DW$133       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$3)
    6275                      .dwattr $C$DW$133, DW_AT_name("extendSetup")
    6276                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_extendSetup")
    6277                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6278                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    6279              $C$DW$134       .dwtag  DW_TAG_member
    6280                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$36)
    6281                      .dwattr $C$DW$134, DW_AT_name("config")
    6282                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_config")
    6283                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6284                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    6285              $C$DW$135       .dwtag  DW_TAG_member
    6286                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$37)
    6287                      .dwattr $C$DW$135, DW_AT_name("timingCs0")
    6288                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_timingCs0")
    6289                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6290                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    6291              $C$DW$136       .dwtag  DW_TAG_member
    6292                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$39)
    6293                      .dwattr $C$DW$136, DW_AT_name("useCs1")
    6294                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_useCs1")
    6295                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6296                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    6297              $C$DW$137       .dwtag  DW_TAG_member
    6298                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$37)
    6299                      .dwattr $C$DW$137, DW_AT_name("timingCs1")
    6300                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_timingCs1")
    6301                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6302                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    6303                      .dwendtag $C$DW$T$40
    6304              
    6305              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    6306                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
    6307                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6308              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    6309                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    6310                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    6311              
    6312              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6313                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x48)
    6314              $C$DW$138       .dwtag  DW_TAG_member
    6315                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    6316                      .dwattr $C$DW$138, DW_AT_name("EBSR")
    6317                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_EBSR")
    6318                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6319                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    6320              $C$DW$139       .dwtag  DW_TAG_member
    6321                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    6322                      .dwattr $C$DW$139, DW_AT_name("RSVD0")
    6323                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_RSVD0")
    6324                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6325                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    6326              $C$DW$140       .dwtag  DW_TAG_member
    6327                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  124

    6328                      .dwattr $C$DW$140, DW_AT_name("PCGCR1")
    6329                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PCGCR1")
    6330                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6331                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    6332              $C$DW$141       .dwtag  DW_TAG_member
    6333                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    6334                      .dwattr $C$DW$141, DW_AT_name("PCGCR2")
    6335                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PCGCR2")
    6336                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6337                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    6338              $C$DW$142       .dwtag  DW_TAG_member
    6339                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    6340                      .dwattr $C$DW$142, DW_AT_name("PSRCR")
    6341                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PSRCR")
    6342                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6343                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    6344              $C$DW$143       .dwtag  DW_TAG_member
    6345                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    6346                      .dwattr $C$DW$143, DW_AT_name("PRCR")
    6347                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PRCR")
    6348                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6349                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    6350              $C$DW$144       .dwtag  DW_TAG_member
    6351                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    6352                      .dwattr $C$DW$144, DW_AT_name("RSVD1")
    6353                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RSVD1")
    6354                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6355                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    6356              $C$DW$145       .dwtag  DW_TAG_member
    6357                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    6358                      .dwattr $C$DW$145, DW_AT_name("TIAFR")
    6359                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_TIAFR")
    6360                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6361                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    6362              $C$DW$146       .dwtag  DW_TAG_member
    6363                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    6364                      .dwattr $C$DW$146, DW_AT_name("RSVD2")
    6365                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_RSVD2")
    6366                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6367                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    6368              $C$DW$147       .dwtag  DW_TAG_member
    6369                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    6370                      .dwattr $C$DW$147, DW_AT_name("ODSCR")
    6371                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ODSCR")
    6372                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6373                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    6374              $C$DW$148       .dwtag  DW_TAG_member
    6375                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    6376                      .dwattr $C$DW$148, DW_AT_name("PDINHIBR1")
    6377                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PDINHIBR1")
    6378                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6379                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    6380              $C$DW$149       .dwtag  DW_TAG_member
    6381                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    6382                      .dwattr $C$DW$149, DW_AT_name("PDINHIBR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  125

    6383                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PDINHIBR2")
    6384                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6385                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    6386              $C$DW$150       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    6388                      .dwattr $C$DW$150, DW_AT_name("PDINHIBR3")
    6389                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PDINHIBR3")
    6390                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6391                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    6392              $C$DW$151       .dwtag  DW_TAG_member
    6393                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    6394                      .dwattr $C$DW$151, DW_AT_name("DMA0CESR1")
    6395                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_DMA0CESR1")
    6396                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6397                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    6398              $C$DW$152       .dwtag  DW_TAG_member
    6399                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    6400                      .dwattr $C$DW$152, DW_AT_name("DMA0CESR2")
    6401                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DMA0CESR2")
    6402                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6403                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    6404              $C$DW$153       .dwtag  DW_TAG_member
    6405                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    6406                      .dwattr $C$DW$153, DW_AT_name("DMA1CESR1")
    6407                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DMA1CESR1")
    6408                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6409                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    6410              $C$DW$154       .dwtag  DW_TAG_member
    6411                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    6412                      .dwattr $C$DW$154, DW_AT_name("DMA1CESR2")
    6413                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DMA1CESR2")
    6414                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6415                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    6416              $C$DW$155       .dwtag  DW_TAG_member
    6417                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    6418                      .dwattr $C$DW$155, DW_AT_name("SDRAMCCR")
    6419                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_SDRAMCCR")
    6420                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6421                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    6422              $C$DW$156       .dwtag  DW_TAG_member
    6423                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    6424                      .dwattr $C$DW$156, DW_AT_name("CCR2")
    6425                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_CCR2")
    6426                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6427                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    6428              $C$DW$157       .dwtag  DW_TAG_member
    6429                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    6430                      .dwattr $C$DW$157, DW_AT_name("CGCR1")
    6431                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_CGCR1")
    6432                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6433                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    6434              $C$DW$158       .dwtag  DW_TAG_member
    6435                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    6436                      .dwattr $C$DW$158, DW_AT_name("CGICR")
    6437                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_CGICR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  126

    6438                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6439                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    6440              $C$DW$159       .dwtag  DW_TAG_member
    6441                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    6442                      .dwattr $C$DW$159, DW_AT_name("CGCR2")
    6443                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_CGCR2")
    6444                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6445                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    6446              $C$DW$160       .dwtag  DW_TAG_member
    6447                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    6448                      .dwattr $C$DW$160, DW_AT_name("CGOCR")
    6449                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CGOCR")
    6450                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6451                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    6452              $C$DW$161       .dwtag  DW_TAG_member
    6453                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    6454                      .dwattr $C$DW$161, DW_AT_name("CCSSR")
    6455                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_CCSSR")
    6456                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6457                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    6458              $C$DW$162       .dwtag  DW_TAG_member
    6459                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    6460                      .dwattr $C$DW$162, DW_AT_name("RSVD3")
    6461                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_RSVD3")
    6462                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6463                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    6464              $C$DW$163       .dwtag  DW_TAG_member
    6465                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    6466                      .dwattr $C$DW$163, DW_AT_name("ECDR")
    6467                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ECDR")
    6468                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6469                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    6470              $C$DW$164       .dwtag  DW_TAG_member
    6471                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    6472                      .dwattr $C$DW$164, DW_AT_name("RSVD4")
    6473                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD4")
    6474                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6475                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    6476              $C$DW$165       .dwtag  DW_TAG_member
    6477                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    6478                      .dwattr $C$DW$165, DW_AT_name("RAMSLPMDCNTLR1")
    6479                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    6480                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6481                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    6482              $C$DW$166       .dwtag  DW_TAG_member
    6483                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    6484                      .dwattr $C$DW$166, DW_AT_name("RSVD5")
    6485                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD5")
    6486                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6487                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    6488              $C$DW$167       .dwtag  DW_TAG_member
    6489                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    6490                      .dwattr $C$DW$167, DW_AT_name("RAMSLPMDCNTLR2")
    6491                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    6492                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  127

    6493                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    6494              $C$DW$168       .dwtag  DW_TAG_member
    6495                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    6496                      .dwattr $C$DW$168, DW_AT_name("RAMSLPMDCNTLR3")
    6497                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    6498                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6499                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    6500              $C$DW$169       .dwtag  DW_TAG_member
    6501                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    6502                      .dwattr $C$DW$169, DW_AT_name("RAMSLPMDCNTLR4")
    6503                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    6504                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6505                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    6506              $C$DW$170       .dwtag  DW_TAG_member
    6507                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    6508                      .dwattr $C$DW$170, DW_AT_name("RAMSLPMDCNTLR5")
    6509                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    6510                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6511                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    6512              $C$DW$171       .dwtag  DW_TAG_member
    6513                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    6514                      .dwattr $C$DW$171, DW_AT_name("RSVD6")
    6515                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD6")
    6516                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6517                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    6518              $C$DW$172       .dwtag  DW_TAG_member
    6519                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    6520                      .dwattr $C$DW$172, DW_AT_name("DMAIFR")
    6521                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DMAIFR")
    6522                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6523                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    6524              $C$DW$173       .dwtag  DW_TAG_member
    6525                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    6526                      .dwattr $C$DW$173, DW_AT_name("DMAIER")
    6527                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DMAIER")
    6528                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    6529                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    6530              $C$DW$174       .dwtag  DW_TAG_member
    6531                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    6532                      .dwattr $C$DW$174, DW_AT_name("USBSCR")
    6533                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_USBSCR")
    6534                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6535                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    6536              $C$DW$175       .dwtag  DW_TAG_member
    6537                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    6538                      .dwattr $C$DW$175, DW_AT_name("ESCR")
    6539                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ESCR")
    6540                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    6541                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    6542              $C$DW$176       .dwtag  DW_TAG_member
    6543                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    6544                      .dwattr $C$DW$176, DW_AT_name("RSVD7")
    6545                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_RSVD7")
    6546                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6547                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  128

    6548              $C$DW$177       .dwtag  DW_TAG_member
    6549                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    6550                      .dwattr $C$DW$177, DW_AT_name("DMA2CESR1")
    6551                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMA2CESR1")
    6552                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6553                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    6554              $C$DW$178       .dwtag  DW_TAG_member
    6555                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    6556                      .dwattr $C$DW$178, DW_AT_name("DMA2CESR2")
    6557                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DMA2CESR2")
    6558                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    6559                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    6560              $C$DW$179       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    6562                      .dwattr $C$DW$179, DW_AT_name("DMA3CESR1")
    6563                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DMA3CESR1")
    6564                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6565                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    6566              $C$DW$180       .dwtag  DW_TAG_member
    6567                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    6568                      .dwattr $C$DW$180, DW_AT_name("DMA3CESR2")
    6569                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA3CESR2")
    6570                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6571                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    6572              $C$DW$181       .dwtag  DW_TAG_member
    6573                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    6574                      .dwattr $C$DW$181, DW_AT_name("CLKSTOP")
    6575                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_CLKSTOP")
    6576                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6577                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    6578              $C$DW$182       .dwtag  DW_TAG_member
    6579                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$42)
    6580                      .dwattr $C$DW$182, DW_AT_name("RSVD8")
    6581                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD8")
    6582                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    6583                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    6584              $C$DW$183       .dwtag  DW_TAG_member
    6585                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    6586                      .dwattr $C$DW$183, DW_AT_name("DIEIDR0")
    6587                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DIEIDR0")
    6588                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6589                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    6590              $C$DW$184       .dwtag  DW_TAG_member
    6591                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    6592                      .dwattr $C$DW$184, DW_AT_name("DIEIDR1")
    6593                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DIEIDR1")
    6594                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6595                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    6596              $C$DW$185       .dwtag  DW_TAG_member
    6597                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    6598                      .dwattr $C$DW$185, DW_AT_name("DIEIDR2")
    6599                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DIEIDR2")
    6600                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6601                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    6602              $C$DW$186       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  129

    6603                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    6604                      .dwattr $C$DW$186, DW_AT_name("DIEIDR3")
    6605                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DIEIDR3")
    6606                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    6607                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    6608              $C$DW$187       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    6610                      .dwattr $C$DW$187, DW_AT_name("DIEIDR4")
    6611                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DIEIDR4")
    6612                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6613                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    6614              $C$DW$188       .dwtag  DW_TAG_member
    6615                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    6616                      .dwattr $C$DW$188, DW_AT_name("DIEIDR5")
    6617                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DIEIDR5")
    6618                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6619                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    6620              $C$DW$189       .dwtag  DW_TAG_member
    6621                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    6622                      .dwattr $C$DW$189, DW_AT_name("DIEIDR6")
    6623                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DIEIDR6")
    6624                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6625                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    6626              $C$DW$190       .dwtag  DW_TAG_member
    6627                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    6628                      .dwattr $C$DW$190, DW_AT_name("DIEIDR7")
    6629                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DIEIDR7")
    6630                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    6631                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    6632                      .dwendtag $C$DW$T$43
    6633              
    6634              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    6635                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$43)
    6636                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6637              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    6638                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$55)
    6639              $C$DW$192       .dwtag  DW_TAG_TI_ioport_type
    6640                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$191)
    6641              $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    6642                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$192)
    6643              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    6644                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    6645                      .dwattr $C$DW$T$57, DW_AT_address_class(0x10)
    6646              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    6647                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    6648                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6649              
    6650              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6651                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    6652              $C$DW$193       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$44)
    6654                      .dwattr $C$DW$193, DW_AT_name("RSVD0")
    6655                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD0")
    6656                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6657                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  130

    6658              $C$DW$194       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    6660                      .dwattr $C$DW$194, DW_AT_name("IODIR1")
    6661                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_IODIR1")
    6662                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6663                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$195       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    6666                      .dwattr $C$DW$195, DW_AT_name("IODIR2")
    6667                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_IODIR2")
    6668                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6669                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$196       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    6672                      .dwattr $C$DW$196, DW_AT_name("IOINDATA1")
    6673                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_IOINDATA1")
    6674                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6675                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$197       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    6678                      .dwattr $C$DW$197, DW_AT_name("IOINDATA2")
    6679                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_IOINDATA2")
    6680                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6681                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$198       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    6684                      .dwattr $C$DW$198, DW_AT_name("IOOUTDATA1")
    6685                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_IOOUTDATA1")
    6686                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6687                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$199       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    6690                      .dwattr $C$DW$199, DW_AT_name("IOOUTDATA2")
    6691                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_IOOUTDATA2")
    6692                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6693                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$200       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    6696                      .dwattr $C$DW$200, DW_AT_name("IOINTEDG1")
    6697                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_IOINTEDG1")
    6698                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6699                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$201       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    6702                      .dwattr $C$DW$201, DW_AT_name("IOINTEDG2")
    6703                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_IOINTEDG2")
    6704                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6705                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$202       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    6708                      .dwattr $C$DW$202, DW_AT_name("IOINTEN1")
    6709                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_IOINTEN1")
    6710                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6711                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$203       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  131

    6713                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    6714                      .dwattr $C$DW$203, DW_AT_name("IOINTEN2")
    6715                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_IOINTEN2")
    6716                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6717                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$204       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    6720                      .dwattr $C$DW$204, DW_AT_name("IOINTFLG1")
    6721                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_IOINTFLG1")
    6722                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6723                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$205       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    6726                      .dwattr $C$DW$205, DW_AT_name("IOINTFLG2")
    6727                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_IOINTFLG2")
    6728                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6729                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    6730                      .dwendtag $C$DW$T$45
    6731              
    6732              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    6733                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$45)
    6734                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6735              $C$DW$206       .dwtag  DW_TAG_TI_far_type
    6736                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$59)
    6737              $C$DW$207       .dwtag  DW_TAG_TI_ioport_type
    6738                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$206)
    6739              $C$DW$T$60      .dwtag  DW_TAG_volatile_type
    6740                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$207)
    6741              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    6742                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    6743                      .dwattr $C$DW$T$61, DW_AT_address_class(0x10)
    6744              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    6745                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    6746                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6747              
    6748              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    6749                      .dwattr $C$DW$T$52, DW_AT_name("CSL_LcdcObj")
    6750                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    6751              $C$DW$208       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$49)
    6753                      .dwattr $C$DW$208, DW_AT_name("regs")
    6754                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_regs")
    6755                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6756                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    6757              $C$DW$209       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$51)
    6759                      .dwattr $C$DW$209, DW_AT_name("perNum")
    6760                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_perNum")
    6761                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6762                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    6763                      .dwendtag $C$DW$T$52
    6764              
    6765              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    6766                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$52)
    6767                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:19 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DiagramExample.asm                                          PAGE  132

    6768              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    6769                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    6770                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    6771              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    6772                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    6773                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    6774              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6775                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    6776              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6777                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6778                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6779                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6780              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6781                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6782                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6783                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6784              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6785                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6786                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6787                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6788              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6789                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6790                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6791                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6792              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6793                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6794                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6795                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6796              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    6797                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    6798                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6799              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    6800                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    6801                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6802              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    6803                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$50)
    6804                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    6805              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    6806                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    6807                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    6808              $C$DW$210       .dwtag  DW_TAG_TI_far_type
    6809                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$50)
    6810              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    6811                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$210)
    6812              $C$DW$T$9       .dwtag  DW_TAG_base_type
