TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE    1

    8942              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:19 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    8184                      .dwattr $C$DW$771, DW_AT_TI_end_line(0x560)
    8185              $C$DW$772       .dwtag  DW_TAG_TI_loop_range
    8186                      .dwattr $C$DW$772, DW_AT_low_pc($C$DW$L$_draw_ti_logo$3$B)
    8187                      .dwattr $C$DW$772, DW_AT_high_pc($C$DW$L$_draw_ti_logo$3$E)
    8188              $C$DW$773       .dwtag  DW_TAG_TI_loop_range
    8189                      .dwattr $C$DW$773, DW_AT_low_pc($C$DW$L$_draw_ti_logo$4$B)
    8190                      .dwattr $C$DW$773, DW_AT_high_pc($C$DW$L$_draw_ti_logo$4$E)
    8191              $C$DW$774       .dwtag  DW_TAG_TI_loop_range
    8192                      .dwattr $C$DW$774, DW_AT_low_pc($C$DW$L$_draw_ti_logo$5$B)
    8193                      .dwattr $C$DW$774, DW_AT_high_pc($C$DW$L$_draw_ti_logo$5$E)
    8194              $C$DW$775       .dwtag  DW_TAG_TI_loop_range
    8195                      .dwattr $C$DW$775, DW_AT_low_pc($C$DW$L$_draw_ti_logo$6$B)
    8196                      .dwattr $C$DW$775, DW_AT_high_pc($C$DW$L$_draw_ti_logo$6$E)
    8197                      .dwendtag $C$DW$771
    8198              
    8199                      .dwendtag $C$DW$768
    8200              
    8201                      .dwattr $C$DW$732, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lcd/
    8202                      .dwattr $C$DW$732, DW_AT_TI_end_line(0x57d)
    8203                      .dwattr $C$DW$732, DW_AT_TI_end_column(0x01)
    8204                      .dwendentry
    8205                      .dwendtag $C$DW$732
    8206              
    8207              ;******************************************************************************
    8208              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    8209              ;******************************************************************************
    8210                      .global _hLcdc
    8211                      .global _ti_logo64
    8212                      .global _ti_logo32
    8213                      .global __divd
    8214                      .global __fltid
    8215                      .global __fltud
    8216                      .global __mpyd
    8217                      .global __subd
    8218                      .global __addd
    8219                      .global __fixdu
    8220              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  170

    8221              ;*******************************************************************************
    8222              ;* TYPE INFORMATION                                                            *
    8223              ;*******************************************************************************
    8224              
    8225              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    8226                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    8227              $C$DW$776       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
    8228              $C$DW$777       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
    8229                      .dwendtag $C$DW$T$32
    8230              
    8231              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
    8232                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    8233                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    8234              
    8235              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    8236                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    8237              $C$DW$778       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_256"), DW_AT_const_value(0x00)
    8238              $C$DW$779       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_65K"), DW_AT_const_value(0x01)
    8239              $C$DW$780       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_1ST"), DW_AT_const_value(0x02)
    8240              $C$DW$781       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_2ND"), DW_AT_const_value(0x03)
    8241                      .dwendtag $C$DW$T$34
    8242              
    8243              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("eColourMode")
    8244                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    8245                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    8246              
    8247              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    8248                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8249              $C$DW$782       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_NP"), DW_AT_const_value(0x00)
    8250              $C$DW$783       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_PS"), DW_AT_const_value(0x12)
    8251              $C$DW$784       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_NP"), DW_AT_const_value(0x05)
    8252              $C$DW$785       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_PS"), DW_AT_const_value(0x15)
    8253                      .dwendtag $C$DW$T$36
    8254              
    8255              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("ePowerSaveMode")
    8256                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    8257                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    8258              
    8259              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    8260                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    8261              $C$DW$786       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$20)
    8263                      .dwattr $C$DW$786, DW_AT_name("LCDREVMIN")
    8264                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_LCDREVMIN")
    8265                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8266                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8267              $C$DW$787       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
    8269                      .dwattr $C$DW$787, DW_AT_name("LCDREVMAJ")
    8270                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_LCDREVMAJ")
    8271                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8272                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8273              $C$DW$788       .dwtag  DW_TAG_member
    8274                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$21)
    8275                      .dwattr $C$DW$788, DW_AT_name("RSVD0")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  171

    8276                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_RSVD0")
    8277                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8278                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8279              $C$DW$789       .dwtag  DW_TAG_member
    8280                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$20)
    8281                      .dwattr $C$DW$789, DW_AT_name("LCDCR")
    8282                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_LCDCR")
    8283                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8284                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8285              $C$DW$790       .dwtag  DW_TAG_member
    8286                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$22)
    8287                      .dwattr $C$DW$790, DW_AT_name("RSVD1")
    8288                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_RSVD1")
    8289                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8290                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8291              $C$DW$791       .dwtag  DW_TAG_member
    8292                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$20)
    8293                      .dwattr $C$DW$791, DW_AT_name("LCDSR")
    8294                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_LCDSR")
    8295                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8296                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8297              $C$DW$792       .dwtag  DW_TAG_member
    8298                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$22)
    8299                      .dwattr $C$DW$792, DW_AT_name("RSVD2")
    8300                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_RSVD2")
    8301                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8302                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8303              $C$DW$793       .dwtag  DW_TAG_member
    8304                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$20)
    8305                      .dwattr $C$DW$793, DW_AT_name("LCDLIDDCR")
    8306                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_LCDLIDDCR")
    8307                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8308                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8309              $C$DW$794       .dwtag  DW_TAG_member
    8310                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$22)
    8311                      .dwattr $C$DW$794, DW_AT_name("RSVD3")
    8312                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_RSVD3")
    8313                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8314                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8315              $C$DW$795       .dwtag  DW_TAG_member
    8316                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$20)
    8317                      .dwattr $C$DW$795, DW_AT_name("LCDLIDDCS0CONFIG0")
    8318                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    8319                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8320                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8321              $C$DW$796       .dwtag  DW_TAG_member
    8322                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$20)
    8323                      .dwattr $C$DW$796, DW_AT_name("LCDLIDDCS0CONFIG1")
    8324                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    8325                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8326                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8327              $C$DW$797       .dwtag  DW_TAG_member
    8328                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$21)
    8329                      .dwattr $C$DW$797, DW_AT_name("RSVD4")
    8330                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_RSVD4")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  172

    8331                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8332                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8333              $C$DW$798       .dwtag  DW_TAG_member
    8334                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    8335                      .dwattr $C$DW$798, DW_AT_name("LCDLIDDCS0ADDR")
    8336                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    8337                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8338                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8339              $C$DW$799       .dwtag  DW_TAG_member
    8340                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$22)
    8341                      .dwattr $C$DW$799, DW_AT_name("RSVD5")
    8342                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_RSVD5")
    8343                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8344                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8345              $C$DW$800       .dwtag  DW_TAG_member
    8346                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$20)
    8347                      .dwattr $C$DW$800, DW_AT_name("LCDLIDDCS0DATA")
    8348                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    8349                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8350                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8351              $C$DW$801       .dwtag  DW_TAG_member
    8352                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$22)
    8353                      .dwattr $C$DW$801, DW_AT_name("RSVD6")
    8354                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_RSVD6")
    8355                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8356                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8357              $C$DW$802       .dwtag  DW_TAG_member
    8358                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    8359                      .dwattr $C$DW$802, DW_AT_name("LCDLIDDCS1CONFIG0")
    8360                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    8361                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8362                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8363              $C$DW$803       .dwtag  DW_TAG_member
    8364                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
    8365                      .dwattr $C$DW$803, DW_AT_name("LCDLIDDCS1CONFIG1")
    8366                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    8367                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8368                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8369              $C$DW$804       .dwtag  DW_TAG_member
    8370                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$21)
    8371                      .dwattr $C$DW$804, DW_AT_name("RSVD7")
    8372                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_RSVD7")
    8373                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8374                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8375              $C$DW$805       .dwtag  DW_TAG_member
    8376                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    8377                      .dwattr $C$DW$805, DW_AT_name("LCDLIDDCS1ADDR")
    8378                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    8379                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8380                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8381              $C$DW$806       .dwtag  DW_TAG_member
    8382                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$22)
    8383                      .dwattr $C$DW$806, DW_AT_name("RSVD8")
    8384                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_RSVD8")
    8385                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  173

    8386                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    8387              $C$DW$807       .dwtag  DW_TAG_member
    8388                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    8389                      .dwattr $C$DW$807, DW_AT_name("LCDLIDDCS1DATA")
    8390                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    8391                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8392                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8393              $C$DW$808       .dwtag  DW_TAG_member
    8394                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$23)
    8395                      .dwattr $C$DW$808, DW_AT_name("RSVD9")
    8396                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_RSVD9")
    8397                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8398                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8399              $C$DW$809       .dwtag  DW_TAG_member
    8400                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$20)
    8401                      .dwattr $C$DW$809, DW_AT_name("LCDDMACR")
    8402                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_LCDDMACR")
    8403                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8404                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8405              $C$DW$810       .dwtag  DW_TAG_member
    8406                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    8407                      .dwattr $C$DW$810, DW_AT_name("RSVD10")
    8408                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_RSVD10")
    8409                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    8410                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8411              $C$DW$811       .dwtag  DW_TAG_member
    8412                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
    8413                      .dwattr $C$DW$811, DW_AT_name("LCDDMAFB0BAR0")
    8414                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    8415                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8416                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8417              $C$DW$812       .dwtag  DW_TAG_member
    8418                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    8419                      .dwattr $C$DW$812, DW_AT_name("LCDDMAFB0BAR1")
    8420                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    8421                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    8422                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8423              $C$DW$813       .dwtag  DW_TAG_member
    8424                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$21)
    8425                      .dwattr $C$DW$813, DW_AT_name("RSVD11")
    8426                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_RSVD11")
    8427                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8428                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8429              $C$DW$814       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    8431                      .dwattr $C$DW$814, DW_AT_name("LCDDMAFB0CAR0")
    8432                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    8433                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8434                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8435              $C$DW$815       .dwtag  DW_TAG_member
    8436                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    8437                      .dwattr $C$DW$815, DW_AT_name("LCDDMAFB0CAR1")
    8438                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    8439                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    8440                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  174

    8441              $C$DW$816       .dwtag  DW_TAG_member
    8442                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$21)
    8443                      .dwattr $C$DW$816, DW_AT_name("RSVD12")
    8444                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_RSVD12")
    8445                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    8446                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    8447              $C$DW$817       .dwtag  DW_TAG_member
    8448                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    8449                      .dwattr $C$DW$817, DW_AT_name("LCDDMAFB1BAR0")
    8450                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    8451                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8452                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    8453              $C$DW$818       .dwtag  DW_TAG_member
    8454                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    8455                      .dwattr $C$DW$818, DW_AT_name("LCDDMAFB1BAR1")
    8456                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    8457                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    8458                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    8459              $C$DW$819       .dwtag  DW_TAG_member
    8460                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$21)
    8461                      .dwattr $C$DW$819, DW_AT_name("RSVD13")
    8462                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_RSVD13")
    8463                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    8464                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    8465              $C$DW$820       .dwtag  DW_TAG_member
    8466                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
    8467                      .dwattr $C$DW$820, DW_AT_name("LCDDMAFB1CAR0")
    8468                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    8469                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8470                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    8471              $C$DW$821       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$20)
    8473                      .dwattr $C$DW$821, DW_AT_name("LCDDMAFB1CAR1")
    8474                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    8475                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    8476                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    8477                      .dwendtag $C$DW$T$24
    8478              
    8479              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    8480                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    8481                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    8482              $C$DW$822       .dwtag  DW_TAG_TI_far_type
    8483                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$25)
    8484              $C$DW$823       .dwtag  DW_TAG_TI_ioport_type
    8485                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$822)
    8486              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    8487                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$823)
    8488              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    8489                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    8490                      .dwattr $C$DW$T$27, DW_AT_address_class(0x10)
    8491              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    8492                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    8493                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    8494              
    8495              $C$DW$T$31      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  175

    8496                      .dwattr $C$DW$T$31, DW_AT_name("CSL_LcdcObj")
    8497                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    8498              $C$DW$824       .dwtag  DW_TAG_member
    8499                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$28)
    8500                      .dwattr $C$DW$824, DW_AT_name("regs")
    8501                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_regs")
    8502                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8503                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    8504              $C$DW$825       .dwtag  DW_TAG_member
    8505                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$30)
    8506                      .dwattr $C$DW$825, DW_AT_name("perNum")
    8507                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_perNum")
    8508                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8509                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    8510                      .dwendtag $C$DW$T$31
    8511              
    8512              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    8513                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    8514                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8515              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    8516                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    8517                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    8518              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    8519                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    8520                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8521              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    8522                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    8523              $C$DW$T$4       .dwtag  DW_TAG_base_type
    8524                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    8525                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    8526                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    8527              $C$DW$T$5       .dwtag  DW_TAG_base_type
    8528                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    8529                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    8530                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    8531              $C$DW$T$6       .dwtag  DW_TAG_base_type
    8532                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    8533                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    8534                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    8535              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    8536                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$6)
    8537                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    8538              $C$DW$T$7       .dwtag  DW_TAG_base_type
    8539                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    8540                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    8541                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    8542              $C$DW$T$8       .dwtag  DW_TAG_base_type
    8543                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    8544                      .dwattr $C$DW$T$8, DW_AT_name("short")
    8545                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    8546              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    8547                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$8)
    8548                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    8549              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    8550                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  176

    8551                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    8552              $C$DW$T$9       .dwtag  DW_TAG_base_type
    8553                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    8554                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    8555                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    8556              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    8557                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    8558                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    8559              $C$DW$826       .dwtag  DW_TAG_TI_far_type
