TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE    1

    4793              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:03 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2422              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    2423                      .dwendtag $C$DW$T$72
    2424              
    2425              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    2426                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2427                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2428              
    2429              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    2430                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    2431              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    2432              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    2433              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    2434              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    2435                      .dwendtag $C$DW$T$85
    2436              
    2437              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    2438                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2439                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2440              
    2441              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    2442                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    2443              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    2444              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    2445                      .dwendtag $C$DW$T$96
    2446              
    2447              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    2448                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2449                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2450              
    2451              $C$DW$T$104     .dwtag  DW_TAG_enumeration_type
    2452                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    2453              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
    2454              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
    2455              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
    2456                      .dwendtag $C$DW$T$104
    2457              
    2458              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
    2459                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    2460                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2461              
    2462              $C$DW$T$106     .dwtag  DW_TAG_enumeration_type
    2463                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    2464              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATDNE_INTERRUPT"), DW_AT_const_value(0x01)
    2465              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EBSYDNE_INTERRUPT"), DW_AT_const_value(0x02)
    2466              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ERSPDNE_INTERRUPT"), DW_AT_const_value(0x04)
    2467              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRD_INTERRUPT"), DW_AT_const_value(0x08)
    2468              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRS_INTERRUPT"), DW_AT_const_value(0x10)
    2469              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCWR_INTERRUPT"), DW_AT_const_value(0x20)
    2470              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRD_INTERRUPT"), DW_AT_const_value(0x40)
    2471              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRS_INTERRUPT"), DW_AT_const_value(0x80)
    2472              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_RSV_BIT"), DW_AT_const_value(0x100)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   76

    2473              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDXRDY_INTERRUPT"), DW_AT_const_value(0x200)
    2474              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDRRDY_INTERRUPT"), DW_AT_const_value(0x400)
    2475              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATED_INTERRUPT"), DW_AT_const_value(0x800)
    2476              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETRNDNE_INTERRUPT"), DW_AT_const_value(0x100
    2477              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INTERRUPT_NONE"), DW_AT_const_value(0x2000)
    2478                      .dwendtag $C$DW$T$106
    2479              
    2480              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDEventType")
    2481                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    2482                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2483              
    2484              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2485                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    2486              $C$DW$306       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2488                      .dwattr $C$DW$306, DW_AT_name("MMCCTL")
    2489                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_MMCCTL")
    2490                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2492              $C$DW$307       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    2494                      .dwattr $C$DW$307, DW_AT_name("RSVD0")
    2495                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD0")
    2496                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2497                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$308       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2500                      .dwattr $C$DW$308, DW_AT_name("MMCCLK")
    2501                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_MMCCLK")
    2502                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2503                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$309       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    2506                      .dwattr $C$DW$309, DW_AT_name("RSVD1")
    2507                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD1")
    2508                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2509                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$310       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2512                      .dwattr $C$DW$310, DW_AT_name("MMCST0")
    2513                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_MMCST0")
    2514                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2515                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$311       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    2518                      .dwattr $C$DW$311, DW_AT_name("RSVD2")
    2519                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD2")
    2520                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2521                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2522              $C$DW$312       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    2524                      .dwattr $C$DW$312, DW_AT_name("MMCST1")
    2525                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_MMCST1")
    2526                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2527                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   77

    2528              $C$DW$313       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    2530                      .dwattr $C$DW$313, DW_AT_name("RSVD3")
    2531                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_RSVD3")
    2532                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2533                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$314       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    2536                      .dwattr $C$DW$314, DW_AT_name("MMCIM")
    2537                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_MMCIM")
    2538                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2539                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2540              $C$DW$315       .dwtag  DW_TAG_member
    2541                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    2542                      .dwattr $C$DW$315, DW_AT_name("RSVD4")
    2543                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD4")
    2544                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2545                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2546              $C$DW$316       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2548                      .dwattr $C$DW$316, DW_AT_name("MMCTOR")
    2549                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_MMCTOR")
    2550                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2551                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2552              $C$DW$317       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    2554                      .dwattr $C$DW$317, DW_AT_name("RSVD5")
    2555                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD5")
    2556                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2557                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2558              $C$DW$318       .dwtag  DW_TAG_member
    2559                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    2560                      .dwattr $C$DW$318, DW_AT_name("MMCTOD")
    2561                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_MMCTOD")
    2562                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2563                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2564              $C$DW$319       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    2566                      .dwattr $C$DW$319, DW_AT_name("RSVD6")
    2567                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_RSVD6")
    2568                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2569                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2570              $C$DW$320       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    2572                      .dwattr $C$DW$320, DW_AT_name("MMCBLEN")
    2573                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_MMCBLEN")
    2574                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2575                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2576              $C$DW$321       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    2578                      .dwattr $C$DW$321, DW_AT_name("RSVD7")
    2579                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_RSVD7")
    2580                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2581                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2582              $C$DW$322       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   78

    2583                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    2584                      .dwattr $C$DW$322, DW_AT_name("MMCNBLK")
    2585                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_MMCNBLK")
    2586                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2587                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$323       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    2590                      .dwattr $C$DW$323, DW_AT_name("RSVD8")
    2591                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD8")
    2592                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2593                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$324       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    2596                      .dwattr $C$DW$324, DW_AT_name("MMCNBLC")
    2597                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_MMCNBLC")
    2598                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2599                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2600              $C$DW$325       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    2602                      .dwattr $C$DW$325, DW_AT_name("RSVD9")
    2603                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_RSVD9")
    2604                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2605                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2606              $C$DW$326       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    2608                      .dwattr $C$DW$326, DW_AT_name("MMCDRR1")
    2609                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_MMCDRR1")
    2610                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2611                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2612              $C$DW$327       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    2614                      .dwattr $C$DW$327, DW_AT_name("MMCDRR2")
    2615                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_MMCDRR2")
    2616                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2617                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$328       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
    2620                      .dwattr $C$DW$328, DW_AT_name("RSVD10")
    2621                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD10")
    2622                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2623                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$329       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    2626                      .dwattr $C$DW$329, DW_AT_name("MMCDXR1")
    2627                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_MMCDXR1")
    2628                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2629                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$330       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    2632                      .dwattr $C$DW$330, DW_AT_name("MMCDXR2")
    2633                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_MMCDXR2")
    2634                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2635                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$331       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   79

    2638                      .dwattr $C$DW$331, DW_AT_name("RSVD11")
    2639                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD11")
    2640                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2641                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$332       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    2644                      .dwattr $C$DW$332, DW_AT_name("MMCCMD1")
    2645                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_MMCCMD1")
    2646                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2647                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$333       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    2650                      .dwattr $C$DW$333, DW_AT_name("MMCCMD2")
    2651                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_MMCCMD2")
    2652                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2653                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$334       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
    2656                      .dwattr $C$DW$334, DW_AT_name("RSVD12")
    2657                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_RSVD12")
    2658                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2659                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$335       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    2662                      .dwattr $C$DW$335, DW_AT_name("MMCARG1")
    2663                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_MMCARG1")
    2664                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2665                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$336       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$336, DW_AT_name("MMCARG2")
    2669                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_MMCARG2")
    2670                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2671                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$337       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$22)
    2674                      .dwattr $C$DW$337, DW_AT_name("RSVD13")
    2675                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD13")
    2676                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2677                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$338       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    2680                      .dwattr $C$DW$338, DW_AT_name("MMCRSP0")
    2681                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_MMCRSP0")
    2682                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2683                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$339       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    2686                      .dwattr $C$DW$339, DW_AT_name("MMCRSP1")
    2687                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_MMCRSP1")
    2688                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2689                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$340       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    2692                      .dwattr $C$DW$340, DW_AT_name("RSVD14")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   80

    2693                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD14")
    2694                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2695                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$341       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    2698                      .dwattr $C$DW$341, DW_AT_name("MMCRSP2")
    2699                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_MMCRSP2")
    2700                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2701                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$342       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$342, DW_AT_name("MMCRSP3")
    2705                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_MMCRSP3")
    2706                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    2707                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$343       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    2710                      .dwattr $C$DW$343, DW_AT_name("RSVD15")
    2711                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD15")
    2712                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2713                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$344       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$344, DW_AT_name("MMCRSP4")
    2717                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_MMCRSP4")
    2718                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2719                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$345       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$345, DW_AT_name("MMCRSP5")
    2723                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_MMCRSP5")
    2724                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2725                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$346       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    2728                      .dwattr $C$DW$346, DW_AT_name("RSVD16")
    2729                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD16")
    2730                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2731                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$347       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$347, DW_AT_name("MMCRSP6")
    2735                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_MMCRSP6")
    2736                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2737                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$348       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    2740                      .dwattr $C$DW$348, DW_AT_name("MMCRSP7")
    2741                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_MMCRSP7")
    2742                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2743                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$349       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$22)
    2746                      .dwattr $C$DW$349, DW_AT_name("RSVD17")
    2747                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD17")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   81

    2748                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2749                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$350       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$350, DW_AT_name("MMCDRSP")
    2753                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_MMCDRSP")
    2754                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2755                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$351       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    2758                      .dwattr $C$DW$351, DW_AT_name("RSVD18")
    2759                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RSVD18")
    2760                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2761                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$352       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$352, DW_AT_name("MMCCIDX")
    2765                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_MMCCIDX")
    2766                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2767                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$353       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$24)
    2770                      .dwattr $C$DW$353, DW_AT_name("RSVD19")
    2771                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RSVD19")
    2772                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    2773                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$354       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$354, DW_AT_name("SDIOCTL")
    2777                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_SDIOCTL")
    2778                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2779                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$355       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    2782                      .dwattr $C$DW$355, DW_AT_name("RSVD20")
    2783                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD20")
    2784                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2785                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$356       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2788                      .dwattr $C$DW$356, DW_AT_name("SDIOST0")
    2789                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_SDIOST0")
    2790                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2791                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$357       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    2794                      .dwattr $C$DW$357, DW_AT_name("RSVD21")
    2795                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_RSVD21")
    2796                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    2797                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$358       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$358, DW_AT_name("SDIOIEN")
    2801                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_SDIOIEN")
    2802                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   82

    2803                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$359       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$21)
    2806                      .dwattr $C$DW$359, DW_AT_name("RSVD22")
    2807                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_RSVD22")
    2808                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    2809                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$360       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$360, DW_AT_name("SDIOIST")
    2813                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_SDIOIST")
    2814                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2815                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$361       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
    2818                      .dwattr $C$DW$361, DW_AT_name("RSVD23")
    2819                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD23")
    2820                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    2821                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$362       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2824                      .dwattr $C$DW$362, DW_AT_name("MMCFIFOCTL")
    2825                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    2826                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2827                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2828                      .dwendtag $C$DW$T$25
    2829              
    2830              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    2831                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
    2832                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2833              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    2834                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$77)
    2835              $C$DW$364       .dwtag  DW_TAG_TI_ioport_type
    2836                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$363)
    2837              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    2838                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$364)
    2839              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    2840                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    2841                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    2842              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    2843                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    2844                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2845              
    2846              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2847                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2848              $C$DW$365       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$365, DW_AT_name("mfgId")
    2851                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_mfgId")
    2852                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2854              $C$DW$366       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    2856                      .dwattr $C$DW$366, DW_AT_name("oemAppId")
    2857                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_oemAppId")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   83

    2858                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2859                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2860              $C$DW$367       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$27)
    2862                      .dwattr $C$DW$367, DW_AT_name("productName")
    2863                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_productName")
    2864                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2865                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2866              $C$DW$368       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$368, DW_AT_name("productRev")
    2869                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_productRev")
    2870                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2871                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2872              $C$DW$369       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$28)
    2874                      .dwattr $C$DW$369, DW_AT_name("serialNumber")
    2875                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_serialNumber")
    2876                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2877                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2878              $C$DW$370       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    2880                      .dwattr $C$DW$370, DW_AT_name("month")
    2881                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_month")
    2882                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2883                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$371       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$371, DW_AT_name("year")
    2887                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_year")
    2888                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2889                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2890              $C$DW$372       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    2892                      .dwattr $C$DW$372, DW_AT_name("checksum")
    2893                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_checksum")
    2894                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2895                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2896                      .dwendtag $C$DW$T$29
    2897              
    2898              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    2899                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    2900                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2901              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2902                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2903                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    2904              
    2905              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2906                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
    2907              $C$DW$373       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    2909                      .dwattr $C$DW$373, DW_AT_name("csdStruct")
    2910                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_csdStruct")
    2911                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2912                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   84

    2913              $C$DW$374       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    2915                      .dwattr $C$DW$374, DW_AT_name("mmcProt")
    2916                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_mmcProt")
    2917                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2918                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2919              $C$DW$375       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    2921                      .dwattr $C$DW$375, DW_AT_name("taac")
    2922                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_taac")
    2923                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2924                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2925              $C$DW$376       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    2927                      .dwattr $C$DW$376, DW_AT_name("nsac")
    2928                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_nsac")
    2929                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2930                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2931              $C$DW$377       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    2933                      .dwattr $C$DW$377, DW_AT_name("tranSpeed")
    2934                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_tranSpeed")
    2935                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2936                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2937              $C$DW$378       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    2939                      .dwattr $C$DW$378, DW_AT_name("ccc")
    2940                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ccc")
    2941                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2942                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2943              $C$DW$379       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    2945                      .dwattr $C$DW$379, DW_AT_name("readBlLen")
    2946                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_readBlLen")
    2947                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2948                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$380       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    2951                      .dwattr $C$DW$380, DW_AT_name("readBlPartial")
    2952                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_readBlPartial")
    2953                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2954                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2955              $C$DW$381       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    2957                      .dwattr $C$DW$381, DW_AT_name("writeBlkMisalign")
    2958                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_writeBlkMisalign")
    2959                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2960                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2961              $C$DW$382       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    2963                      .dwattr $C$DW$382, DW_AT_name("readBlkMisalign")
    2964                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_readBlkMisalign")
    2965                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2966                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$383       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   85

    2968                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$383, DW_AT_name("dsrImp")
    2970                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_dsrImp")
    2971                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2972                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$384       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    2975                      .dwattr $C$DW$384, DW_AT_name("cSize")
    2976                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_cSize")
    2977                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2978                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2979              $C$DW$385       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    2981                      .dwattr $C$DW$385, DW_AT_name("vddRCurrMin")
    2982                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_vddRCurrMin")
    2983                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2984                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2985              $C$DW$386       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    2987                      .dwattr $C$DW$386, DW_AT_name("vddRCurrMax")
    2988                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_vddRCurrMax")
    2989                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2990                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2991              $C$DW$387       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    2993                      .dwattr $C$DW$387, DW_AT_name("vddWCurrMin")
    2994                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_vddWCurrMin")
    2995                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2996                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2997              $C$DW$388       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    2999                      .dwattr $C$DW$388, DW_AT_name("vddWCurrMax")
    3000                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_vddWCurrMax")
    3001                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3002                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3003              $C$DW$389       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    3005                      .dwattr $C$DW$389, DW_AT_name("cSizeMult")
    3006                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_cSizeMult")
    3007                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3008                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3009              $C$DW$390       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    3011                      .dwattr $C$DW$390, DW_AT_name("eraseBlkEnable")
    3012                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_eraseBlkEnable")
    3013                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3014                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$391       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$391, DW_AT_name("eraseGrpSize")
    3018                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_eraseGrpSize")
    3019                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3020                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3021              $C$DW$392       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   86

    3023                      .dwattr $C$DW$392, DW_AT_name("eraseGrpMult")
    3024                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_eraseGrpMult")
    3025                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3026                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3027              $C$DW$393       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    3029                      .dwattr $C$DW$393, DW_AT_name("wpGrpSize")
    3030                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_wpGrpSize")
    3031                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3032                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$394       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$394, DW_AT_name("wpGrpEnable")
    3036                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_wpGrpEnable")
    3037                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3038                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3039              $C$DW$395       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    3041                      .dwattr $C$DW$395, DW_AT_name("defaultEcc")
    3042                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_defaultEcc")
    3043                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3044                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3045              $C$DW$396       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    3047                      .dwattr $C$DW$396, DW_AT_name("r2wFactor")
    3048                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_r2wFactor")
    3049                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3050                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3051              $C$DW$397       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    3053                      .dwattr $C$DW$397, DW_AT_name("writeBlLen")
    3054                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_writeBlLen")
    3055                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3056                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$398       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    3059                      .dwattr $C$DW$398, DW_AT_name("writeBlPartial")
    3060                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_writeBlPartial")
    3061                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3062                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3063              $C$DW$399       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    3065                      .dwattr $C$DW$399, DW_AT_name("contProtApp")
    3066                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_contProtApp")
    3067                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3068                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$400       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    3071                      .dwattr $C$DW$400, DW_AT_name("fileFmtGrp")
    3072                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_fileFmtGrp")
    3073                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3074                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3075              $C$DW$401       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    3077                      .dwattr $C$DW$401, DW_AT_name("copyFlag")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   87

    3078                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_copyFlag")
    3079                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3080                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3081              $C$DW$402       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    3083                      .dwattr $C$DW$402, DW_AT_name("permWriteProtect")
    3084                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_permWriteProtect")
    3085                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3086                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$403       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    3089                      .dwattr $C$DW$403, DW_AT_name("tmpWriteProtect")
    3090                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_tmpWriteProtect")
    3091                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3092                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$404       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    3095                      .dwattr $C$DW$404, DW_AT_name("fileFmt")
    3096                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_fileFmt")
    3097                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3098                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$405       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$405, DW_AT_name("ecc")
    3102                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ecc")
    3103                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3104                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$406       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    3107                      .dwattr $C$DW$406, DW_AT_name("crc")
    3108                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_crc")
    3109                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3110                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3111                      .dwendtag $C$DW$T$30
    3112              
    3113              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    3114                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    3115                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3116              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3117                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3118                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    3119              
    3120              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3121                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    3122              $C$DW$407       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    3124                      .dwattr $C$DW$407, DW_AT_name("securitySysId")
    3125                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_securitySysId")
    3126                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3128              $C$DW$408       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    3130                      .dwattr $C$DW$408, DW_AT_name("securitySysVers")
    3131                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_securitySysVers")
    3132                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   88

    3133                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$409       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    3136                      .dwattr $C$DW$409, DW_AT_name("maxLicenses")
    3137                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_maxLicenses")
    3138                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3139                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3140              $C$DW$410       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$28)
    3142                      .dwattr $C$DW$410, DW_AT_name("xStatus")
    3143                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_xStatus")
    3144                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3145                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3146                      .dwendtag $C$DW$T$31
    3147              
    3148              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    3149                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    3150                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3151              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3152                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3153                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    3154              
    3155              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3156                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    3157              $C$DW$411       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    3159                      .dwattr $C$DW$411, DW_AT_name("rca")
    3160                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rca")
    3161                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3162                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3163              $C$DW$412       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    3165                      .dwattr $C$DW$412, DW_AT_name("ST0")
    3166                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_ST0")
    3167                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3168                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3169              $C$DW$413       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    3171                      .dwattr $C$DW$413, DW_AT_name("ST1")
    3172                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ST1")
    3173                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3174                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3175              $C$DW$414       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    3177                      .dwattr $C$DW$414, DW_AT_name("cardIndex")
    3178                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_cardIndex")
    3179                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3180                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3181              $C$DW$415       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$28)
    3183                      .dwattr $C$DW$415, DW_AT_name("maxXfrRate")
    3184                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_maxXfrRate")
    3185                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3186                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3187              $C$DW$416       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   89

    3188                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
    3189                      .dwattr $C$DW$416, DW_AT_name("readAccessTime")
    3190                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_readAccessTime")
    3191                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3192                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$417       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$28)
    3195                      .dwattr $C$DW$417, DW_AT_name("cardCapacity")
    3196                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_cardCapacity")
    3197                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3198                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$418       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$28)
    3201                      .dwattr $C$DW$418, DW_AT_name("blockLength")
    3202                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_blockLength")
    3203                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3204                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3205              $C$DW$419       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$28)
    3207                      .dwattr $C$DW$419, DW_AT_name("totalSectors")
    3208                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_totalSectors")
    3209                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3210                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$420       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$28)
    3213                      .dwattr $C$DW$420, DW_AT_name("lastAddrRead")
    3214                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_lastAddrRead")
    3215                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3216                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$421       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$28)
    3219                      .dwattr $C$DW$421, DW_AT_name("lastAddrWritten")
    3220                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_lastAddrWritten")
    3221                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3222                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3223              $C$DW$422       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$33)
    3225                      .dwattr $C$DW$422, DW_AT_name("cardType")
    3226                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_cardType")
    3227                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3228                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3229              $C$DW$423       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$35)
    3231                      .dwattr $C$DW$423, DW_AT_name("cid")
    3232                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_cid")
    3233                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3234                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3235              $C$DW$424       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$37)
    3237                      .dwattr $C$DW$424, DW_AT_name("csd")
    3238                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_csd")
    3239                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3240                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3241              $C$DW$425       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$39)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   90

    3243                      .dwattr $C$DW$425, DW_AT_name("xcsd")
    3244                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_xcsd")
    3245                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3246                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3247              $C$DW$426       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$40)
    3249                      .dwattr $C$DW$426, DW_AT_name("sdHcDetected")
    3250                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_sdHcDetected")
    3251                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3252                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$427       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$40)
    3255                      .dwattr $C$DW$427, DW_AT_name("cardAtaFsOpen")
    3256                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    3257                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3258                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$428       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    3261                      .dwattr $C$DW$428, DW_AT_name("cardMscStatus")
    3262                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_cardMscStatus")
    3263                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3264                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3265                      .dwendtag $C$DW$T$41
    3266              
    3267              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    3268                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    3269                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3270              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3271                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3272                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    3273              
    3274              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3275                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    3276              $C$DW$429       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$45)
    3278                      .dwattr $C$DW$429, DW_AT_name("isr")
    3279                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_isr")
    3280                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3282                      .dwendtag $C$DW$T$46
    3283              
    3284              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    3285                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    3286                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3287              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3288                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3289                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    3290              
    3291              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3292                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
    3293              $C$DW$430       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3295                      .dwattr $C$DW$430, DW_AT_name("DMACH0SSAL")
    3296                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DMACH0SSAL")
    3297                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   91

    3298                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$431       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3301                      .dwattr $C$DW$431, DW_AT_name("DMACH0SSAU")
    3302                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH0SSAU")
    3303                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3304                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$432       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3307                      .dwattr $C$DW$432, DW_AT_name("DMACH0DSAL")
    3308                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH0DSAL")
    3309                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3310                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$433       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3313                      .dwattr $C$DW$433, DW_AT_name("DMACH0DSAU")
    3314                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH0DSAU")
    3315                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3316                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$434       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3319                      .dwattr $C$DW$434, DW_AT_name("DMACH0TCR1")
    3320                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_DMACH0TCR1")
    3321                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3322                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$435       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    3325                      .dwattr $C$DW$435, DW_AT_name("DMACH0TCR2")
    3326                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH0TCR2")
    3327                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3328                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3329              $C$DW$436       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$47)
    3331                      .dwattr $C$DW$436, DW_AT_name("RSVD0")
    3332                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_RSVD0")
    3333                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3334                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$437       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3337                      .dwattr $C$DW$437, DW_AT_name("DMACH1SSAL")
    3338                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DMACH1SSAL")
    3339                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3340                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$438       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3343                      .dwattr $C$DW$438, DW_AT_name("DMACH1SSAU")
    3344                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH1SSAU")
    3345                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3346                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$439       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    3349                      .dwattr $C$DW$439, DW_AT_name("DMACH1DSAL")
    3350                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH1DSAL")
    3351                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3352                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   92

    3353              $C$DW$440       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    3355                      .dwattr $C$DW$440, DW_AT_name("DMACH1DSAU")
    3356                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH1DSAU")
    3357                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3358                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$441       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    3361                      .dwattr $C$DW$441, DW_AT_name("DMACH1TCR1")
    3362                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMACH1TCR1")
    3363                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3364                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$442       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    3367                      .dwattr $C$DW$442, DW_AT_name("DMACH1TCR2")
    3368                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_DMACH1TCR2")
    3369                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3370                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$443       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$47)
    3373                      .dwattr $C$DW$443, DW_AT_name("RSVD1")
    3374                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_RSVD1")
    3375                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3376                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$444       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    3379                      .dwattr $C$DW$444, DW_AT_name("DMACH2SSAL")
    3380                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_DMACH2SSAL")
    3381                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3382                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$445       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    3385                      .dwattr $C$DW$445, DW_AT_name("DMACH2SSAU")
    3386                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_DMACH2SSAU")
    3387                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3388                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$446       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    3391                      .dwattr $C$DW$446, DW_AT_name("DMACH2DSAL")
    3392                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_DMACH2DSAL")
    3393                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3394                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$447       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    3397                      .dwattr $C$DW$447, DW_AT_name("DMACH2DSAU")
    3398                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_DMACH2DSAU")
    3399                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3400                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$448       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    3403                      .dwattr $C$DW$448, DW_AT_name("DMACH2TCR1")
    3404                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_DMACH2TCR1")
    3405                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3406                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3407              $C$DW$449       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   93

    3408                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    3409                      .dwattr $C$DW$449, DW_AT_name("DMACH2TCR2")
    3410                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_DMACH2TCR2")
    3411                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3412                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3413              $C$DW$450       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$47)
    3415                      .dwattr $C$DW$450, DW_AT_name("RSVD2")
    3416                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD2")
    3417                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3418                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$451       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    3421                      .dwattr $C$DW$451, DW_AT_name("DMACH3SSAL")
    3422                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_DMACH3SSAL")
    3423                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3424                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$452       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    3427                      .dwattr $C$DW$452, DW_AT_name("DMACH3SSAU")
    3428                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_DMACH3SSAU")
    3429                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3430                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$453       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    3433                      .dwattr $C$DW$453, DW_AT_name("DMACH3DSAL")
    3434                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_DMACH3DSAL")
    3435                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3436                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$454       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    3439                      .dwattr $C$DW$454, DW_AT_name("DMACH3DSAU")
    3440                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_DMACH3DSAU")
    3441                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3442                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$455       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    3445                      .dwattr $C$DW$455, DW_AT_name("DMACH3TCR1")
    3446                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_DMACH3TCR1")
    3447                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3448                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3449              $C$DW$456       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    3451                      .dwattr $C$DW$456, DW_AT_name("DMACH3TCR2")
    3452                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_DMACH3TCR2")
    3453                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3454                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3455                      .dwendtag $C$DW$T$48
    3456              
    3457              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    3458                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3459                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3460              $C$DW$457       .dwtag  DW_TAG_TI_far_type
    3461                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$49)
    3462              $C$DW$458       .dwtag  DW_TAG_TI_ioport_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   94

    3463                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$457)
    3464              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    3465                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$458)
    3466              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3467                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3468                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    3469              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    3470                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3471                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3472              
    3473              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3474                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
    3475              $C$DW$459       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$52)
    3477                      .dwattr $C$DW$459, DW_AT_name("dmaRegs")
    3478                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_dmaRegs")
    3479                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3480                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3481              $C$DW$460       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3483                      .dwattr $C$DW$460, DW_AT_name("chanNum")
    3484                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_chanNum")
    3485                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3486                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3487              $C$DW$461       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$56)
    3489                      .dwattr $C$DW$461, DW_AT_name("dmaInstNum")
    3490                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_dmaInstNum")
    3491                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3492                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$462       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$40)
    3495                      .dwattr $C$DW$462, DW_AT_name("isChanFree")
    3496                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_isChanFree")
    3497                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3498                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$463       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$58)
    3501                      .dwattr $C$DW$463, DW_AT_name("chanDir")
    3502                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_chanDir")
    3503                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3504                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3505              $C$DW$464       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$60)
    3507                      .dwattr $C$DW$464, DW_AT_name("trigger")
    3508                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_trigger")
    3509                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3510                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$465       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$62)
    3513                      .dwattr $C$DW$465, DW_AT_name("trfType")
    3514                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_trfType")
    3515                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3516                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3517              $C$DW$466       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   95

    3518                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$64)
    3519                      .dwattr $C$DW$466, DW_AT_name("dmaInt")
    3520                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_dmaInt")
    3521                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3522                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3523              $C$DW$467       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$40)
    3525                      .dwattr $C$DW$467, DW_AT_name("pingPongEnabled")
    3526                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_pingPongEnabled")
    3527                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3528                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3529                      .dwendtag $C$DW$T$65
    3530              
    3531              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    3532                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
    3533                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3534              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3535                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3536                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    3537              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    3538                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3539                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3540              
    3541              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3542                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    3543              $C$DW$468       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$67)
    3545                      .dwattr $C$DW$468, DW_AT_name("pingPongMode")
    3546                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_pingPongMode")
    3547                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3548                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3549              $C$DW$469       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$69)
    3551                      .dwattr $C$DW$469, DW_AT_name("autoMode")
    3552                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_autoMode")
    3553                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3554                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3555              $C$DW$470       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$71)
    3557                      .dwattr $C$DW$470, DW_AT_name("burstLen")
    3558                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_burstLen")
    3559                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3560                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$471       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$60)
    3563                      .dwattr $C$DW$471, DW_AT_name("trigger")
    3564                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_trigger")
    3565                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3566                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$472       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$73)
    3569                      .dwattr $C$DW$472, DW_AT_name("dmaEvt")
    3570                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_dmaEvt")
    3571                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3572                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_MmcCardExample.asm                                         PAGE   96

    3573              $C$DW$473       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$64)
    3575                      .dwattr $C$DW$473, DW_AT_name("dmaInt")
    3576                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_dmaInt")
    3577                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3578                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$474       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$58)
    3581                      .dwattr $C$DW$474, DW_AT_name("chanDir")
    3582                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_chanDir")
    3583                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3584                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$475       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$62)
    3587                      .dwattr $C$DW$475, DW_AT_name("trfType")
    3588                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_trfType")
    3589                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3590                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$476       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    3593                      .dwattr $C$DW$476, DW_AT_name("dataLen")
    3594                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_dataLen")
    3595                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3596                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$477       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$28)
    3599                      .dwattr $C$DW$477, DW_AT_name("srcAddr")
    3600                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_srcAddr")
    3601                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3602                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$478       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$28)
    3605                      .dwattr $C$DW$478, DW_AT_name("destAddr")
    3606                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_destAddr")
    3607                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3608                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3609                      .dwendtag $C$DW$T$74
    3610              
    3611              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    3612                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    3613                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3614              
    3615              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3616                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    3617              $C$DW$479       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    3619                      .dwattr $C$DW$479, DW_AT_name("slice127_112")
    3620                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_slice127_112")
    3621                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3622                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3623              $C$DW$480       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    3625                      .dwattr $C$DW$480, DW_AT_name("slice111_96")
    3626                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_slice111_96")
    3627                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
