TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE    1

    4862              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:57 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2593              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    2594              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    2595              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    2596              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    2597              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    2598              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    2599              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    2600              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    2601              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    2602              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    2603              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   75

    2604              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    2605              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    2606              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    2607              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    2608              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    2609              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    2610              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    2611              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    2612              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    2613                      .dwendtag $C$DW$T$72
    2614              
    2615              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    2616                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2617                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2618              
    2619              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    2620                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    2621              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    2622              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    2623              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    2624              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    2625                      .dwendtag $C$DW$T$85
    2626              
    2627              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    2628                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2629                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2630              
    2631              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    2632                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    2633              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    2634              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    2635                      .dwendtag $C$DW$T$96
    2636              
    2637              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    2638                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2639                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2640              
    2641              $C$DW$T$102     .dwtag  DW_TAG_enumeration_type
    2642                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
    2643              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
    2644              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
    2645              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
    2646                      .dwendtag $C$DW$T$102
    2647              
    2648              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
    2649                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    2650                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2651              
    2652              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2653                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    2654              $C$DW$290       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2656                      .dwattr $C$DW$290, DW_AT_name("MMCCTL")
    2657                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_MMCCTL")
    2658                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   76

    2659                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$291       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    2662                      .dwattr $C$DW$291, DW_AT_name("RSVD0")
    2663                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD0")
    2664                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2665                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$292       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$292, DW_AT_name("MMCCLK")
    2669                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_MMCCLK")
    2670                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2671                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$293       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    2674                      .dwattr $C$DW$293, DW_AT_name("RSVD1")
    2675                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD1")
    2676                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2677                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$294       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2680                      .dwattr $C$DW$294, DW_AT_name("MMCST0")
    2681                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_MMCST0")
    2682                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2683                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$295       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    2686                      .dwattr $C$DW$295, DW_AT_name("RSVD2")
    2687                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD2")
    2688                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2689                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$296       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2692                      .dwattr $C$DW$296, DW_AT_name("MMCST1")
    2693                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_MMCST1")
    2694                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2695                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$297       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    2698                      .dwattr $C$DW$297, DW_AT_name("RSVD3")
    2699                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD3")
    2700                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2701                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$298       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$298, DW_AT_name("MMCIM")
    2705                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_MMCIM")
    2706                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2707                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$299       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    2710                      .dwattr $C$DW$299, DW_AT_name("RSVD4")
    2711                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD4")
    2712                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2713                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   77

    2714              $C$DW$300       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$300, DW_AT_name("MMCTOR")
    2717                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_MMCTOR")
    2718                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2719                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$301       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    2722                      .dwattr $C$DW$301, DW_AT_name("RSVD5")
    2723                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD5")
    2724                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2725                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$302       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    2728                      .dwattr $C$DW$302, DW_AT_name("MMCTOD")
    2729                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_MMCTOD")
    2730                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2731                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$303       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    2734                      .dwattr $C$DW$303, DW_AT_name("RSVD6")
    2735                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_RSVD6")
    2736                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2737                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$304       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2740                      .dwattr $C$DW$304, DW_AT_name("MMCBLEN")
    2741                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_MMCBLEN")
    2742                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2743                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$305       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    2746                      .dwattr $C$DW$305, DW_AT_name("RSVD7")
    2747                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD7")
    2748                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2749                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$306       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$306, DW_AT_name("MMCNBLK")
    2753                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_MMCNBLK")
    2754                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2755                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$307       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    2758                      .dwattr $C$DW$307, DW_AT_name("RSVD8")
    2759                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD8")
    2760                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2761                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$308       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$308, DW_AT_name("MMCNBLC")
    2765                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_MMCNBLC")
    2766                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2767                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$309       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   78

    2769                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    2770                      .dwattr $C$DW$309, DW_AT_name("RSVD9")
    2771                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD9")
    2772                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2773                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$310       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$310, DW_AT_name("MMCDRR1")
    2777                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_MMCDRR1")
    2778                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2779                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$311       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2782                      .dwattr $C$DW$311, DW_AT_name("MMCDRR2")
    2783                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_MMCDRR2")
    2784                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2785                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$312       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    2788                      .dwattr $C$DW$312, DW_AT_name("RSVD10")
    2789                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD10")
    2790                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2791                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$313       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    2794                      .dwattr $C$DW$313, DW_AT_name("MMCDXR1")
    2795                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_MMCDXR1")
    2796                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2797                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$314       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$314, DW_AT_name("MMCDXR2")
    2801                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_MMCDXR2")
    2802                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2803                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$315       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
    2806                      .dwattr $C$DW$315, DW_AT_name("RSVD11")
    2807                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD11")
    2808                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2809                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$316       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$316, DW_AT_name("MMCCMD1")
    2813                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_MMCCMD1")
    2814                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2815                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$317       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    2818                      .dwattr $C$DW$317, DW_AT_name("MMCCMD2")
    2819                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_MMCCMD2")
    2820                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2821                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$318       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   79

    2824                      .dwattr $C$DW$318, DW_AT_name("RSVD12")
    2825                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_RSVD12")
    2826                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2827                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2828              $C$DW$319       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    2830                      .dwattr $C$DW$319, DW_AT_name("MMCARG1")
    2831                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_MMCARG1")
    2832                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2833                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$320       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    2836                      .dwattr $C$DW$320, DW_AT_name("MMCARG2")
    2837                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_MMCARG2")
    2838                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2839                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$321       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    2842                      .dwattr $C$DW$321, DW_AT_name("RSVD13")
    2843                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_RSVD13")
    2844                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2845                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$322       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    2848                      .dwattr $C$DW$322, DW_AT_name("MMCRSP0")
    2849                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_MMCRSP0")
    2850                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2851                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2852              $C$DW$323       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    2854                      .dwattr $C$DW$323, DW_AT_name("MMCRSP1")
    2855                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_MMCRSP1")
    2856                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2857                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$324       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    2860                      .dwattr $C$DW$324, DW_AT_name("RSVD14")
    2861                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_RSVD14")
    2862                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2863                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$325       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    2866                      .dwattr $C$DW$325, DW_AT_name("MMCRSP2")
    2867                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_MMCRSP2")
    2868                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2869                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$326       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    2872                      .dwattr $C$DW$326, DW_AT_name("MMCRSP3")
    2873                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_MMCRSP3")
    2874                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    2875                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$327       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    2878                      .dwattr $C$DW$327, DW_AT_name("RSVD15")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   80

    2879                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_RSVD15")
    2880                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2881                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$328       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    2884                      .dwattr $C$DW$328, DW_AT_name("MMCRSP4")
    2885                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_MMCRSP4")
    2886                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2887                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$329       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    2890                      .dwattr $C$DW$329, DW_AT_name("MMCRSP5")
    2891                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_MMCRSP5")
    2892                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2893                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$330       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$22)
    2896                      .dwattr $C$DW$330, DW_AT_name("RSVD16")
    2897                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_RSVD16")
    2898                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2899                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$331       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    2902                      .dwattr $C$DW$331, DW_AT_name("MMCRSP6")
    2903                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_MMCRSP6")
    2904                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2905                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$332       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    2908                      .dwattr $C$DW$332, DW_AT_name("MMCRSP7")
    2909                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_MMCRSP7")
    2910                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2911                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$333       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$22)
    2914                      .dwattr $C$DW$333, DW_AT_name("RSVD17")
    2915                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD17")
    2916                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2917                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$334       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
    2920                      .dwattr $C$DW$334, DW_AT_name("MMCDRSP")
    2921                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_MMCDRSP")
    2922                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2923                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$335       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    2926                      .dwattr $C$DW$335, DW_AT_name("RSVD18")
    2927                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD18")
    2928                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2929                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2930              $C$DW$336       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    2932                      .dwattr $C$DW$336, DW_AT_name("MMCCIDX")
    2933                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_MMCCIDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   81

    2934                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2935                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$337       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$24)
    2938                      .dwattr $C$DW$337, DW_AT_name("RSVD19")
    2939                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD19")
    2940                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    2941                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$338       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    2944                      .dwattr $C$DW$338, DW_AT_name("SDIOCTL")
    2945                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_SDIOCTL")
    2946                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2947                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$339       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$21)
    2950                      .dwattr $C$DW$339, DW_AT_name("RSVD20")
    2951                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_RSVD20")
    2952                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2953                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$340       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
    2956                      .dwattr $C$DW$340, DW_AT_name("SDIOST0")
    2957                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_SDIOST0")
    2958                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2959                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$341       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$21)
    2962                      .dwattr $C$DW$341, DW_AT_name("RSVD21")
    2963                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_RSVD21")
    2964                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    2965                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$342       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    2968                      .dwattr $C$DW$342, DW_AT_name("SDIOIEN")
    2969                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_SDIOIEN")
    2970                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2971                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$343       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$21)
    2974                      .dwattr $C$DW$343, DW_AT_name("RSVD22")
    2975                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD22")
    2976                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    2977                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$344       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    2980                      .dwattr $C$DW$344, DW_AT_name("SDIOIST")
    2981                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_SDIOIST")
    2982                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2983                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$345       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$21)
    2986                      .dwattr $C$DW$345, DW_AT_name("RSVD23")
    2987                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_RSVD23")
    2988                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   82

    2989                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2990              $C$DW$346       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    2992                      .dwattr $C$DW$346, DW_AT_name("MMCFIFOCTL")
    2993                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    2994                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2995                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2996                      .dwendtag $C$DW$T$25
    2997              
    2998              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    2999                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
    3000                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3001              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3002                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$77)
    3003              $C$DW$348       .dwtag  DW_TAG_TI_ioport_type
    3004                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$347)
    3005              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    3006                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$348)
    3007              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    3008                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3009                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    3010              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    3011                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    3012                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3013              
    3014              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3015                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    3016              $C$DW$349       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    3018                      .dwattr $C$DW$349, DW_AT_name("mfgId")
    3019                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_mfgId")
    3020                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3021                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$350       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    3024                      .dwattr $C$DW$350, DW_AT_name("oemAppId")
    3025                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_oemAppId")
    3026                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3027                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$351       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$27)
    3030                      .dwattr $C$DW$351, DW_AT_name("productName")
    3031                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_productName")
    3032                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3033                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$352       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    3036                      .dwattr $C$DW$352, DW_AT_name("productRev")
    3037                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_productRev")
    3038                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3039                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$353       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$28)
    3042                      .dwattr $C$DW$353, DW_AT_name("serialNumber")
    3043                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_serialNumber")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   83

    3044                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3045                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$354       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    3048                      .dwattr $C$DW$354, DW_AT_name("month")
    3049                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_month")
    3050                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3051                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$355       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    3054                      .dwattr $C$DW$355, DW_AT_name("year")
    3055                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_year")
    3056                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3057                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$356       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    3060                      .dwattr $C$DW$356, DW_AT_name("checksum")
    3061                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_checksum")
    3062                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3063                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3064                      .dwendtag $C$DW$T$29
    3065              
    3066              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    3067                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    3068                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3069              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    3070                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3071                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    3072              
    3073              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3074                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
    3075              $C$DW$357       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    3077                      .dwattr $C$DW$357, DW_AT_name("csdStruct")
    3078                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_csdStruct")
    3079                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3080                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3081              $C$DW$358       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    3083                      .dwattr $C$DW$358, DW_AT_name("mmcProt")
    3084                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_mmcProt")
    3085                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3086                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$359       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    3089                      .dwattr $C$DW$359, DW_AT_name("taac")
    3090                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_taac")
    3091                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3092                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$360       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    3095                      .dwattr $C$DW$360, DW_AT_name("nsac")
    3096                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_nsac")
    3097                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3098                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   84

    3099              $C$DW$361       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$361, DW_AT_name("tranSpeed")
    3102                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_tranSpeed")
    3103                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3104                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$362       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    3107                      .dwattr $C$DW$362, DW_AT_name("ccc")
    3108                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ccc")
    3109                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3110                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3111              $C$DW$363       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    3113                      .dwattr $C$DW$363, DW_AT_name("readBlLen")
    3114                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_readBlLen")
    3115                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3116                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3117              $C$DW$364       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    3119                      .dwattr $C$DW$364, DW_AT_name("readBlPartial")
    3120                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_readBlPartial")
    3121                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3122                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$365       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    3125                      .dwattr $C$DW$365, DW_AT_name("writeBlkMisalign")
    3126                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_writeBlkMisalign")
    3127                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3128                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$366       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    3131                      .dwattr $C$DW$366, DW_AT_name("readBlkMisalign")
    3132                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_readBlkMisalign")
    3133                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3134                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$367       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    3137                      .dwattr $C$DW$367, DW_AT_name("dsrImp")
    3138                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_dsrImp")
    3139                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3140                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$368       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    3143                      .dwattr $C$DW$368, DW_AT_name("cSize")
    3144                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_cSize")
    3145                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3146                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$369       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    3149                      .dwattr $C$DW$369, DW_AT_name("vddRCurrMin")
    3150                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_vddRCurrMin")
    3151                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3152                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$370       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   85

    3154                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    3155                      .dwattr $C$DW$370, DW_AT_name("vddRCurrMax")
    3156                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_vddRCurrMax")
    3157                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3158                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$371       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    3161                      .dwattr $C$DW$371, DW_AT_name("vddWCurrMin")
    3162                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_vddWCurrMin")
    3163                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3164                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$372       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    3167                      .dwattr $C$DW$372, DW_AT_name("vddWCurrMax")
    3168                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_vddWCurrMax")
    3169                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3170                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$373       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    3173                      .dwattr $C$DW$373, DW_AT_name("cSizeMult")
    3174                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_cSizeMult")
    3175                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3176                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$374       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    3179                      .dwattr $C$DW$374, DW_AT_name("eraseBlkEnable")
    3180                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_eraseBlkEnable")
    3181                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3182                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$375       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    3185                      .dwattr $C$DW$375, DW_AT_name("eraseGrpSize")
    3186                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_eraseGrpSize")
    3187                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3188                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$376       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    3191                      .dwattr $C$DW$376, DW_AT_name("eraseGrpMult")
    3192                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_eraseGrpMult")
    3193                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3194                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$377       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    3197                      .dwattr $C$DW$377, DW_AT_name("wpGrpSize")
    3198                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_wpGrpSize")
    3199                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3200                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$378       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    3203                      .dwattr $C$DW$378, DW_AT_name("wpGrpEnable")
    3204                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_wpGrpEnable")
    3205                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3206                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$379       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   86

    3209                      .dwattr $C$DW$379, DW_AT_name("defaultEcc")
    3210                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_defaultEcc")
    3211                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3212                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$380       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    3215                      .dwattr $C$DW$380, DW_AT_name("r2wFactor")
    3216                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_r2wFactor")
    3217                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3218                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$381       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    3221                      .dwattr $C$DW$381, DW_AT_name("writeBlLen")
    3222                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_writeBlLen")
    3223                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3224                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$382       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    3227                      .dwattr $C$DW$382, DW_AT_name("writeBlPartial")
    3228                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_writeBlPartial")
    3229                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3230                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$383       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    3233                      .dwattr $C$DW$383, DW_AT_name("contProtApp")
    3234                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_contProtApp")
    3235                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3236                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$384       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    3239                      .dwattr $C$DW$384, DW_AT_name("fileFmtGrp")
    3240                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_fileFmtGrp")
    3241                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3242                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$385       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    3245                      .dwattr $C$DW$385, DW_AT_name("copyFlag")
    3246                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_copyFlag")
    3247                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3248                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$386       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    3251                      .dwattr $C$DW$386, DW_AT_name("permWriteProtect")
    3252                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_permWriteProtect")
    3253                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3254                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$387       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    3257                      .dwattr $C$DW$387, DW_AT_name("tmpWriteProtect")
    3258                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_tmpWriteProtect")
    3259                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3260                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3261              $C$DW$388       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    3263                      .dwattr $C$DW$388, DW_AT_name("fileFmt")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   87

    3264                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_fileFmt")
    3265                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3266                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$389       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    3269                      .dwattr $C$DW$389, DW_AT_name("ecc")
    3270                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_ecc")
    3271                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3272                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$390       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    3275                      .dwattr $C$DW$390, DW_AT_name("crc")
    3276                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_crc")
    3277                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3278                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3279                      .dwendtag $C$DW$T$30
    3280              
    3281              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    3282                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    3283                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3284              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3285                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3286                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    3287              
    3288              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3289                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    3290              $C$DW$391       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    3292                      .dwattr $C$DW$391, DW_AT_name("securitySysId")
    3293                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_securitySysId")
    3294                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3296              $C$DW$392       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    3298                      .dwattr $C$DW$392, DW_AT_name("securitySysVers")
    3299                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_securitySysVers")
    3300                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3301                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3302              $C$DW$393       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    3304                      .dwattr $C$DW$393, DW_AT_name("maxLicenses")
    3305                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_maxLicenses")
    3306                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3307                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3308              $C$DW$394       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$28)
    3310                      .dwattr $C$DW$394, DW_AT_name("xStatus")
    3311                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_xStatus")
    3312                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3313                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3314                      .dwendtag $C$DW$T$31
    3315              
    3316              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    3317                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    3318                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   88

    3319              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3320                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3321                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    3322              
    3323              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3324                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    3325              $C$DW$395       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    3327                      .dwattr $C$DW$395, DW_AT_name("rca")
    3328                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rca")
    3329                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3331              $C$DW$396       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    3333                      .dwattr $C$DW$396, DW_AT_name("ST0")
    3334                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_ST0")
    3335                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3336                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3337              $C$DW$397       .dwtag  DW_TAG_member
    3338                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    3339                      .dwattr $C$DW$397, DW_AT_name("ST1")
    3340                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_ST1")
    3341                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3342                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3343              $C$DW$398       .dwtag  DW_TAG_member
    3344                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    3345                      .dwattr $C$DW$398, DW_AT_name("cardIndex")
    3346                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_cardIndex")
    3347                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3348                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3349              $C$DW$399       .dwtag  DW_TAG_member
    3350                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$28)
    3351                      .dwattr $C$DW$399, DW_AT_name("maxXfrRate")
    3352                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_maxXfrRate")
    3353                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3354                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3355              $C$DW$400       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$28)
    3357                      .dwattr $C$DW$400, DW_AT_name("readAccessTime")
    3358                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_readAccessTime")
    3359                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3360                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3361              $C$DW$401       .dwtag  DW_TAG_member
    3362                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$28)
    3363                      .dwattr $C$DW$401, DW_AT_name("cardCapacity")
    3364                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_cardCapacity")
    3365                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3366                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3367              $C$DW$402       .dwtag  DW_TAG_member
    3368                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$28)
    3369                      .dwattr $C$DW$402, DW_AT_name("blockLength")
    3370                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_blockLength")
    3371                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3372                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3373              $C$DW$403       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   89

    3374                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    3375                      .dwattr $C$DW$403, DW_AT_name("totalSectors")
    3376                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_totalSectors")
    3377                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3378                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3379              $C$DW$404       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    3381                      .dwattr $C$DW$404, DW_AT_name("lastAddrRead")
    3382                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_lastAddrRead")
    3383                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3384                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3385              $C$DW$405       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$28)
    3387                      .dwattr $C$DW$405, DW_AT_name("lastAddrWritten")
    3388                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_lastAddrWritten")
    3389                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3390                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3391              $C$DW$406       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$33)
    3393                      .dwattr $C$DW$406, DW_AT_name("cardType")
    3394                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_cardType")
    3395                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3396                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3397              $C$DW$407       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$35)
    3399                      .dwattr $C$DW$407, DW_AT_name("cid")
    3400                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_cid")
    3401                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3402                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3403              $C$DW$408       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$37)
    3405                      .dwattr $C$DW$408, DW_AT_name("csd")
    3406                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_csd")
    3407                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3408                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3409              $C$DW$409       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$39)
    3411                      .dwattr $C$DW$409, DW_AT_name("xcsd")
    3412                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_xcsd")
    3413                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3414                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$410       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$40)
    3417                      .dwattr $C$DW$410, DW_AT_name("sdHcDetected")
    3418                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_sdHcDetected")
    3419                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3420                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3421              $C$DW$411       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$40)
    3423                      .dwattr $C$DW$411, DW_AT_name("cardAtaFsOpen")
    3424                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    3425                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3426                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3427              $C$DW$412       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   90

    3429                      .dwattr $C$DW$412, DW_AT_name("cardMscStatus")
    3430                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_cardMscStatus")
    3431                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3432                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3433                      .dwendtag $C$DW$T$41
    3434              
    3435              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    3436                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    3437                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3438              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3439                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3440                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    3441              
    3442              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3443                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    3444              $C$DW$413       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$45)
    3446                      .dwattr $C$DW$413, DW_AT_name("isr")
    3447                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_isr")
    3448                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3449                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3450                      .dwendtag $C$DW$T$46
    3451              
    3452              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    3453                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    3454                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3455              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3456                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3457                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    3458              
    3459              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3460                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
    3461              $C$DW$414       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3463                      .dwattr $C$DW$414, DW_AT_name("DMACH0SSAL")
    3464                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_DMACH0SSAL")
    3465                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3467              $C$DW$415       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3469                      .dwattr $C$DW$415, DW_AT_name("DMACH0SSAU")
    3470                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_DMACH0SSAU")
    3471                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3472                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$416       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3475                      .dwattr $C$DW$416, DW_AT_name("DMACH0DSAL")
    3476                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_DMACH0DSAL")
    3477                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3478                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$417       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3481                      .dwattr $C$DW$417, DW_AT_name("DMACH0DSAU")
    3482                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_DMACH0DSAU")
    3483                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   91

    3484                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3485              $C$DW$418       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3487                      .dwattr $C$DW$418, DW_AT_name("DMACH0TCR1")
    3488                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_DMACH0TCR1")
    3489                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3490                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3491              $C$DW$419       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3493                      .dwattr $C$DW$419, DW_AT_name("DMACH0TCR2")
    3494                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_DMACH0TCR2")
    3495                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3496                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$420       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$47)
    3499                      .dwattr $C$DW$420, DW_AT_name("RSVD0")
    3500                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_RSVD0")
    3501                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3502                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$421       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3505                      .dwattr $C$DW$421, DW_AT_name("DMACH1SSAL")
    3506                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_DMACH1SSAL")
    3507                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3508                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$422       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3511                      .dwattr $C$DW$422, DW_AT_name("DMACH1SSAU")
    3512                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_DMACH1SSAU")
    3513                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3514                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3515              $C$DW$423       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3517                      .dwattr $C$DW$423, DW_AT_name("DMACH1DSAL")
    3518                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_DMACH1DSAL")
    3519                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3520                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3521              $C$DW$424       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3523                      .dwattr $C$DW$424, DW_AT_name("DMACH1DSAU")
    3524                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMACH1DSAU")
    3525                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3526                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3527              $C$DW$425       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3529                      .dwattr $C$DW$425, DW_AT_name("DMACH1TCR1")
    3530                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMACH1TCR1")
    3531                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3532                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$426       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3535                      .dwattr $C$DW$426, DW_AT_name("DMACH1TCR2")
    3536                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_DMACH1TCR2")
    3537                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3538                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   92

    3539              $C$DW$427       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$47)
    3541                      .dwattr $C$DW$427, DW_AT_name("RSVD1")
    3542                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD1")
    3543                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3544                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$428       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3547                      .dwattr $C$DW$428, DW_AT_name("DMACH2SSAL")
    3548                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_DMACH2SSAL")
    3549                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3550                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$429       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3553                      .dwattr $C$DW$429, DW_AT_name("DMACH2SSAU")
    3554                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_DMACH2SSAU")
    3555                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3556                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$430       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3559                      .dwattr $C$DW$430, DW_AT_name("DMACH2DSAL")
    3560                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DMACH2DSAL")
    3561                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3562                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$431       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3565                      .dwattr $C$DW$431, DW_AT_name("DMACH2DSAU")
    3566                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH2DSAU")
    3567                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3568                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3569              $C$DW$432       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3571                      .dwattr $C$DW$432, DW_AT_name("DMACH2TCR1")
    3572                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH2TCR1")
    3573                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3574                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$433       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3577                      .dwattr $C$DW$433, DW_AT_name("DMACH2TCR2")
    3578                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH2TCR2")
    3579                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3580                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$434       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$47)
    3583                      .dwattr $C$DW$434, DW_AT_name("RSVD2")
    3584                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD2")
    3585                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3586                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$435       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    3589                      .dwattr $C$DW$435, DW_AT_name("DMACH3SSAL")
    3590                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH3SSAL")
    3591                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3592                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3593              $C$DW$436       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   93

    3594                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    3595                      .dwattr $C$DW$436, DW_AT_name("DMACH3SSAU")
    3596                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMACH3SSAU")
    3597                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3598                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3599              $C$DW$437       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3601                      .dwattr $C$DW$437, DW_AT_name("DMACH3DSAL")
    3602                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DMACH3DSAL")
    3603                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3604                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3605              $C$DW$438       .dwtag  DW_TAG_member
    3606                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3607                      .dwattr $C$DW$438, DW_AT_name("DMACH3DSAU")
    3608                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH3DSAU")
    3609                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3610                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3611              $C$DW$439       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    3613                      .dwattr $C$DW$439, DW_AT_name("DMACH3TCR1")
    3614                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH3TCR1")
    3615                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3616                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3617              $C$DW$440       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    3619                      .dwattr $C$DW$440, DW_AT_name("DMACH3TCR2")
    3620                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH3TCR2")
    3621                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3622                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3623                      .dwendtag $C$DW$T$48
    3624              
    3625              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    3626                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3627                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3628              $C$DW$441       .dwtag  DW_TAG_TI_far_type
    3629                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$49)
    3630              $C$DW$442       .dwtag  DW_TAG_TI_ioport_type
    3631                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$441)
    3632              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    3633                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$442)
    3634              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3635                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3636                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    3637              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    3638                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3639                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3640              
    3641              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3642                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
    3643              $C$DW$443       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$52)
    3645                      .dwattr $C$DW$443, DW_AT_name("dmaRegs")
    3646                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_dmaRegs")
    3647                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3648                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   94

    3649              $C$DW$444       .dwtag  DW_TAG_member
    3650                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    3651                      .dwattr $C$DW$444, DW_AT_name("chanNum")
    3652                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_chanNum")
    3653                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3654                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3655              $C$DW$445       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    3657                      .dwattr $C$DW$445, DW_AT_name("dmaInstNum")
    3658                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_dmaInstNum")
    3659                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3660                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3661              $C$DW$446       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$40)
    3663                      .dwattr $C$DW$446, DW_AT_name("isChanFree")
    3664                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_isChanFree")
    3665                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3666                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$447       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$58)
    3669                      .dwattr $C$DW$447, DW_AT_name("chanDir")
    3670                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_chanDir")
    3671                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3672                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3673              $C$DW$448       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$60)
    3675                      .dwattr $C$DW$448, DW_AT_name("trigger")
    3676                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_trigger")
    3677                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3678                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3679              $C$DW$449       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$62)
    3681                      .dwattr $C$DW$449, DW_AT_name("trfType")
    3682                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_trfType")
    3683                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3684                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3685              $C$DW$450       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$64)
    3687                      .dwattr $C$DW$450, DW_AT_name("dmaInt")
    3688                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_dmaInt")
    3689                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3690                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3691              $C$DW$451       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$40)
    3693                      .dwattr $C$DW$451, DW_AT_name("pingPongEnabled")
    3694                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_pingPongEnabled")
    3695                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3696                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3697                      .dwendtag $C$DW$T$65
    3698              
    3699              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    3700                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
    3701                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3702              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3703                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   95

    3704                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    3705              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    3706                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3707                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3708              
    3709              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3710                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    3711              $C$DW$452       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$67)
    3713                      .dwattr $C$DW$452, DW_AT_name("pingPongMode")
    3714                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_pingPongMode")
    3715                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3716                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$453       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$69)
    3719                      .dwattr $C$DW$453, DW_AT_name("autoMode")
    3720                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_autoMode")
    3721                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3722                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$454       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$71)
    3725                      .dwattr $C$DW$454, DW_AT_name("burstLen")
    3726                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_burstLen")
    3727                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3728                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$455       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$60)
    3731                      .dwattr $C$DW$455, DW_AT_name("trigger")
    3732                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_trigger")
    3733                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3734                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$456       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$73)
    3737                      .dwattr $C$DW$456, DW_AT_name("dmaEvt")
    3738                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_dmaEvt")
    3739                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3740                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$457       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$64)
    3743                      .dwattr $C$DW$457, DW_AT_name("dmaInt")
    3744                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_dmaInt")
    3745                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3746                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$458       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$58)
    3749                      .dwattr $C$DW$458, DW_AT_name("chanDir")
    3750                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_chanDir")
    3751                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3752                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$459       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$62)
    3755                      .dwattr $C$DW$459, DW_AT_name("trfType")
    3756                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_trfType")
    3757                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3758                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_intr_example.asm                                           PAGE   96

    3759              $C$DW$460       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    3761                      .dwattr $C$DW$460, DW_AT_name("dataLen")
    3762                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_dataLen")
    3763                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3764                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$461       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$28)
    3767                      .dwattr $C$DW$461, DW_AT_name("srcAddr")
    3768                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_srcAddr")
    3769                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3770                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$462       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$28)
    3773                      .dwattr $C$DW$462, DW_AT_name("destAddr")
    3774                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_destAddr")
    3775                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3776                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3777                      .dwendtag $C$DW$T$74
    3778              
    3779              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    3780                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    3781                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3782              
    3783              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3784                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    3785              $C$DW$463       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    3787                      .dwattr $C$DW$463, DW_AT_name("slice127_112")
    3788                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_slice127_112")
    3789                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3790                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$464       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    3793                      .dwattr $C$DW$464, DW_AT_name("slice111_96")
