TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    7484              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:49 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    6595                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2717,column 5,is_stmt
    6596 00124d DF04          MOV uns(*SP(#2)), AC0 ; |2717| 
         00124f 05   
    6597 001250 1005          SFTS AC0, #2, AC0 ; |2717| 
         001252 02   
    6598 001253 900A          MOV AC0, XAR2
    6599 001255 EC31          AMOV #(_xQueueRegistry+2), XAR3 ; |2717| 
         001257 BE00 
         001259 0002-
    6600              
    6601 00125b 14A1          AADD XAR2, XAR3 ; |2717| 
         00125d B0   
    6602 00125e 3D00  ||      MOV #0, AC0 ; |2717| 
    6603              
    6604 001260 EB61          MOV AC0, dbl(*AR3)
         001262 08   
    6605                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2718,column 5,is_stmt
    6606 001263 4A0E          B $C$L236 ; |2718| 
    6607                                                      ; branch occurs ; |2718| 
    6608 001265       $C$L235:    
    6609 001265       $C$DW$L$_vQueueUnregisterQueue$5$B:
    6610                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 81,is_stmt
    6611 001265 F704          ADD #1, *SP(#2) ; |2707| 
         001267 0001 
    6612                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 33,is_stmt
    6613              
    6614 001269 A904          MOV *SP(#2), AR1 ; |2707| 
    6615 00126b 3D8A  ||      MOV #8, AR2
    6616              
    6617 00126d 1294          CMPU AR1 < AR2, TC1 ; |2707| 
         00126f A4   
    6618 001270 0464          BCC $C$L234,TC1 ; |2707| 
         001272 A3   
    6619                                                      ; branchcc occurs ; |2707| 
    6620 001273       $C$DW$L$_vQueueUnregisterQueue$5$E:
    6621                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2726,column 2,is_stmt
    6622 001273       $C$L236:    
    6623 001273 4E03          AADD #3, SP
    6624                      .dwcfi  cfa_offset, 1
    6625              $C$DW$571       .dwtag  DW_TAG_TI_branch
    6626                      .dwattr $C$DW$571, DW_AT_low_pc(0x00)
    6627                      .dwattr $C$DW$571, DW_AT_TI_return
    6628 001275 4804          RET
    6629                                                      ; return occurs
    6630              
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  141

    6631              $C$DW$572       .dwtag  DW_TAG_TI_loop
    6632                      .dwattr $C$DW$572, DW_AT_name("F:\eZdsp-DBG-sim\tmp1\c55x-sim2\foo\Debug\queue.asm:$C$L234:1:15384728
    6633                      .dwattr $C$DW$572, DW_AT_TI_begin_file("../FreeRTOS/Source/queue.c")
    6634                      .dwattr $C$DW$572, DW_AT_TI_begin_line(0xa93)
    6635                      .dwattr $C$DW$572, DW_AT_TI_end_line(0xaa4)
    6636              $C$DW$573       .dwtag  DW_TAG_TI_loop_range
    6637                      .dwattr $C$DW$573, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$2$B)
    6638                      .dwattr $C$DW$573, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$2$E)
    6639              $C$DW$574       .dwtag  DW_TAG_TI_loop_range
    6640                      .dwattr $C$DW$574, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$5$B)
    6641                      .dwattr $C$DW$574, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$5$E)
    6642                      .dwendtag $C$DW$572
    6643              
    6644                      .dwattr $C$DW$567, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    6645                      .dwattr $C$DW$567, DW_AT_TI_end_line(0xaa6)
    6646                      .dwattr $C$DW$567, DW_AT_TI_end_column(0x02)
    6647                      .dwendentry
    6648                      .dwendtag $C$DW$567
    6649              
    6650              ;******************************************************************************
    6651              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    6652              ;******************************************************************************
    6653                      .global _vPortYield
    6654                      .global _pvPortMalloc
    6655                      .global _vPortFree
    6656                      .global _vListInitialise
    6657                      .global _vTaskSuspendAll
    6658                      .global _xTaskResumeAll
    6659                      .global _vTaskPlaceOnEventList
    6660                      .global _xTaskRemoveFromEventList
    6661                      .global _xTaskGetCurrentTaskHandle
    6662                      .global _xTaskCheckForTimeOut
    6663                      .global _vTaskMissedYield
    6664                      .global _xTaskPriorityInherit
    6665                      .global _xTaskPriorityDisinherit
    6666                      .global _vTaskPriorityDisinheritAfterTimeout
    6667                      .global _pvTaskIncrementMutexHeldCount
    6668                      .global _vTaskInternalSetTimeOutState
    6669                      .global _usCriticalNesting
    6670                      .global _memcpy
    6671              
    6672              ;*******************************************************************************
    6673              ;* TYPE INFORMATION                                                            *
    6674              ;*******************************************************************************
    6675              
    6676              $C$DW$T$22      .dwtag  DW_TAG_union_type
    6677                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    6678              $C$DW$575       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    6680                      .dwattr $C$DW$575, DW_AT_name("xQueue")
    6681                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_xQueue")
    6682                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6683                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6684              $C$DW$576       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  142

    6686                      .dwattr $C$DW$576, DW_AT_name("xSemaphore")
    6687                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_xSemaphore")
    6688                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6689                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6690                      .dwendtag $C$DW$T$22
    6691              
    6692              
    6693              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6694                      .dwattr $C$DW$T$28, DW_AT_name("QUEUE_REGISTRY_ITEM")
    6695                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    6696              $C$DW$577       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$25)
    6698                      .dwattr $C$DW$577, DW_AT_name("pcQueueName")
    6699                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_pcQueueName")
    6700                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6701                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6702              $C$DW$578       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$27)
    6704                      .dwattr $C$DW$578, DW_AT_name("xHandle")
    6705                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_xHandle")
    6706                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6707                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6708                      .dwendtag $C$DW$T$28
    6709              
    6710              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueRegistryItem")
    6711                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$28)
    6712                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6713              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("QueueRegistryItem_t")
    6714                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    6715                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6716              
    6717              $C$DW$T$53      .dwtag  DW_TAG_array_type
    6718                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    6719                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6720                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x20)
    6721              $C$DW$579       .dwtag  DW_TAG_subrange_type
    6722                      .dwattr $C$DW$579, DW_AT_upper_bound(0x07)
    6723                      .dwendtag $C$DW$T$53
    6724              
    6725              
    6726              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6727                      .dwattr $C$DW$T$35, DW_AT_name("QueueDefinition")
    6728                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x22)
    6729              $C$DW$580       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$30)
    6731                      .dwattr $C$DW$580, DW_AT_name("pcHead")
    6732                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_pcHead")
    6733                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6734                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6735              $C$DW$581       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$30)
    6737                      .dwattr $C$DW$581, DW_AT_name("pcWriteTo")
    6738                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_pcWriteTo")
    6739                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6740                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  143

    6741              $C$DW$582       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
    6743                      .dwattr $C$DW$582, DW_AT_name("u")
    6744                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_u")
    6745                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6746                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6747              $C$DW$583       .dwtag  DW_TAG_member
    6748                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$31)
    6749                      .dwattr $C$DW$583, DW_AT_name("xTasksWaitingToSend")
    6750                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    6751                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6752                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6753              $C$DW$584       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$31)
    6755                      .dwattr $C$DW$584, DW_AT_name("xTasksWaitingToReceive")
    6756                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    6757                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6758                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6759              $C$DW$585       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$33)
    6761                      .dwattr $C$DW$585, DW_AT_name("uxMessagesWaiting")
    6762                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    6763                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6764                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6765              $C$DW$586       .dwtag  DW_TAG_member
    6766                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$32)
    6767                      .dwattr $C$DW$586, DW_AT_name("uxLength")
    6768                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_uxLength")
    6769                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6770                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6771              $C$DW$587       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$32)
    6773                      .dwattr $C$DW$587, DW_AT_name("uxItemSize")
    6774                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_uxItemSize")
    6775                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6776                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6777              $C$DW$588       .dwtag  DW_TAG_member
    6778                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$34)
    6779                      .dwattr $C$DW$588, DW_AT_name("cRxLock")
    6780                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_cRxLock")
    6781                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6782                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6783              $C$DW$589       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$34)
    6785                      .dwattr $C$DW$589, DW_AT_name("cTxLock")
    6786                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_cTxLock")
    6787                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6788                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6789                      .dwendtag $C$DW$T$35
    6790              
    6791              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    6792                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    6793                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    6794              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    6795                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  144

    6796                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    6797              $C$DW$590       .dwtag  DW_TAG_TI_far_type
    6798                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$27)
    6799              $C$DW$T$55      .dwtag  DW_TAG_const_type
    6800                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$590)
    6801              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    6802                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    6803                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    6804              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
    6805                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    6806                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    6807              $C$DW$591       .dwtag  DW_TAG_TI_far_type
    6808                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$64)
    6809              $C$DW$T$65      .dwtag  DW_TAG_const_type
    6810                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$591)
    6811              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    6812                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    6813                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    6814              $C$DW$592       .dwtag  DW_TAG_TI_far_type
    6815                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$66)
    6816              $C$DW$T$67      .dwtag  DW_TAG_const_type
    6817                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$592)
    6818              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    6819                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    6820                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    6821              $C$DW$593       .dwtag  DW_TAG_TI_far_type
    6822                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$68)
    6823              $C$DW$T$69      .dwtag  DW_TAG_const_type
    6824                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$593)
    6825              
    6826              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6827                      .dwattr $C$DW$T$36, DW_AT_name("QueuePointers")
    6828                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    6829              $C$DW$594       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$30)
    6831                      .dwattr $C$DW$594, DW_AT_name("pcTail")
    6832                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_pcTail")
    6833                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6834                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$595       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$30)
    6837                      .dwattr $C$DW$595, DW_AT_name("pcReadFrom")
    6838                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_pcReadFrom")
    6839                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6840                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6841                      .dwendtag $C$DW$T$36
    6842              
    6843              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    6844                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$36)
    6845                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    6846              
    6847              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6848                      .dwattr $C$DW$T$39, DW_AT_name("SemaphoreData")
    6849                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    6850              $C$DW$596       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  145

    6851                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$38)
    6852                      .dwattr $C$DW$596, DW_AT_name("xMutexHolder")
    6853                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_xMutexHolder")
    6854                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6855                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6856              $C$DW$597       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$32)
    6858                      .dwattr $C$DW$597, DW_AT_name("uxRecursiveCallCount")
    6859                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
    6860                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6861                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6862                      .dwendtag $C$DW$T$39
    6863              
    6864              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    6865                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$39)
    6866                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6867              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6868                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    6869              $C$DW$598       .dwtag  DW_TAG_TI_far_type
    6870                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$3)
    6871              $C$DW$T$76      .dwtag  DW_TAG_const_type
    6872                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$598)
    6873              $C$DW$599       .dwtag  DW_TAG_TI_far_type
    6874              $C$DW$T$70      .dwtag  DW_TAG_const_type
    6875                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$599)
    6876              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6877                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6878                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    6879              $C$DW$600       .dwtag  DW_TAG_TI_far_type
    6880                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$71)
    6881              $C$DW$T$77      .dwtag  DW_TAG_const_type
    6882                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$600)
    6883              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6884                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6885                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6886                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6887              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6888                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6889                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6890                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6891              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    6892                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    6893                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6894              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    6895                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    6896                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    6897              $C$DW$601       .dwtag  DW_TAG_TI_far_type
    6898                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$29)
    6899              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    6900                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$601)
    6901              $C$DW$602       .dwtag  DW_TAG_TI_far_type
    6902                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$29)
    6903              $C$DW$T$109     .dwtag  DW_TAG_const_type
    6904                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$602)
    6905              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  146

    6906                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6907                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6908                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6909              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    6910                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    6911                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6912              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    6913                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$57)
    6914                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    6915              $C$DW$603       .dwtag  DW_TAG_TI_far_type
    6916                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$57)
    6917              $C$DW$T$58      .dwtag  DW_TAG_const_type
    6918                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$603)
    6919              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6920                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6921                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6922                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6923              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6924                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6925                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6926                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6927              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    6928                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$8)
    6929                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6930              $C$DW$604       .dwtag  DW_TAG_TI_far_type
    6931                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$49)
    6932              $C$DW$T$110     .dwtag  DW_TAG_const_type
    6933                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$604)
    6934              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    6935                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$49)
    6936                      .dwattr $C$DW$T$131, DW_AT_address_class(0x17)
    6937              $C$DW$605       .dwtag  DW_TAG_TI_far_type
    6938                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$131)
    6939              $C$DW$T$132     .dwtag  DW_TAG_const_type
    6940                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$605)
    6941              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6942                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6943                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6944                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6945              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    6946                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$9)
    6947                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    6948              $C$DW$606       .dwtag  DW_TAG_TI_far_type
    6949                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$32)
    6950              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    6951                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$606)
    6952              $C$DW$607       .dwtag  DW_TAG_TI_far_type
    6953                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$32)
    6954              $C$DW$T$56      .dwtag  DW_TAG_const_type
    6955                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$607)
    6956              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6957                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6958                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6959                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    6960              $C$DW$T$11      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  147

    6961                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6962                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6963                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6964              $C$DW$608       .dwtag  DW_TAG_TI_far_type
    6965                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$11)
    6966              $C$DW$T$147     .dwtag  DW_TAG_volatile_type
    6967                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$608)
    6968              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    6969                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    6970                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6971              $C$DW$T$12      .dwtag  DW_TAG_base_type
    6972                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6973                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6974                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6975              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6976                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6977                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6978                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6979              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    6980                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    6981                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6982              $C$DW$609       .dwtag  DW_TAG_TI_far_type
    6983                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$44)
    6984              $C$DW$T$86      .dwtag  DW_TAG_const_type
    6985                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$609)
    6986              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    6987                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$44)
    6988                      .dwattr $C$DW$T$118, DW_AT_address_class(0x17)
    6989              $C$DW$610       .dwtag  DW_TAG_TI_far_type
    6990                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$118)
    6991              $C$DW$T$119     .dwtag  DW_TAG_const_type
    6992                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$610)
    6993              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6994                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6995                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6996                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6997                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    6998                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    6999              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7000                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7001                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7002                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7003                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7004                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7005              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7006                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7007                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7008                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7009              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7010                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7011                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7012                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7013              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7014                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7015                      .dwattr $C$DW$T$18, DW_AT_name("long double")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  148

    7016                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7017              $C$DW$T$23      .dwtag  DW_TAG_base_type
    7018                      .dwattr $C$DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    7019                      .dwattr $C$DW$T$23, DW_AT_name("signed char")
    7020                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    7021              $C$DW$611       .dwtag  DW_TAG_TI_far_type
    7022                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$23)
    7023              $C$DW$T$24      .dwtag  DW_TAG_const_type
    7024                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$611)
    7025              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    7026                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    7027                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    7028              
    7029              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7030                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    7031                      .dwattr $C$DW$T$19, DW_AT_declaration
    7032                      .dwendtag $C$DW$T$19
    7033              
    7034              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7035                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    7036                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    7037              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7038                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7039                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7040              $C$DW$612       .dwtag  DW_TAG_TI_far_type
    7041                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$38)
    7042              $C$DW$T$89      .dwtag  DW_TAG_const_type
    7043                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$612)
    7044              
    7045              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7046                      .dwattr $C$DW$T$43, DW_AT_name("xLIST")
    7047                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    7048              $C$DW$613       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$33)
    7050                      .dwattr $C$DW$613, DW_AT_name("uxNumberOfItems")
    7051                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7052                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7053                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    7054              $C$DW$614       .dwtag  DW_TAG_member
    7055                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$41)
    7056                      .dwattr $C$DW$614, DW_AT_name("pxIndex")
    7057                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_pxIndex")
    7058                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7059                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    7060              $C$DW$615       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$42)
    7062                      .dwattr $C$DW$615, DW_AT_name("xListEnd")
    7063                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_xListEnd")
    7064                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7065                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    7066                      .dwendtag $C$DW$T$43
    7067              
    7068              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7069                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$43)
    7070                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  149

    7071              $C$DW$616       .dwtag  DW_TAG_TI_far_type
    7072                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$31)
    7073              $C$DW$T$113     .dwtag  DW_TAG_const_type
    7074                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$616)
    7075              $C$DW$T$114     .dwtag  DW_TAG_pointer_type
    7076                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    7077                      .dwattr $C$DW$T$114, DW_AT_address_class(0x17)
    7078              $C$DW$617       .dwtag  DW_TAG_TI_far_type
    7079                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$114)
    7080              $C$DW$T$115     .dwtag  DW_TAG_const_type
    7081                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$617)
    7082              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    7083                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    7084                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    7085              $C$DW$618       .dwtag  DW_TAG_TI_far_type
    7086                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$82)
    7087              $C$DW$T$83      .dwtag  DW_TAG_const_type
    7088                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$618)
    7089              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7090                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    7091                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    7092              
    7093              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7094                      .dwattr $C$DW$T$47, DW_AT_name("xLIST_ITEM")
    7095                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    7096              $C$DW$619       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$44)
    7098                      .dwattr $C$DW$619, DW_AT_name("xItemValue")
    7099                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_xItemValue")
    7100                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7101                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$620       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$45)
    7104                      .dwattr $C$DW$620, DW_AT_name("pxNext")
    7105                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_pxNext")
    7106                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7107                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$621       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$45)
    7110                      .dwattr $C$DW$621, DW_AT_name("pxPrevious")
    7111                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pxPrevious")
    7112                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7113                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$622       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$3)
    7116                      .dwattr $C$DW$622, DW_AT_name("pvOwner")
    7117                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pvOwner")
    7118                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7119                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$623       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$46)
    7122                      .dwattr $C$DW$623, DW_AT_name("pvContainer")
    7123                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_pvContainer")
    7124                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7125                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  150

    7126                      .dwendtag $C$DW$T$47
    7127              
    7128              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7129                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$47)
    7130                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7131              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    7132                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7133                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    7134              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7135                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$47)
    7136                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    7137              
    7138              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    7139                      .dwattr $C$DW$T$48, DW_AT_name("xMINI_LIST_ITEM")
    7140                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    7141              $C$DW$624       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$44)
    7143                      .dwattr $C$DW$624, DW_AT_name("xItemValue")
    7144                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_xItemValue")
    7145                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7146                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$625       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$45)
    7149                      .dwattr $C$DW$625, DW_AT_name("pxNext")
    7150                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_pxNext")
    7151                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7152                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$626       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$45)
    7155                      .dwattr $C$DW$626, DW_AT_name("pxPrevious")
    7156                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_pxPrevious")
    7157                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7158                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7159                      .dwendtag $C$DW$T$48
    7160              
    7161              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7162                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$48)
    7163                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7164              
    7165              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7166                      .dwattr $C$DW$T$50, DW_AT_name("xTIME_OUT")
    7167                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    7168              $C$DW$627       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$49)
    7170                      .dwattr $C$DW$627, DW_AT_name("xOverflowCount")
    7171                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_xOverflowCount")
    7172                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7173                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    7174              $C$DW$628       .dwtag  DW_TAG_member
    7175                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$44)
    7176                      .dwattr $C$DW$628, DW_AT_name("xTimeOnEntering")
    7177                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7178                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7179                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7180                      .dwendtag $C$DW$T$50
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  151

    7181              
    7182              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7183                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    7184                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7185              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7186                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7187                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    7188              $C$DW$629       .dwtag  DW_TAG_TI_far_type
    7189                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$93)
    7190              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7191                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$629)
    7192                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7193              
    7194              ;***************************************************************
    7195              ;* DWARF CIE ENTRIES                                           *
    7196              ;***************************************************************
    7197              
    7198              $C$DW$CIE       .dwcie 91
    7199                      .dwcfi  cfa_register, 36
    7200                      .dwcfi  cfa_offset, 0
    7201                      .dwcfi  undefined, 0
    7202                      .dwcfi  undefined, 1
    7203                      .dwcfi  undefined, 2
    7204                      .dwcfi  undefined, 3
    7205                      .dwcfi  undefined, 4
    7206                      .dwcfi  undefined, 5
    7207                      .dwcfi  undefined, 6
    7208                      .dwcfi  undefined, 7
    7209                      .dwcfi  undefined, 8
    7210                      .dwcfi  undefined, 9
    7211                      .dwcfi  undefined, 10
    7212                      .dwcfi  undefined, 11
    7213                      .dwcfi  undefined, 12
    7214                      .dwcfi  undefined, 13
    7215                      .dwcfi  same_value, 14
    7216                      .dwcfi  same_value, 15
    7217                      .dwcfi  undefined, 16
    7218                      .dwcfi  undefined, 17
    7219                      .dwcfi  undefined, 18
    7220                      .dwcfi  undefined, 19
    7221                      .dwcfi  undefined, 20
    7222                      .dwcfi  undefined, 21
    7223                      .dwcfi  undefined, 22
    7224                      .dwcfi  undefined, 23
    7225                      .dwcfi  undefined, 24
    7226                      .dwcfi  undefined, 25
    7227                      .dwcfi  same_value, 26
    7228                      .dwcfi  same_value, 27
    7229                      .dwcfi  same_value, 28
    7230                      .dwcfi  same_value, 29
    7231                      .dwcfi  same_value, 30
    7232                      .dwcfi  same_value, 31
    7233                      .dwcfi  undefined, 32
    7234                      .dwcfi  undefined, 33
    7235                      .dwcfi  undefined, 34
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  152

    7236                      .dwcfi  undefined, 35
    7237                      .dwcfi  undefined, 36
    7238                      .dwcfi  undefined, 37
    7239                      .dwcfi  undefined, 38
    7240                      .dwcfi  undefined, 39
