TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9984              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Oct 02 02:33:54 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9255              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    9256                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$37)
    9257                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    9258              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    9259                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$93)
    9260              $C$DW$T$94      .dwtag  DW_TAG_const_type
    9261                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$661)
    9262              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    9263                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    9264                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    9265              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    9266                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$28)
    9267                      .dwattr $C$DW$T$133, DW_AT_address_class(0x17)
    9268              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    9269                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$28)
    9270              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    9271                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$662)
    9272              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    9273                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$28)
    9274              $C$DW$T$78      .dwtag  DW_TAG_const_type
    9275                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$663)
    9276              $C$DW$T$14      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  207

    9277                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9278                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9279                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9280                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    9281                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    9282              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9283                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9284                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9285                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9286                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    9287                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    9288              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9289                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9290                      .dwattr $C$DW$T$16, DW_AT_name("float")
    9291                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9292              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9293                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9294                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9295                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9296              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9297                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9298                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9299                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    9300              $C$DW$T$26      .dwtag  DW_TAG_base_type
    9301                      .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
    9302                      .dwattr $C$DW$T$26, DW_AT_name("signed char")
    9303                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9304              
    9305              $C$DW$T$27      .dwtag  DW_TAG_array_type
    9306                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    9307                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9308                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    9309              $C$DW$664       .dwtag  DW_TAG_subrange_type
    9310                      .dwattr $C$DW$664, DW_AT_upper_bound(0x07)
    9311                      .dwendtag $C$DW$T$27
    9312              
    9313              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    9314                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    9315              $C$DW$T$75      .dwtag  DW_TAG_const_type
    9316                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$665)
    9317              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    9318                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    9319                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    9320              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    9321                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$76)
    9322              $C$DW$T$77      .dwtag  DW_TAG_const_type
    9323                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$666)
    9324              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    9325                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$26)
    9326                      .dwattr $C$DW$T$150, DW_AT_address_class(0x17)
    9327              
    9328              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9329                      .dwattr $C$DW$T$21, DW_AT_name("tagSTACKSTRUCT")
    9330                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    9331              $C$DW$667       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  208

    9332                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    9333                      .dwattr $C$DW$667, DW_AT_name("pxTopOfStack")
    9334                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pxTopOfStack")
    9335                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9336                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9337              $C$DW$668       .dwtag  DW_TAG_member
    9338                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    9339                      .dwattr $C$DW$668, DW_AT_name("pxTopOfSysStack")
    9340                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9341                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9342                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9343                      .dwendtag $C$DW$T$21
    9344              
    9345              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9346                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$21)
    9347                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    9348              
    9349              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9350                      .dwattr $C$DW$T$32, DW_AT_name("tskTaskControlBlock")
    9351                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x32)
    9352              $C$DW$669       .dwtag  DW_TAG_member
    9353                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    9354                      .dwattr $C$DW$669, DW_AT_name("pxTopOfStack")
    9355                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pxTopOfStack")
    9356                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9357                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9358              $C$DW$670       .dwtag  DW_TAG_member
    9359                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    9360                      .dwattr $C$DW$670, DW_AT_name("pxTopOfSysStack")
    9361                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9362                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9363                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9364              $C$DW$671       .dwtag  DW_TAG_member
    9365                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    9366                      .dwattr $C$DW$671, DW_AT_name("xStateListItem")
    9367                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_xStateListItem")
    9368                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9369                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9370              $C$DW$672       .dwtag  DW_TAG_member
    9371                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    9372                      .dwattr $C$DW$672, DW_AT_name("xEventListItem")
    9373                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_xEventListItem")
    9374                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9375                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9376              $C$DW$673       .dwtag  DW_TAG_member
    9377                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$25)
    9378                      .dwattr $C$DW$673, DW_AT_name("uxPriority")
    9379                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_uxPriority")
    9380                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9381                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    9382              $C$DW$674       .dwtag  DW_TAG_member
    9383                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$20)
    9384                      .dwattr $C$DW$674, DW_AT_name("pxStack")
    9385                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pxStack")
    9386                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  209

    9387                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9388              $C$DW$675       .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    9390                      .dwattr $C$DW$675, DW_AT_name("pxSysStack")
    9391                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxSysStack")
    9392                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9393                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9394              $C$DW$676       .dwtag  DW_TAG_member
    9395                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$27)
    9396                      .dwattr $C$DW$676, DW_AT_name("pcTaskName")
    9397                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pcTaskName")
    9398                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9399                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9400              $C$DW$677       .dwtag  DW_TAG_member
    9401                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$20)
    9402                      .dwattr $C$DW$677, DW_AT_name("pxEndOfStack")
    9403                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pxEndOfStack")
    9404                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9405                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9406              $C$DW$678       .dwtag  DW_TAG_member
    9407                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$20)
    9408                      .dwattr $C$DW$678, DW_AT_name("pxEndOfSysStack")
    9409                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pxEndOfSysStack")
    9410                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9411                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9412              $C$DW$679       .dwtag  DW_TAG_member
    9413                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    9414                      .dwattr $C$DW$679, DW_AT_name("uxCriticalNesting")
    9415                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_uxCriticalNesting")
    9416                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9417                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9418              $C$DW$680       .dwtag  DW_TAG_member
    9419                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    9420                      .dwattr $C$DW$680, DW_AT_name("uxBasePriority")
    9421                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_uxBasePriority")
    9422                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    9423                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9424              $C$DW$681       .dwtag  DW_TAG_member
    9425                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$25)
    9426                      .dwattr $C$DW$681, DW_AT_name("uxMutexesHeld")
    9427                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9428                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9429                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9430              $C$DW$682       .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$29)
    9432                      .dwattr $C$DW$682, DW_AT_name("ulNotifiedValue")
    9433                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9434                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9435                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9436              $C$DW$683       .dwtag  DW_TAG_member
    9437                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$31)
    9438                      .dwattr $C$DW$683, DW_AT_name("ucNotifyState")
    9439                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_ucNotifyState")
    9440                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9441                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  210

    9442                      .dwendtag $C$DW$T$32
    9443              
    9444              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9445                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$32)
    9446                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    9447              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9448                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9449                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9450              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    9451                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$48)
    9452              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9453                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$684)
    9454              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9455                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$48)
    9456                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9457              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    9458                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$79)
    9459              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9460                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$685)
    9461              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9462                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    9463                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9464              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9465                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9466                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9467              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    9468                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$82)
    9469              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9470                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$686)
    9471              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    9472                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    9473                      .dwattr $C$DW$T$157, DW_AT_address_class(0x17)
    9474              $C$DW$687       .dwtag  DW_TAG_TI_far_type
    9475                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$157)
    9476              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9477                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$687)
    9478              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9479                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9480                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9481              $C$DW$688       .dwtag  DW_TAG_TI_far_type
    9482                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$83)
    9483              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9484                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$688)
    9485              $C$DW$689       .dwtag  DW_TAG_TI_far_type
    9486                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$83)
    9487              $C$DW$T$160     .dwtag  DW_TAG_const_type
    9488                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$689)
    9489              
    9490              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9491                      .dwattr $C$DW$T$36, DW_AT_name("xLIST")
    9492                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9493              $C$DW$690       .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    9495                      .dwattr $C$DW$690, DW_AT_name("uxNumberOfItems")
    9496                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_uxNumberOfItems")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  211

    9497                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9498                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9499              $C$DW$691       .dwtag  DW_TAG_member
    9500                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$34)
    9501                      .dwattr $C$DW$691, DW_AT_name("pxIndex")
    9502                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pxIndex")
    9503                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9504                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9505              $C$DW$692       .dwtag  DW_TAG_member
    9506                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$35)
    9507                      .dwattr $C$DW$692, DW_AT_name("xListEnd")
    9508                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_xListEnd")
    9509                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9510                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    9511                      .dwendtag $C$DW$T$36
    9512              
    9513              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9514                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$36)
    9515                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9516              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    9517                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$65)
    9518              $C$DW$T$128     .dwtag  DW_TAG_const_type
    9519                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$693)
    9520              $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    9521                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9522                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    9523              $C$DW$694       .dwtag  DW_TAG_TI_far_type
    9524                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$129)
    9525              $C$DW$T$130     .dwtag  DW_TAG_const_type
    9526                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$694)
    9527              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9528                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    9529                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    9530              $C$DW$695       .dwtag  DW_TAG_TI_far_type
    9531                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$66)
    9532              $C$DW$T$67      .dwtag  DW_TAG_const_type
    9533                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$695)
    9534              $C$DW$696       .dwtag  DW_TAG_TI_far_type
    9535                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$66)
    9536              $C$DW$T$161     .dwtag  DW_TAG_volatile_type
    9537                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$696)
    9538              
    9539              $C$DW$T$162     .dwtag  DW_TAG_array_type
    9540                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$65)
    9541                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    9542                      .dwattr $C$DW$T$162, DW_AT_byte_size(0x32)
    9543              $C$DW$697       .dwtag  DW_TAG_subrange_type
    9544                      .dwattr $C$DW$697, DW_AT_upper_bound(0x04)
    9545                      .dwendtag $C$DW$T$162
    9546              
    9547              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    9548                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    9549                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    9550              
    9551              $C$DW$T$40      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  212

    9552                      .dwattr $C$DW$T$40, DW_AT_name("xLIST_ITEM")
    9553                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    9554              $C$DW$698       .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$37)
    9556                      .dwattr $C$DW$698, DW_AT_name("xItemValue")
    9557                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_xItemValue")
    9558                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9559                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9560              $C$DW$699       .dwtag  DW_TAG_member
    9561                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$38)
    9562                      .dwattr $C$DW$699, DW_AT_name("pxNext")
    9563                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pxNext")
    9564                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9565                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    9566              $C$DW$700       .dwtag  DW_TAG_member
    9567                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$38)
    9568                      .dwattr $C$DW$700, DW_AT_name("pxPrevious")
    9569                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pxPrevious")
    9570                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9571                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9572              $C$DW$701       .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$3)
    9574                      .dwattr $C$DW$701, DW_AT_name("pvOwner")
    9575                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_pvOwner")
    9576                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9577                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    9578              $C$DW$702       .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$39)
    9580                      .dwattr $C$DW$702, DW_AT_name("pvContainer")
    9581                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_pvContainer")
    9582                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9583                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9584                      .dwendtag $C$DW$T$40
    9585              
    9586              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9587                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    9588                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    9589              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9590                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    9591                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    9592              $C$DW$703       .dwtag  DW_TAG_TI_far_type
    9593                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$34)
    9594              $C$DW$T$70      .dwtag  DW_TAG_const_type
    9595                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$703)
    9596              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    9597                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$40)
    9598                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    9599              
    9600              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9601                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    9602                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    9603              $C$DW$704       .dwtag  DW_TAG_member
    9604                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$3)
    9605                      .dwattr $C$DW$704, DW_AT_name("pvBaseAddress")
    9606                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_pvBaseAddress")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  213

    9607                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9608                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9609              $C$DW$705       .dwtag  DW_TAG_member
    9610                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$28)
    9611                      .dwattr $C$DW$705, DW_AT_name("ulLengthInBytes")
    9612                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9613                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9614                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9615              $C$DW$706       .dwtag  DW_TAG_member
    9616                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$28)
    9617                      .dwattr $C$DW$706, DW_AT_name("ulParameters")
    9618                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ulParameters")
    9619                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9620                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    9621                      .dwendtag $C$DW$T$41
    9622              
    9623              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9624                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    9625                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9626              $C$DW$707       .dwtag  DW_TAG_TI_far_type
    9627                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$84)
    9628              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9629                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$707)
    9630              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9631                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9632                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9633              $C$DW$708       .dwtag  DW_TAG_TI_far_type
    9634                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$86)
    9635              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9636                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$708)
    9637              
    9638              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9639                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    9640                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    9641              $C$DW$709       .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$37)
    9643                      .dwattr $C$DW$709, DW_AT_name("xItemValue")
    9644                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_xItemValue")
    9645                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9646                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9647              $C$DW$710       .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$38)
    9649                      .dwattr $C$DW$710, DW_AT_name("pxNext")
    9650                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_pxNext")
    9651                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9652                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9653              $C$DW$711       .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$38)
    9655                      .dwattr $C$DW$711, DW_AT_name("pxPrevious")
    9656                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_pxPrevious")
    9657                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9658                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9659                      .dwendtag $C$DW$T$42
    9660              
    9661              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  214

    9662                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    9663                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9664              
    9665              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9666                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    9667                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    9668              $C$DW$712       .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$43)
    9670                      .dwattr $C$DW$712, DW_AT_name("xOverflowCount")
    9671                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_xOverflowCount")
    9672                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9673                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    9674              $C$DW$713       .dwtag  DW_TAG_member
    9675                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$37)
    9676                      .dwattr $C$DW$713, DW_AT_name("xTimeOnEntering")
    9677                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9678                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9679                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    9680                      .dwendtag $C$DW$T$44
    9681              
    9682              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9683                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$44)
    9684                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9685              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9686                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9687                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9688              $C$DW$714       .dwtag  DW_TAG_TI_far_type
    9689                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$103)
    9690              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9691                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$714)
    9692                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9693              
    9694              ;***************************************************************
    9695              ;* DWARF CIE ENTRIES                                           *
    9696              ;***************************************************************
    9697              
    9698              $C$DW$CIE       .dwcie 91
    9699                      .dwcfi  cfa_register, 36
    9700                      .dwcfi  cfa_offset, 0
    9701                      .dwcfi  undefined, 0
    9702                      .dwcfi  undefined, 1
    9703                      .dwcfi  undefined, 2
    9704                      .dwcfi  undefined, 3
    9705                      .dwcfi  undefined, 4
    9706                      .dwcfi  undefined, 5
    9707                      .dwcfi  undefined, 6
    9708                      .dwcfi  undefined, 7
    9709                      .dwcfi  undefined, 8
    9710                      .dwcfi  undefined, 9
    9711                      .dwcfi  undefined, 10
    9712                      .dwcfi  undefined, 11
    9713                      .dwcfi  undefined, 12
    9714                      .dwcfi  undefined, 13
    9715                      .dwcfi  same_value, 14
    9716                      .dwcfi  same_value, 15
TMS320C55x Assembler PC v4.4.1 Tue Oct 02 02:33:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  215

    9717                      .dwcfi  undefined, 16
    9718                      .dwcfi  undefined, 17
    9719                      .dwcfi  undefined, 18
    9720                      .dwcfi  undefined, 19
    9721                      .dwcfi  undefined, 20
    9722                      .dwcfi  undefined, 21
    9723                      .dwcfi  undefined, 22
    9724                      .dwcfi  undefined, 23
    9725                      .dwcfi  undefined, 24
    9726                      .dwcfi  undefined, 25
    9727                      .dwcfi  same_value, 26
    9728                      .dwcfi  same_value, 27
    9729                      .dwcfi  same_value, 28
    9730                      .dwcfi  same_value, 29
    9731                      .dwcfi  same_value, 30
    9732                      .dwcfi  same_value, 31
    9733                      .dwcfi  undefined, 32
    9734                      .dwcfi  undefined, 33
    9735                      .dwcfi  undefined, 34
    9736                      .dwcfi  undefined, 35
    9737                      .dwcfi  undefined, 36
    9738                      .dwcfi  undefined, 37
    9739                      .dwcfi  undefined, 38
    9740                      .dwcfi  undefined, 39
    9741                      .dwcfi  undefined, 40
    9742                      .dwcfi  undefined, 41
    9743                      .dwcfi  undefined, 42
    9744                      .dwcfi  undefined, 43
