TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9908              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Oct 06 06:38:33 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9176                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$37)
    9177              $C$DW$T$146     .dwtag  DW_TAG_volatile_type
    9178                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$660)
    9179              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    9180                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$37)
    9181                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    9182              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    9183                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$93)
    9184              $C$DW$T$94      .dwtag  DW_TAG_const_type
    9185                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$661)
    9186              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    9187                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    9188                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    9189              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    9190                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$28)
    9191                      .dwattr $C$DW$T$133, DW_AT_address_class(0x17)
    9192              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    9193                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$28)
    9194              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    9195                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$662)
    9196              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    9197                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$28)
    9198              $C$DW$T$78      .dwtag  DW_TAG_const_type
    9199                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$663)
    9200              $C$DW$T$14      .dwtag  DW_TAG_base_type
    9201                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9202                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9203                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9204                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    9205                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    9206              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9207                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9208                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9209                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9210                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    9211                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    9212              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9213                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9214                      .dwattr $C$DW$T$16, DW_AT_name("float")
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  205

    9215                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9216              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9217                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9218                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9219                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9220              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9221                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9222                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9223                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    9224              $C$DW$T$26      .dwtag  DW_TAG_base_type
    9225                      .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
    9226                      .dwattr $C$DW$T$26, DW_AT_name("signed char")
    9227                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9228              
    9229              $C$DW$T$27      .dwtag  DW_TAG_array_type
    9230                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    9231                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9232                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    9233              $C$DW$664       .dwtag  DW_TAG_subrange_type
    9234                      .dwattr $C$DW$664, DW_AT_upper_bound(0x07)
    9235                      .dwendtag $C$DW$T$27
    9236              
    9237              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    9238                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    9239              $C$DW$T$75      .dwtag  DW_TAG_const_type
    9240                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$665)
    9241              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    9242                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    9243                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    9244              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    9245                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$76)
    9246              $C$DW$T$77      .dwtag  DW_TAG_const_type
    9247                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$666)
    9248              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    9249                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$26)
    9250                      .dwattr $C$DW$T$150, DW_AT_address_class(0x17)
    9251              
    9252              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9253                      .dwattr $C$DW$T$21, DW_AT_name("tagSTACKSTRUCT")
    9254                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    9255              $C$DW$667       .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    9257                      .dwattr $C$DW$667, DW_AT_name("pxTopOfStack")
    9258                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pxTopOfStack")
    9259                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9260                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9261              $C$DW$668       .dwtag  DW_TAG_member
    9262                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    9263                      .dwattr $C$DW$668, DW_AT_name("pxTopOfSysStack")
    9264                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9265                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9266                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9267                      .dwendtag $C$DW$T$21
    9268              
    9269              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  206

    9270                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$21)
    9271                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    9272              
    9273              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9274                      .dwattr $C$DW$T$32, DW_AT_name("tskTaskControlBlock")
    9275                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x32)
    9276              $C$DW$669       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    9278                      .dwattr $C$DW$669, DW_AT_name("pxTopOfStack")
    9279                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pxTopOfStack")
    9280                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9281                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9282              $C$DW$670       .dwtag  DW_TAG_member
    9283                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    9284                      .dwattr $C$DW$670, DW_AT_name("pxTopOfSysStack")
    9285                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9286                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9287                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9288              $C$DW$671       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    9290                      .dwattr $C$DW$671, DW_AT_name("xStateListItem")
    9291                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_xStateListItem")
    9292                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9293                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9294              $C$DW$672       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    9296                      .dwattr $C$DW$672, DW_AT_name("xEventListItem")
    9297                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_xEventListItem")
    9298                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9299                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9300              $C$DW$673       .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$25)
    9302                      .dwattr $C$DW$673, DW_AT_name("uxPriority")
    9303                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_uxPriority")
    9304                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9305                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    9306              $C$DW$674       .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$20)
    9308                      .dwattr $C$DW$674, DW_AT_name("pxStack")
    9309                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pxStack")
    9310                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9311                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9312              $C$DW$675       .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    9314                      .dwattr $C$DW$675, DW_AT_name("pxSysStack")
    9315                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxSysStack")
    9316                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9317                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9318              $C$DW$676       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$27)
    9320                      .dwattr $C$DW$676, DW_AT_name("pcTaskName")
    9321                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pcTaskName")
    9322                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9323                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9324              $C$DW$677       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  207

    9325                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$20)
    9326                      .dwattr $C$DW$677, DW_AT_name("pxEndOfStack")
    9327                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pxEndOfStack")
    9328                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9329                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9330              $C$DW$678       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$20)
    9332                      .dwattr $C$DW$678, DW_AT_name("pxEndOfSysStack")
    9333                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pxEndOfSysStack")
    9334                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9335                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9336              $C$DW$679       .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    9338                      .dwattr $C$DW$679, DW_AT_name("uxCriticalNesting")
    9339                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_uxCriticalNesting")
    9340                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9341                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9342              $C$DW$680       .dwtag  DW_TAG_member
    9343                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    9344                      .dwattr $C$DW$680, DW_AT_name("uxBasePriority")
    9345                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_uxBasePriority")
    9346                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    9347                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9348              $C$DW$681       .dwtag  DW_TAG_member
    9349                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$25)
    9350                      .dwattr $C$DW$681, DW_AT_name("uxMutexesHeld")
    9351                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9352                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9353                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9354              $C$DW$682       .dwtag  DW_TAG_member
    9355                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$29)
    9356                      .dwattr $C$DW$682, DW_AT_name("ulNotifiedValue")
    9357                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9358                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9359                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9360              $C$DW$683       .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$31)
    9362                      .dwattr $C$DW$683, DW_AT_name("ucNotifyState")
    9363                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_ucNotifyState")
    9364                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9365                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    9366                      .dwendtag $C$DW$T$32
    9367              
    9368              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9369                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$32)
    9370                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    9371              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9372                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9373                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9374              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    9375                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$48)
    9376              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9377                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$684)
    9378              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9379                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$48)
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  208

    9380                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9381              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    9382                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$79)
    9383              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9384                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$685)
    9385              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9386                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    9387                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9388              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9389                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9390                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9391              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    9392                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$82)
    9393              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9394                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$686)
    9395              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    9396                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    9397                      .dwattr $C$DW$T$157, DW_AT_address_class(0x17)
    9398              $C$DW$687       .dwtag  DW_TAG_TI_far_type
    9399                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$157)
    9400              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9401                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$687)
    9402              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9403                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9404                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9405              $C$DW$688       .dwtag  DW_TAG_TI_far_type
    9406                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$83)
    9407              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9408                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$688)
    9409              $C$DW$689       .dwtag  DW_TAG_TI_far_type
    9410                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$83)
    9411              $C$DW$T$160     .dwtag  DW_TAG_const_type
    9412                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$689)
    9413              
    9414              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9415                      .dwattr $C$DW$T$36, DW_AT_name("xLIST")
    9416                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9417              $C$DW$690       .dwtag  DW_TAG_member
    9418                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    9419                      .dwattr $C$DW$690, DW_AT_name("uxNumberOfItems")
    9420                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9421                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9422                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9423              $C$DW$691       .dwtag  DW_TAG_member
    9424                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$34)
    9425                      .dwattr $C$DW$691, DW_AT_name("pxIndex")
    9426                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pxIndex")
    9427                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9428                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9429              $C$DW$692       .dwtag  DW_TAG_member
    9430                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$35)
    9431                      .dwattr $C$DW$692, DW_AT_name("xListEnd")
    9432                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_xListEnd")
    9433                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9434                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  209

    9435                      .dwendtag $C$DW$T$36
    9436              
    9437              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9438                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$36)
    9439                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9440              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    9441                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$65)
    9442              $C$DW$T$128     .dwtag  DW_TAG_const_type
    9443                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$693)
    9444              $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    9445                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9446                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    9447              $C$DW$694       .dwtag  DW_TAG_TI_far_type
    9448                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$129)
    9449              $C$DW$T$130     .dwtag  DW_TAG_const_type
    9450                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$694)
    9451              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9452                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    9453                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    9454              $C$DW$695       .dwtag  DW_TAG_TI_far_type
    9455                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$66)
    9456              $C$DW$T$67      .dwtag  DW_TAG_const_type
    9457                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$695)
    9458              $C$DW$696       .dwtag  DW_TAG_TI_far_type
    9459                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$66)
    9460              $C$DW$T$161     .dwtag  DW_TAG_volatile_type
    9461                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$696)
    9462              
    9463              $C$DW$T$162     .dwtag  DW_TAG_array_type
    9464                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$65)
    9465                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    9466                      .dwattr $C$DW$T$162, DW_AT_byte_size(0x32)
    9467              $C$DW$697       .dwtag  DW_TAG_subrange_type
    9468                      .dwattr $C$DW$697, DW_AT_upper_bound(0x04)
    9469                      .dwendtag $C$DW$T$162
    9470              
    9471              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    9472                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    9473                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    9474              
    9475              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9476                      .dwattr $C$DW$T$40, DW_AT_name("xLIST_ITEM")
    9477                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    9478              $C$DW$698       .dwtag  DW_TAG_member
    9479                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$37)
    9480                      .dwattr $C$DW$698, DW_AT_name("xItemValue")
    9481                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_xItemValue")
    9482                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9483                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9484              $C$DW$699       .dwtag  DW_TAG_member
    9485                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$38)
    9486                      .dwattr $C$DW$699, DW_AT_name("pxNext")
    9487                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pxNext")
    9488                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9489                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  210

    9490              $C$DW$700       .dwtag  DW_TAG_member
    9491                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$38)
    9492                      .dwattr $C$DW$700, DW_AT_name("pxPrevious")
    9493                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pxPrevious")
    9494                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9495                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9496              $C$DW$701       .dwtag  DW_TAG_member
    9497                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$3)
    9498                      .dwattr $C$DW$701, DW_AT_name("pvOwner")
    9499                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_pvOwner")
    9500                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9501                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    9502              $C$DW$702       .dwtag  DW_TAG_member
    9503                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$39)
    9504                      .dwattr $C$DW$702, DW_AT_name("pvContainer")
    9505                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_pvContainer")
    9506                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9507                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9508                      .dwendtag $C$DW$T$40
    9509              
    9510              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9511                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    9512                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    9513              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9514                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    9515                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    9516              $C$DW$703       .dwtag  DW_TAG_TI_far_type
    9517                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$34)
    9518              $C$DW$T$70      .dwtag  DW_TAG_const_type
    9519                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$703)
    9520              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    9521                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$40)
    9522                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    9523              
    9524              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9525                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    9526                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    9527              $C$DW$704       .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$3)
    9529                      .dwattr $C$DW$704, DW_AT_name("pvBaseAddress")
    9530                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_pvBaseAddress")
    9531                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9532                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9533              $C$DW$705       .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$28)
    9535                      .dwattr $C$DW$705, DW_AT_name("ulLengthInBytes")
    9536                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9537                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9538                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9539              $C$DW$706       .dwtag  DW_TAG_member
    9540                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$28)
    9541                      .dwattr $C$DW$706, DW_AT_name("ulParameters")
    9542                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ulParameters")
    9543                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9544                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  211

    9545                      .dwendtag $C$DW$T$41
    9546              
    9547              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9548                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    9549                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9550              $C$DW$707       .dwtag  DW_TAG_TI_far_type
    9551                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$84)
    9552              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9553                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$707)
    9554              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9555                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9556                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9557              $C$DW$708       .dwtag  DW_TAG_TI_far_type
    9558                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$86)
    9559              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9560                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$708)
    9561              
    9562              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9563                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    9564                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    9565              $C$DW$709       .dwtag  DW_TAG_member
    9566                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$37)
    9567                      .dwattr $C$DW$709, DW_AT_name("xItemValue")
    9568                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_xItemValue")
    9569                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9570                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9571              $C$DW$710       .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$38)
    9573                      .dwattr $C$DW$710, DW_AT_name("pxNext")
    9574                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_pxNext")
    9575                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9576                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9577              $C$DW$711       .dwtag  DW_TAG_member
    9578                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$38)
    9579                      .dwattr $C$DW$711, DW_AT_name("pxPrevious")
    9580                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_pxPrevious")
    9581                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9582                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9583                      .dwendtag $C$DW$T$42
    9584              
    9585              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9586                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    9587                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9588              
    9589              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9590                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    9591                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    9592              $C$DW$712       .dwtag  DW_TAG_member
    9593                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$43)
    9594                      .dwattr $C$DW$712, DW_AT_name("xOverflowCount")
    9595                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_xOverflowCount")
    9596                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9597                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    9598              $C$DW$713       .dwtag  DW_TAG_member
    9599                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$37)
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  212

    9600                      .dwattr $C$DW$713, DW_AT_name("xTimeOnEntering")
    9601                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9602                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9603                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    9604                      .dwendtag $C$DW$T$44
    9605              
    9606              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9607                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$44)
    9608                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9609              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9610                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9611                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9612              $C$DW$714       .dwtag  DW_TAG_TI_far_type
    9613                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$103)
    9614              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9615                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$714)
    9616                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9617              
    9618              ;***************************************************************
    9619              ;* DWARF CIE ENTRIES                                           *
    9620              ;***************************************************************
    9621              
    9622              $C$DW$CIE       .dwcie 91
    9623                      .dwcfi  cfa_register, 36
    9624                      .dwcfi  cfa_offset, 0
    9625                      .dwcfi  undefined, 0
    9626                      .dwcfi  undefined, 1
    9627                      .dwcfi  undefined, 2
    9628                      .dwcfi  undefined, 3
    9629                      .dwcfi  undefined, 4
    9630                      .dwcfi  undefined, 5
    9631                      .dwcfi  undefined, 6
    9632                      .dwcfi  undefined, 7
    9633                      .dwcfi  undefined, 8
    9634                      .dwcfi  undefined, 9
    9635                      .dwcfi  undefined, 10
    9636                      .dwcfi  undefined, 11
    9637                      .dwcfi  undefined, 12
    9638                      .dwcfi  undefined, 13
    9639                      .dwcfi  same_value, 14
    9640                      .dwcfi  same_value, 15
    9641                      .dwcfi  undefined, 16
    9642                      .dwcfi  undefined, 17
    9643                      .dwcfi  undefined, 18
    9644                      .dwcfi  undefined, 19
    9645                      .dwcfi  undefined, 20
    9646                      .dwcfi  undefined, 21
    9647                      .dwcfi  undefined, 22
    9648                      .dwcfi  undefined, 23
    9649                      .dwcfi  undefined, 24
    9650                      .dwcfi  undefined, 25
    9651                      .dwcfi  same_value, 26
    9652                      .dwcfi  same_value, 27
    9653                      .dwcfi  same_value, 28
    9654                      .dwcfi  same_value, 29
TMS320C55x Assembler PC v4.4.1 Sat Oct 06 06:38:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  213

    9655                      .dwcfi  same_value, 30
    9656                      .dwcfi  same_value, 31
    9657                      .dwcfi  undefined, 32
    9658                      .dwcfi  undefined, 33
    9659                      .dwcfi  undefined, 34
    9660                      .dwcfi  undefined, 35
    9661                      .dwcfi  undefined, 36
    9662                      .dwcfi  undefined, 37
    9663                      .dwcfi  undefined, 38
    9664                      .dwcfi  undefined, 39
    9665                      .dwcfi  undefined, 40
    9666                      .dwcfi  undefined, 41
    9667                      .dwcfi  undefined, 42
    9668                      .dwcfi  undefined, 43
