TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE    1

    1705              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:31 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     911                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     912                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   26

     913              
     914              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
     915                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
     916              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
     917              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
     918                      .dwendtag $C$DW$T$52
     919              
     920              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
     921                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     922                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     923              
     924              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
     925                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
     926              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
     927              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
     928                      .dwendtag $C$DW$T$54
     929              
     930              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
     931                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
     932                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
     933              
     934              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
     935                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
     936              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
     937              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
     938                      .dwendtag $C$DW$T$56
     939              
     940              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
     941                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
     942                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     943              
     944              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
     945                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
     946              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
     947              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
     948              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
     949              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
     950              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
     951              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
     952              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
     953              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
     954                      .dwendtag $C$DW$T$58
     955              
     956              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
     957                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     958                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     959              
     960              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
     961                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
     962              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
     963              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
     964                      .dwendtag $C$DW$T$60
     965              
     966              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
     967                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   27

     968                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     969              
     970              $C$DW$T$62      .dwtag  DW_TAG_enumeration_type
     971                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
     972              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
     973              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
     974                      .dwendtag $C$DW$T$62
     975              
     976              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
     977                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
     978                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     979              
     980              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     981                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x2e)
     982              $C$DW$127       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
     984                      .dwattr $C$DW$127, DW_AT_name("I2SSCTRL")
     985                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_I2SSCTRL")
     986                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$128       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
     990                      .dwattr $C$DW$128, DW_AT_name("RSVD0")
     991                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RSVD0")
     992                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     993                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     994              $C$DW$129       .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
     996                      .dwattr $C$DW$129, DW_AT_name("I2SSRATE")
     997                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_I2SSRATE")
     998                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     999                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$130       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1002                      .dwattr $C$DW$130, DW_AT_name("RSVD1")
    1003                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RSVD1")
    1004                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1005                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$131       .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1008                      .dwattr $C$DW$131, DW_AT_name("I2STXLT0")
    1009                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_I2STXLT0")
    1010                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1011                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$132       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1014                      .dwattr $C$DW$132, DW_AT_name("I2STXLT1")
    1015                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_I2STXLT1")
    1016                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1017                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$133       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
    1020                      .dwattr $C$DW$133, DW_AT_name("RSVD2")
    1021                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_RSVD2")
    1022                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   28

    1023                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$134       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1026                      .dwattr $C$DW$134, DW_AT_name("I2STXRT0")
    1027                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_I2STXRT0")
    1028                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1029                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$135       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1032                      .dwattr $C$DW$135, DW_AT_name("I2STXRT1")
    1033                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_I2STXRT1")
    1034                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1035                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$136       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1038                      .dwattr $C$DW$136, DW_AT_name("RSVD3")
    1039                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RSVD3")
    1040                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1041                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$137       .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1044                      .dwattr $C$DW$137, DW_AT_name("I2SINTFL")
    1045                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_I2SINTFL")
    1046                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1047                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$138       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1050                      .dwattr $C$DW$138, DW_AT_name("RSVD4")
    1051                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RSVD4")
    1052                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1053                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$139       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1056                      .dwattr $C$DW$139, DW_AT_name("I2SINTMASK")
    1057                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_I2SINTMASK")
    1058                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1059                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1060              $C$DW$140       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    1062                      .dwattr $C$DW$140, DW_AT_name("RSVD5")
    1063                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RSVD5")
    1064                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1065                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$141       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1068                      .dwattr $C$DW$141, DW_AT_name("I2SRXLT0")
    1069                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_I2SRXLT0")
    1070                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1071                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$142       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1074                      .dwattr $C$DW$142, DW_AT_name("I2SRXLT1")
    1075                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_I2SRXLT1")
    1076                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1077                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   29

    1078              $C$DW$143       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    1080                      .dwattr $C$DW$143, DW_AT_name("RSVD6")
    1081                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RSVD6")
    1082                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1083                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$144       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1086                      .dwattr $C$DW$144, DW_AT_name("I2SRXRT0")
    1087                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_I2SRXRT0")
    1088                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1089                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$145       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1092                      .dwattr $C$DW$145, DW_AT_name("I2SRXRT1")
    1093                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_I2SRXRT1")
    1094                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1095                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1096                      .dwendtag $C$DW$T$24
    1097              
    1098              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
    1099                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
    1100                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1101              $C$DW$146       .dwtag  DW_TAG_TI_far_type
    1102                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
    1103              $C$DW$147       .dwtag  DW_TAG_TI_ioport_type
    1104                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$146)
    1105              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    1106                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$147)
    1107              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1108                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1109                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    1110              
    1111              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1112                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    1113              $C$DW$148       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$26)
    1115                      .dwattr $C$DW$148, DW_AT_name("i2sNum")
    1116                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_i2sNum")
    1117                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$149       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
    1121                      .dwattr $C$DW$149, DW_AT_name("opMode")
    1122                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_opMode")
    1123                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1124                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$150       .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    1127                      .dwattr $C$DW$150, DW_AT_name("chType")
    1128                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_chType")
    1129                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1130                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$151       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$33)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   30

    1133                      .dwattr $C$DW$151, DW_AT_name("hwRegs")
    1134                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_hwRegs")
    1135                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1136                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$152       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$152, DW_AT_name("configured")
    1140                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_configured")
    1141                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1142                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$153       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$35)
    1145                      .dwattr $C$DW$153, DW_AT_name("datapack")
    1146                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_datapack")
    1147                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1148                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$154       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$37)
    1151                      .dwattr $C$DW$154, DW_AT_name("fsDiv")
    1152                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_fsDiv")
    1153                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1154                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$155       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$39)
    1157                      .dwattr $C$DW$155, DW_AT_name("wordLen")
    1158                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_wordLen")
    1159                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1160                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1161              $C$DW$156       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$41)
    1163                      .dwattr $C$DW$156, DW_AT_name("loopBackMode")
    1164                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_loopBackMode")
    1165                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1166                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$157       .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$42)
    1169                      .dwattr $C$DW$157, DW_AT_name("firstRead")
    1170                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_firstRead")
    1171                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1172                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1173                      .dwendtag $C$DW$T$43
    1174              
    1175              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
    1176                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$43)
    1177                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1178              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1179                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1180                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    1181              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
    1182                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1183                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1184              
    1185              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    1186                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    1187              $C$DW$158       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   31

    1188                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$45)
    1189                      .dwattr $C$DW$158, DW_AT_name("dataType")
    1190                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_dataType")
    1191                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$159       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$41)
    1195                      .dwattr $C$DW$159, DW_AT_name("loopBackMode")
    1196                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_loopBackMode")
    1197                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1198                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1199              $C$DW$160       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$47)
    1201                      .dwattr $C$DW$160, DW_AT_name("fsPol")
    1202                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_fsPol")
    1203                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1204                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$161       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$49)
    1207                      .dwattr $C$DW$161, DW_AT_name("clkPol")
    1208                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_clkPol")
    1209                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1210                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$162       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$51)
    1213                      .dwattr $C$DW$162, DW_AT_name("datadelay")
    1214                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_datadelay")
    1215                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1216                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$163       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$35)
    1219                      .dwattr $C$DW$163, DW_AT_name("datapack")
    1220                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_datapack")
    1221                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1222                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$164       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$53)
    1225                      .dwattr $C$DW$164, DW_AT_name("signext")
    1226                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_signext")
    1227                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1228                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$165       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$39)
    1231                      .dwattr $C$DW$165, DW_AT_name("wordLen")
    1232                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_wordLen")
    1233                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1234                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$166       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$55)
    1237                      .dwattr $C$DW$166, DW_AT_name("i2sMode")
    1238                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_i2sMode")
    1239                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1240                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$167       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$57)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   32

    1243                      .dwattr $C$DW$167, DW_AT_name("dataFormat")
    1244                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_dataFormat")
    1245                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1246                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$168       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$37)
    1249                      .dwattr $C$DW$168, DW_AT_name("fsDiv")
    1250                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_fsDiv")
    1251                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1252                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$169       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$59)
    1255                      .dwattr $C$DW$169, DW_AT_name("clkDiv")
    1256                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_clkDiv")
    1257                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1258                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$170       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$61)
    1261                      .dwattr $C$DW$170, DW_AT_name("FError")
    1262                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_FError")
    1263                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1264                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$171       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$63)
    1267                      .dwattr $C$DW$171, DW_AT_name("OuError")
    1268                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_OuError")
    1269                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1270                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1271                      .dwendtag $C$DW$T$64
    1272              
    1273              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    1274                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$64)
    1275                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1276              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    1277                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1278                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    1279              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1280                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1281                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1282                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1283              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1284                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1285                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1286                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1287              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1288                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1289                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1290                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1291              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1292                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1293                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1294                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1295              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1296                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1297                      .dwattr $C$DW$T$8, DW_AT_name("short")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s_PollExample.asm                                              PAGE   33

    1298                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1299              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1300                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$8)
    1301                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1302              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1303                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1304                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1305              $C$DW$172       .dwtag  DW_TAG_TI_far_type
    1306                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$73)
    1307              $C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1308                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$172)
    1309              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1310                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1311                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1312                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1313              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1314                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1315                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1316              $C$DW$173       .dwtag  DW_TAG_TI_far_type
    1317                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1318              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1319                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$173)
    1320              
    1321              $C$DW$T$21      .dwtag  DW_TAG_array_type
