;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 29 23:09:00 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit

        MOV #20, T1 ; |197| 
$C$DW$125	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$125, DW_AT_low_pc(0x00)
	.dwattr $C$DW$125, DW_AT_name("_ATA_getLongName")
	.dwattr $C$DW$125, DW_AT_TI_call

        CALL #_ATA_getLongName ; |197| 
||      MOV #0, T0

                                        ; call occurs [#_ATA_getLongName] ; |197| 
        MOV T0, *SP(#4) ; |197| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 199,column 3,is_stmt
        MOV T0, AR1
        BCC $C$L28,AR1 != #0 ; |199| 
                                        ; branchcc occurs ; |199| 
$C$DW$L$_CD$9$E:
$C$DW$L$_CD$10$B:
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 199,column 34,is_stmt
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 192,column 9,is_stmt
        AMAR *SP(#5), XAR0
        AMAR *SP(#35), XAR1
$C$DW$126	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$126, DW_AT_low_pc(0x00)
	.dwattr $C$DW$126, DW_AT_name("_strcmp")
	.dwattr $C$DW$126, DW_AT_TI_call
        CALL #_strcmp ; |192| 
                                        ; call occurs [#_strcmp] ; |192| 
        BCC $C$L26,T0 != #0 ; |192| 
                                        ; branchcc occurs ; |192| 
$C$DW$L$_CD$10$E:
$C$L27:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 201,column 2,is_stmt
        MOV dbl(*SP(#0)), XAR0
$C$DW$127	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$127, DW_AT_low_pc(0x00)
	.dwattr $C$DW$127, DW_AT_name("_ATA_cd")
	.dwattr $C$DW$127, DW_AT_TI_call
        CALL #_ATA_cd ; |201| 
                                        ; call occurs [#_ATA_cd] ; |201| 
        MOV T0, *SP(#4) ; |201| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 203,column 2,is_stmt
        MOV T0, AR1
        BCC $C$L28,AR1 != #0 ; |203| 
                                        ; branchcc occurs ; |203| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 203,column 33,is_stmt
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 205,column 2,is_stmt
$C$L28:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c",line 206,column 1,is_stmt
        AADD #47, SP
	.dwcfi	cfa_offset, 1
$C$DW$128	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$128, DW_AT_low_pc(0x00)
	.dwattr $C$DW$128, DW_AT_TI_return
        RET
                                        ; return occurs

$C$DW$129	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$129, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\ata_ext_func.asm:$C$L26:1:1538287740")
	.dwattr $C$DW$129, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c")
	.dwattr $C$DW$129, DW_AT_TI_begin_line(0xc0)
	.dwattr $C$DW$129, DW_AT_TI_end_line(0xc8)
$C$DW$130	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$130, DW_AT_low_pc($C$DW$L$_CD$8$B)
	.dwattr $C$DW$130, DW_AT_high_pc($C$DW$L$_CD$8$E)
$C$DW$131	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$131, DW_AT_low_pc($C$DW$L$_CD$9$B)
	.dwattr $C$DW$131, DW_AT_high_pc($C$DW$L$_CD$9$E)
$C$DW$132	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$132, DW_AT_low_pc($C$DW$L$_CD$10$B)
	.dwattr $C$DW$132, DW_AT_high_pc($C$DW$L$_CD$10$E)
	.dwendtag $C$DW$129


$C$DW$133	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$133, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\ata_ext_func.asm:$C$L24:1:1538287740")
	.dwattr $C$DW$133, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c")
	.dwattr $C$DW$133, DW_AT_TI_begin_line(0xb2)
	.dwattr $C$DW$133, DW_AT_TI_end_line(0xb5)
$C$DW$134	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$134, DW_AT_low_pc($C$DW$L$_CD$4$B)
	.dwattr $C$DW$134, DW_AT_high_pc($C$DW$L$_CD$4$E)
	.dwendtag $C$DW$133

	.dwattr $C$DW$108, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/mmc_sd/CSL_MMCSD_SdCardFSExtExample/ata_ext_func.c")
	.dwattr $C$DW$108, DW_AT_TI_end_line(0xce)
	.dwattr $C$DW$108, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$108

;*******************************************************************************
;* FAR STRINGS                                                                 *
;*******************************************************************************
	.sect	".const:.string"
	.align	2
$C$FSL1:	.string	10,"ATA_delete of %s successful",10,0
	.align	2
$C$FSL2:	.string	10,"ATA_delete of %s unsuccessful",10,0
	.align	2
$C$FSL3:	.string	10,"file not found",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_ATA_cd
	.global	_ATA_findFirst
	.global	_ATA_findNext
	.global	_ATA_getLongName
	.global	_ATA_create
	.global	_ATA_delete
	.global	_ATA_setFileName
	.global	_strlen
	.global	_toupper
	.global	_strncmp
	.global	_strcmp
	.global	_printf

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_name("AtaFileStruct")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x2a)
$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$135, DW_AT_name("Filename")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("_Filename")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$136, DW_AT_name("Ext")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("_Ext")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$137, DW_AT_name("Attributes")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("_Attributes")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$138, DW_AT_name("Time")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("_Time")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$139, DW_AT_name("Date")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("_Date")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$140, DW_AT_name("reserved1")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$141, DW_AT_name("StartCluster")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("_StartCluster")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$142, DW_AT_name("Size")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("_Size")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$143, DW_AT_name("Cluster")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("_Cluster")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$144, DW_AT_name("WordInCluster")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("_WordInCluster")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$145, DW_AT_name("NextBrokenCluster")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("_NextBrokenCluster")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$146, DW_AT_name("PrevBrokenCluster")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("_PrevBrokenCluster")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$147, DW_AT_name("CurrentDirSector")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("_CurrentDirSector")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$148, DW_AT_name("CurrentDirEntry")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("_CurrentDirEntry")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$149, DW_AT_name("CurrentDirSectorTag")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("_CurrentDirSectorTag")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$150, DW_AT_name("StartDirCluster")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("_StartDirCluster")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$151, DW_AT_name("CurrentByte")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("_CurrentByte")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$152, DW_AT_name("pDrive")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("_pDrive")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("AtaFile")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
$C$DW$T$60	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_address_class(0x17)

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("AtaStateStruct")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x44)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$153, DW_AT_name("BootPhySector")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("_BootPhySector")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$154, DW_AT_name("FatType")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("_FatType")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$155, DW_AT_name("WordsPerLogSector")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("_WordsPerLogSector")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$156, DW_AT_name("LogSectorsPerCluster")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$157, DW_AT_name("RootDirEntries")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("_RootDirEntries")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$158, DW_AT_name("LogSectorsPerFat")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("_LogSectorsPerFat")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$159, DW_AT_name("FirstFatSector")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("_FirstFatSector")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$160, DW_AT_name("RootDirSector")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("_RootDirSector")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$161, DW_AT_name("FirstDataSector")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("_FirstDataSector")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$162, DW_AT_name("TotalSectors")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("_TotalSectors")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$163, DW_AT_name("Data")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("_Data")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$164, DW_AT_name("CurrentWord")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("_CurrentWord")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$165, DW_AT_name("CurrentPhySector")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("_CurrentPhySector")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$166, DW_AT_name("WordsPerCluster")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("_WordsPerCluster")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$167, DW_AT_name("NumberOfFats")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("_NumberOfFats")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$168, DW_AT_name("MFWFlag")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("_MFWFlag")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$169, DW_AT_name("Err_Status")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("_Err_Status")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$170, DW_AT_name("pAtaMediaState")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("_pAtaMediaState")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$171, DW_AT_name("AtaReset")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("_AtaReset")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$172, DW_AT_name("AtaCommandReadyStatusCheck")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$173, DW_AT_name("AtaBusyStatusCheck")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$174, DW_AT_name("AtaGetSerialID")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_AtaGetSerialID")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$175, DW_AT_name("AtaIssueReadCommand")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$176, DW_AT_name("AtaDataReadyStatusCheck")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$177, DW_AT_name("AtaReadNextWord")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_AtaReadNextWord")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$178, DW_AT_name("AtaReadNextWord1")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_AtaReadNextWord1")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$179, DW_AT_name("AtaReadNextNWords")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_AtaReadNextNWords")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$180, DW_AT_name("AtaWriteSector")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_AtaWriteSector")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$181, DW_AT_name("AtaWriteSectorFlush")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$182, DW_AT_name("AtaInitAtaMediaState")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$183, DW_AT_name("AtaFlushFat")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_AtaFlushFat")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$184, DW_AT_name("AtaErrorCallback")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_AtaErrorCallback")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$185, DW_AT_name("AtaFileSystemType")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_AtaFileSystemType")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$186, DW_AT_name("get_mod_time")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_get_mod_time")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$187, DW_AT_name("get_mod_date")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_get_mod_date")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$188, DW_AT_name("get_time")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_get_time")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$189, DW_AT_name("get_date")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_get_date")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$190, DW_AT_name("_AtaWriteBuffer")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("__AtaWriteBuffer")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$191, DW_AT_name("_AtaWriteCurrentPhySector")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$58

$C$DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$52	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
$C$DW$192	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$9)
	.dwendtag $C$DW$T$52

$C$DW$T$53	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
$C$DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("AtaError")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)

$C$DW$T$34	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
$C$DW$193	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$34

$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)

$C$DW$T$43	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
$C$DW$194	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
$C$DW$195	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$3)
$C$DW$196	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
	.dwendtag $C$DW$T$43

$C$DW$T$44	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_address_class(0x20)

$C$DW$T$46	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
$C$DW$197	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$3)
$C$DW$198	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$45)
	.dwendtag $C$DW$T$46

$C$DW$T$47	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_address_class(0x20)

$C$DW$T$48	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
$C$DW$199	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$3)
$C$DW$200	.dwtag  DW_TAG_formal_parameter
