;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 29 23:09:40 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit

	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c",line 101,column 3,is_stmt
        MOV dbl(*SP(#0)), XAR3
        MOV dbl(*SP(#8)), AC0 ; |101| 
        MOV uns(high_byte(*AR3(#20))), AR1 ; |101| 
        AND #0xffff, AR1, AC1 ; |101| 
$C$DW$48	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$48, DW_AT_low_pc(0x00)
	.dwattr $C$DW$48, DW_AT_name("__mpyli")
	.dwattr $C$DW$48, DW_AT_TI_call
        CALL #__mpyli ; |101| 
                                        ; call occurs [#__mpyli] ; |101| 
        SFTL AC0, #-1, AC0 ; |101| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c",line 102,column 1,is_stmt
        AADD #27, SP
	.dwcfi	cfa_offset, 1
$C$DW$49	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$49, DW_AT_low_pc(0x00)
	.dwattr $C$DW$49, DW_AT_TI_return
        RET
                                        ; return occurs

$C$DW$50	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$50, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L14:1:1538287780")
	.dwattr $C$DW$50, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$50, DW_AT_TI_begin_line(0x56)
	.dwattr $C$DW$50, DW_AT_TI_end_line(0x5e)
$C$DW$51	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$51, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$19$B)
	.dwattr $C$DW$51, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$19$E)
$C$DW$52	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$52, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$23$B)
	.dwattr $C$DW$52, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$23$E)

$C$DW$53	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$53, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L15:2:1538287780")
	.dwattr $C$DW$53, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$53, DW_AT_TI_begin_line(0x59)
	.dwattr $C$DW$53, DW_AT_TI_end_line(0x5d)
$C$DW$54	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$54, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$20$B)
	.dwattr $C$DW$54, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$20$E)
$C$DW$55	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$55, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$21$B)
	.dwattr $C$DW$55, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$21$E)
$C$DW$56	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$56, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$22$B)
	.dwattr $C$DW$56, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$22$E)
	.dwendtag $C$DW$53

	.dwendtag $C$DW$50


$C$DW$57	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$57, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L9:1:1538287780")
	.dwattr $C$DW$57, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$57, DW_AT_TI_begin_line(0x4e)
	.dwattr $C$DW$57, DW_AT_TI_end_line(0x53)
$C$DW$58	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$58, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$12$B)
	.dwattr $C$DW$58, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$12$E)
$C$DW$59	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$59, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$16$B)
	.dwattr $C$DW$59, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$16$E)

$C$DW$60	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$60, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L10:2:1538287780")
	.dwattr $C$DW$60, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$60, DW_AT_TI_begin_line(0x51)
	.dwattr $C$DW$60, DW_AT_TI_end_line(0x52)
$C$DW$61	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$61, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$13$B)
	.dwattr $C$DW$61, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$13$E)
$C$DW$62	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$62, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$14$B)
	.dwattr $C$DW$62, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$14$E)
$C$DW$63	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$63, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$15$B)
	.dwattr $C$DW$63, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$15$E)
	.dwendtag $C$DW$60

	.dwendtag $C$DW$57


$C$DW$64	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$64, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\Atadisk.asm:$C$L6:1:1538287780")
	.dwattr $C$DW$64, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$64, DW_AT_TI_begin_line(0x48)
	.dwattr $C$DW$64, DW_AT_TI_end_line(0x4b)
$C$DW$65	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$65, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$7$B)
	.dwattr $C$DW$65, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$7$E)
$C$DW$66	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$66, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$8$B)
	.dwattr $C$DW$66, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$8$E)
$C$DW$67	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$67, DW_AT_low_pc($C$DW$L$_ATA_diskUsed$9$B)
	.dwattr $C$DW$67, DW_AT_high_pc($C$DW$L$_ATA_diskUsed$9$E)
	.dwendtag $C$DW$64

	.dwattr $C$DW$25, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/drv/atafs/src/Atadisk.c")
	.dwattr $C$DW$25, DW_AT_TI_end_line(0x66)
	.dwattr $C$DW$25, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$25

;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	__AtaReadSector
	.global	__AtaCalculatePhySectorAndOffsetOfFatEntry
	.global	__AtaReadFatEntryAtPhySector
	.global	__mpyli
	.global	__divul

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("AtaStateStruct")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x44)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$68, DW_AT_name("BootPhySector")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_BootPhySector")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$69, DW_AT_name("FatType")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("_FatType")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$70, DW_AT_name("WordsPerLogSector")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_WordsPerLogSector")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$71, DW_AT_name("LogSectorsPerCluster")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$72, DW_AT_name("RootDirEntries")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_RootDirEntries")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$73, DW_AT_name("LogSectorsPerFat")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_LogSectorsPerFat")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$74, DW_AT_name("FirstFatSector")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_FirstFatSector")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$75, DW_AT_name("RootDirSector")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_RootDirSector")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$76, DW_AT_name("FirstDataSector")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_FirstDataSector")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$77, DW_AT_name("TotalSectors")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_TotalSectors")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$78, DW_AT_name("Data")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_Data")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$79, DW_AT_name("CurrentWord")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("_CurrentWord")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$80, DW_AT_name("CurrentPhySector")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_CurrentPhySector")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$81, DW_AT_name("WordsPerCluster")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_WordsPerCluster")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$82, DW_AT_name("NumberOfFats")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_NumberOfFats")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$83, DW_AT_name("MFWFlag")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_MFWFlag")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$84, DW_AT_name("Err_Status")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_Err_Status")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$85, DW_AT_name("pAtaMediaState")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("_pAtaMediaState")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$86, DW_AT_name("AtaReset")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_AtaReset")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$87, DW_AT_name("AtaCommandReadyStatusCheck")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$88, DW_AT_name("AtaBusyStatusCheck")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$89, DW_AT_name("AtaGetSerialID")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("_AtaGetSerialID")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$90, DW_AT_name("AtaIssueReadCommand")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$91, DW_AT_name("AtaDataReadyStatusCheck")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$92, DW_AT_name("AtaReadNextWord")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("_AtaReadNextWord")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$93, DW_AT_name("AtaReadNextWord1")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("_AtaReadNextWord1")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$94, DW_AT_name("AtaReadNextNWords")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("_AtaReadNextNWords")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$95, DW_AT_name("AtaWriteSector")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("_AtaWriteSector")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$96, DW_AT_name("AtaWriteSectorFlush")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$97, DW_AT_name("AtaInitAtaMediaState")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$98, DW_AT_name("AtaFlushFat")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("_AtaFlushFat")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$99, DW_AT_name("AtaErrorCallback")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("_AtaErrorCallback")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$100, DW_AT_name("AtaFileSystemType")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("_AtaFileSystemType")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$101, DW_AT_name("get_mod_time")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("_get_mod_time")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$102, DW_AT_name("get_mod_date")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("_get_mod_date")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$103, DW_AT_name("get_time")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("_get_time")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$104, DW_AT_name("get_date")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("_get_date")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$105, DW_AT_name("_AtaWriteBuffer")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("__AtaWriteBuffer")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$106, DW_AT_name("_AtaWriteCurrentPhySector")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$49

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$43	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
$C$DW$107	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$9)
	.dwendtag $C$DW$T$43

$C$DW$T$44	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("AtaError")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)

$C$DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$108	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$25

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)

$C$DW$T$34	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
$C$DW$109	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
$C$DW$110	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$3)
$C$DW$111	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
	.dwendtag $C$DW$T$34

$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)

$C$DW$T$37	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$112	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$3)
$C$DW$113	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
	.dwendtag $C$DW$T$37

$C$DW$T$38	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x20)

$C$DW$T$39	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
$C$DW$114	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$3)
$C$DW$115	.dwtag  DW_TAG_formal_parameter
