;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 29 23:08:59 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit

	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$374	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_PING_PONG_DISABLE"), DW_AT_const_value(0x00)
$C$DW$375	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_PING_PONG_ENABLE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAPingPongMode")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)

$C$DW$T$68	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
$C$DW$376	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
$C$DW$377	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)

$C$DW$T$70	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
$C$DW$378	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
$C$DW$379	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
$C$DW$380	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
$C$DW$381	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
$C$DW$382	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$70

$C$DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)

$C$DW$T$72	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
$C$DW$383	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
$C$DW$384	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
$C$DW$385	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
$C$DW$386	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
$C$DW$387	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
$C$DW$388	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
$C$DW$389	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
$C$DW$390	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
$C$DW$391	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
$C$DW$392	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
$C$DW$393	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
$C$DW$394	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
$C$DW$395	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
$C$DW$396	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
$C$DW$397	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
$C$DW$398	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
$C$DW$399	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
$C$DW$400	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
$C$DW$401	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
$C$DW$402	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
$C$DW$403	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
$C$DW$404	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$72

$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)

$C$DW$T$85	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$405	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$406	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$407	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
$C$DW$408	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$85

$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$409	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
$C$DW$410	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$96

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)

$C$DW$T$103	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
$C$DW$411	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
$C$DW$412	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
$C$DW$413	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$103

$C$DW$T$104	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$414, DW_AT_name("DMACH0SSAL")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_DMACH0SSAL")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$415, DW_AT_name("DMACH0SSAU")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_DMACH0SSAU")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$416, DW_AT_name("DMACH0DSAL")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_DMACH0DSAL")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$417, DW_AT_name("DMACH0DSAU")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_DMACH0DSAU")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$418, DW_AT_name("DMACH0TCR1")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_DMACH0TCR1")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$419, DW_AT_name("DMACH0TCR2")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_DMACH0TCR2")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$420, DW_AT_name("RSVD0")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$421, DW_AT_name("DMACH1SSAL")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_DMACH1SSAL")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$422, DW_AT_name("DMACH1SSAU")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_DMACH1SSAU")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$423, DW_AT_name("DMACH1DSAL")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_DMACH1DSAL")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$424, DW_AT_name("DMACH1DSAU")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMACH1DSAU")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$425, DW_AT_name("DMACH1TCR1")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMACH1TCR1")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$426, DW_AT_name("DMACH1TCR2")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_DMACH1TCR2")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$427, DW_AT_name("RSVD1")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$428, DW_AT_name("DMACH2SSAL")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_DMACH2SSAL")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$429, DW_AT_name("DMACH2SSAU")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_DMACH2SSAU")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$430, DW_AT_name("DMACH2DSAL")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_DMACH2DSAL")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$431, DW_AT_name("DMACH2DSAU")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH2DSAU")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$432, DW_AT_name("DMACH2TCR1")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH2TCR1")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$433, DW_AT_name("DMACH2TCR2")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH2TCR2")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$434, DW_AT_name("RSVD2")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$435, DW_AT_name("DMACH3SSAL")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH3SSAL")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$436, DW_AT_name("DMACH3SSAU")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMACH3SSAU")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$437, DW_AT_name("DMACH3DSAL")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_DMACH3DSAL")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$438, DW_AT_name("DMACH3DSAU")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH3DSAU")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$439, DW_AT_name("DMACH3TCR1")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH3TCR1")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$440, DW_AT_name("DMACH3TCR2")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH3TCR2")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
$C$DW$441	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$23)
$C$DW$442	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$441)
$C$DW$T$24	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$442)
$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x10)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$443, DW_AT_name("dmaRegs")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_dmaRegs")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$444, DW_AT_name("chanNum")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_chanNum")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$445, DW_AT_name("dmaInstNum")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_dmaInstNum")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$446, DW_AT_name("isChanFree")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_isChanFree")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$447, DW_AT_name("chanDir")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$448, DW_AT_name("trigger")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$449, DW_AT_name("trfType")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$450, DW_AT_name("dmaInt")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$451, DW_AT_name("pingPongEnabled")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_pingPongEnabled")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x17)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x75)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$452, DW_AT_name("MMCCTL")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_MMCCTL")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$453, DW_AT_name("RSVD0")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$454, DW_AT_name("MMCCLK")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_MMCCLK")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$455, DW_AT_name("RSVD1")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$456, DW_AT_name("MMCST0")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_MMCST0")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$457, DW_AT_name("RSVD2")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$458, DW_AT_name("MMCST1")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_MMCST1")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$459, DW_AT_name("RSVD3")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$460, DW_AT_name("MMCIM")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_MMCIM")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$461, DW_AT_name("RSVD4")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$462, DW_AT_name("MMCTOR")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_MMCTOR")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$463, DW_AT_name("RSVD5")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$464, DW_AT_name("MMCTOD")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_MMCTOD")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$465, DW_AT_name("RSVD6")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$466, DW_AT_name("MMCBLEN")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_MMCBLEN")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$467, DW_AT_name("RSVD7")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$468, DW_AT_name("MMCNBLK")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_MMCNBLK")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$469, DW_AT_name("RSVD8")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$470, DW_AT_name("MMCNBLC")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_MMCNBLC")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$471, DW_AT_name("RSVD9")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$472, DW_AT_name("MMCDRR1")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_MMCDRR1")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$473, DW_AT_name("MMCDRR2")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_MMCDRR2")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$474, DW_AT_name("RSVD10")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$475, DW_AT_name("MMCDXR1")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_MMCDXR1")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$476, DW_AT_name("MMCDXR2")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_MMCDXR2")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$477, DW_AT_name("RSVD11")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$478, DW_AT_name("MMCCMD1")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_MMCCMD1")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$479, DW_AT_name("MMCCMD2")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_MMCCMD2")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$480, DW_AT_name("RSVD12")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$481, DW_AT_name("MMCARG1")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_MMCARG1")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$482, DW_AT_name("MMCARG2")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_MMCARG2")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$483, DW_AT_name("RSVD13")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$484, DW_AT_name("MMCRSP0")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_MMCRSP0")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$485, DW_AT_name("MMCRSP1")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_MMCRSP1")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$486, DW_AT_name("RSVD14")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$487, DW_AT_name("MMCRSP2")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_MMCRSP2")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$488, DW_AT_name("MMCRSP3")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_MMCRSP3")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$489, DW_AT_name("RSVD15")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$490, DW_AT_name("MMCRSP4")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_MMCRSP4")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$491, DW_AT_name("MMCRSP5")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_MMCRSP5")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$492, DW_AT_name("RSVD16")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$493, DW_AT_name("MMCRSP6")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_MMCRSP6")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$494, DW_AT_name("MMCRSP7")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_MMCRSP7")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$495, DW_AT_name("RSVD17")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$496, DW_AT_name("MMCDRSP")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_MMCDRSP")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$497, DW_AT_name("RSVD18")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$498, DW_AT_name("MMCCIDX")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_MMCCIDX")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$499, DW_AT_name("RSVD19")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$500, DW_AT_name("SDIOCTL")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_SDIOCTL")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$501, DW_AT_name("RSVD20")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$502, DW_AT_name("SDIOST0")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_SDIOST0")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$503, DW_AT_name("RSVD21")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$504, DW_AT_name("SDIOIEN")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_SDIOIEN")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$505, DW_AT_name("RSVD22")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$506, DW_AT_name("SDIOIST")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_SDIOIST")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$507, DW_AT_name("RSVD23")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$508, DW_AT_name("MMCFIFOCTL")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_MMCFIFOCTL")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$45

$C$DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
$C$DW$509	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$77)
$C$DW$510	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$509)
$C$DW$T$78	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$510)
$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x10)
$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x10)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$511, DW_AT_name("mfgId")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_mfgId")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$512, DW_AT_name("oemAppId")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_oemAppId")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$513, DW_AT_name("productName")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_productName")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$514, DW_AT_name("productRev")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_productRev")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$515, DW_AT_name("serialNumber")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_serialNumber")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$516, DW_AT_name("month")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_month")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$517, DW_AT_name("year")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_year")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$518, DW_AT_name("checksum")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_checksum")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$49

$C$DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
$C$DW$T$55	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_address_class(0x17)

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x22)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$519, DW_AT_name("csdStruct")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_csdStruct")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$520, DW_AT_name("mmcProt")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_mmcProt")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$521, DW_AT_name("taac")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_taac")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$522, DW_AT_name("nsac")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_nsac")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$523, DW_AT_name("tranSpeed")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_tranSpeed")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$524, DW_AT_name("ccc")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_ccc")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$525, DW_AT_name("readBlLen")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_readBlLen")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$526, DW_AT_name("readBlPartial")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_readBlPartial")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$527, DW_AT_name("writeBlkMisalign")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_writeBlkMisalign")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$528, DW_AT_name("readBlkMisalign")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_readBlkMisalign")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$529, DW_AT_name("dsrImp")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_dsrImp")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$530, DW_AT_name("cSize")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_cSize")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$531, DW_AT_name("vddRCurrMin")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_vddRCurrMin")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$532, DW_AT_name("vddRCurrMax")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_vddRCurrMax")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$533, DW_AT_name("vddWCurrMin")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_vddWCurrMin")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$534, DW_AT_name("vddWCurrMax")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_vddWCurrMax")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$535, DW_AT_name("cSizeMult")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_cSizeMult")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$536, DW_AT_name("eraseBlkEnable")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_eraseBlkEnable")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$537, DW_AT_name("eraseGrpSize")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_eraseGrpSize")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$538, DW_AT_name("eraseGrpMult")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_eraseGrpMult")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$539, DW_AT_name("wpGrpSize")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_wpGrpSize")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$540, DW_AT_name("wpGrpEnable")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_wpGrpEnable")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$541, DW_AT_name("defaultEcc")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_defaultEcc")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$542, DW_AT_name("r2wFactor")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_r2wFactor")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$543, DW_AT_name("writeBlLen")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_writeBlLen")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$544, DW_AT_name("writeBlPartial")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_writeBlPartial")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$545, DW_AT_name("contProtApp")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_contProtApp")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$546, DW_AT_name("fileFmtGrp")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_fileFmtGrp")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$547, DW_AT_name("copyFlag")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_copyFlag")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$548, DW_AT_name("permWriteProtect")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_permWriteProtect")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$549, DW_AT_name("tmpWriteProtect")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_tmpWriteProtect")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$550, DW_AT_name("fileFmt")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_fileFmt")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$551, DW_AT_name("ecc")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_ecc")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$552, DW_AT_name("crc")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_crc")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$50

$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$T$57	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_address_class(0x17)

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x06)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$553, DW_AT_name("securitySysId")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_securitySysId")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$554, DW_AT_name("securitySysVers")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_securitySysVers")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$555, DW_AT_name("maxLicenses")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_maxLicenses")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$556, DW_AT_name("xStatus")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_xStatus")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$51

$C$DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
$C$DW$T$59	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$59, DW_AT_address_class(0x17)

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x1e)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$557, DW_AT_name("rca")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_rca")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$558, DW_AT_name("ST0")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_ST0")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$559, DW_AT_name("ST1")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_ST1")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$560, DW_AT_name("cardIndex")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_cardIndex")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$561, DW_AT_name("maxXfrRate")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_maxXfrRate")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$562, DW_AT_name("readAccessTime")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_readAccessTime")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$563, DW_AT_name("cardCapacity")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_cardCapacity")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$564, DW_AT_name("blockLength")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_blockLength")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$565, DW_AT_name("totalSectors")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_totalSectors")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$566, DW_AT_name("lastAddrRead")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_lastAddrRead")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$567, DW_AT_name("lastAddrWritten")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_lastAddrWritten")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$568, DW_AT_name("cardType")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_cardType")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$569, DW_AT_name("cid")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_cid")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$570, DW_AT_name("csd")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_csd")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$571, DW_AT_name("xcsd")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_xcsd")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$572, DW_AT_name("sdHcDetected")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_sdHcDetected")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$573, DW_AT_name("cardAtaFsOpen")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_cardAtaFsOpen")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$574, DW_AT_name("cardMscStatus")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_cardMscStatus")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$60

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
$C$DW$T$82	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$82, DW_AT_address_class(0x17)

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$575, DW_AT_name("isr")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_isr")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$65

$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x17)

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$576, DW_AT_name("pingPongMode")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_pingPongMode")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$577, DW_AT_name("autoMode")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_autoMode")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$578, DW_AT_name("burstLen")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_burstLen")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$579, DW_AT_name("trigger")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$580, DW_AT_name("dmaEvt")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_dmaEvt")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$581, DW_AT_name("dmaInt")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$582, DW_AT_name("chanDir")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$583, DW_AT_name("trfType")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$584, DW_AT_name("dataLen")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_dataLen")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$585, DW_AT_name("srcAddr")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_srcAddr")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$586, DW_AT_name("destAddr")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_destAddr")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$74

$C$DW$T$90	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)

$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$587, DW_AT_name("slice127_112")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$588, DW_AT_name("slice111_96")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$589, DW_AT_name("slice95_80")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$590, DW_AT_name("slice79_64")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$591, DW_AT_name("slice63_48")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$592, DW_AT_name("slice47_32")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$593, DW_AT_name("slice31_16")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$594, DW_AT_name("slice15_0")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$75

$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCidStruct")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$595, DW_AT_name("slice127_112")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$596, DW_AT_name("slice111_96")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$597, DW_AT_name("slice95_80")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$598, DW_AT_name("slice79_64")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$599, DW_AT_name("slice63_48")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$600, DW_AT_name("slice47_32")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$601, DW_AT_name("slice31_16")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$602, DW_AT_name("slice15_0")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$76

$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCsdStruct")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)

$C$DW$T$98	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x40)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$603, DW_AT_name("mmcRegs")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_mmcRegs")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$604, DW_AT_name("cardObj")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_cardObj")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$605, DW_AT_name("numCardsActive")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_numCardsActive")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$606, DW_AT_name("callBackTbl")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_callBackTbl")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$607, DW_AT_name("opMode")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$608, DW_AT_name("hDmaWrite")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_hDmaWrite")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$609, DW_AT_name("hDmaRead")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_hDmaRead")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$610, DW_AT_name("dmaWriteCfg")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_dmaWriteCfg")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$611, DW_AT_name("dmaReadCfg")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_dmaReadCfg")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$612, DW_AT_name("dataTransferCallback")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("_dataTransferCallback")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$613, DW_AT_name("isCallbackSet")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_isCallbackSet")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$614, DW_AT_name("cidSliceInfo")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_cidSliceInfo")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$615, DW_AT_name("csdSliceInfo")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_csdSliceInfo")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$616, DW_AT_name("readEndianMode")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_readEndianMode")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$617, DW_AT_name("writeEndianMode")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_writeEndianMode")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$618, DW_AT_name("blockLen")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_blockLen")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$98

$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCControllerObj")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)
$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdHandle")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)

$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x05)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$619, DW_AT_name("pingPongEnable")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_pingPongEnable")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$620, DW_AT_name("autoMode")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_autoMode")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$621, DW_AT_name("burstLen")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_burstLen")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$622, DW_AT_name("dmaInt")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$623, DW_AT_name("chanDir")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$99

$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdDmaConfig")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)

$C$DW$T$102	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x48)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$624, DW_AT_name("EBSR")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$625, DW_AT_name("RSVD0")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$626, DW_AT_name("PCGCR1")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$627, DW_AT_name("PCGCR2")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$628, DW_AT_name("PSRCR")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$629, DW_AT_name("PRCR")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$630, DW_AT_name("RSVD1")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$631, DW_AT_name("TIAFR")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$632, DW_AT_name("RSVD2")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$633, DW_AT_name("ODSCR")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$634, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$635, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$636, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$637, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$638, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$639, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$640, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$641, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$642, DW_AT_name("CCR2")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$643, DW_AT_name("CGCR1")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$644, DW_AT_name("CGICR")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$645, DW_AT_name("CGCR2")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$646, DW_AT_name("CGOCR")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$647, DW_AT_name("CCSSR")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$648, DW_AT_name("RSVD3")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$649, DW_AT_name("ECDR")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$650, DW_AT_name("RSVD4")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$651, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$652, DW_AT_name("RSVD5")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$653, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$654, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$655, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$656, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$657, DW_AT_name("RSVD6")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$658, DW_AT_name("DMAIFR")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$659, DW_AT_name("DMAIER")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$660, DW_AT_name("USBSCR")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$661, DW_AT_name("ESCR")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$662, DW_AT_name("RSVD7")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$663, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$664, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$665, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$666, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$667, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$668, DW_AT_name("RSVD8")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$669, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$670, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$671, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$672, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$673, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$674, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$675, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$676, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$102

$C$DW$T$117	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
$C$DW$677	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$117)
$C$DW$678	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$677)
$C$DW$T$118	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$678)
$C$DW$T$119	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$119, DW_AT_address_class(0x10)
$C$DW$T$120	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$61	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
$C$DW$T$62	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_address_class(0x20)
$C$DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackPtr")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)

$C$DW$T$64	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x18)
$C$DW$679	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$679, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$64

$C$DW$T$121	.dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)

$C$DW$T$91	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
$C$DW$680	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$91

$C$DW$T$92	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_address_class(0x20)
$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCDataTxferCallBackPtr")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)

$C$DW$T$47	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x06)
$C$DW$681	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$681, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$47

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$105	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
$C$DW$T$106	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x17)
