;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 29 23:08:44 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit

	.dwattr $C$DW$152, DW_AT_name("__divul")
	.dwattr $C$DW$152, DW_AT_TI_call
        CALL #__divul ; |536| 
                                        ; call occurs [#__divul] ; |536| 
        MOV AC0, dbl(*SP(#2)) ; |536| 
$C$L21:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c",line 539,column 2,is_stmt
        MOV *SP(#4), AC0 ; |539| 
        SFTL AC0, #2, AC0 ; |539| 
        ADD *SP(#5), AC0, AR1 ; |539| 
        ADD #4, AR1 ; |539| 
        AND #0xffff, AR1, AC1 ; |539| 
        MOV dbl(*SP(#2)), AC0 ; |539| 
$C$DW$153	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$153, DW_AT_low_pc(0x00)
	.dwattr $C$DW$153, DW_AT_name("__mpyli")
	.dwattr $C$DW$153, DW_AT_TI_call
        CALL #__mpyli ; |539| 
                                        ; call occurs [#__mpyli] ; |539| 
        MOV AC0, dbl(*SP(#2)) ; |539| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c",line 541,column 2,is_stmt

        MOV *SP(#1), AR1 ; |541| 
||      MOV #1, AR2

        CMP AR2 != AR1, TC1 ; |541| 
        BCC $C$L22,TC1 ; |541| 
                                        ; branchcc occurs ; |541| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c",line 543,column 3,is_stmt
        MOV *SP(#7), AR1 ; |543| 

        ADD #1, AR1 ; |543| 
||      MOV dbl(*SP(#2)), AC0 ; |543| 

        AND #0xffff, AR1, AC1 ; |543| 
$C$DW$154	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$154, DW_AT_low_pc(0x00)
	.dwattr $C$DW$154, DW_AT_name("__divul")
	.dwattr $C$DW$154, DW_AT_TI_call
        CALL #__divul ; |543| 
                                        ; call occurs [#__divul] ; |543| 
        MOV AC0, dbl(*SP(#2)) ; |543| 
$C$L22:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c",line 547,column 2,is_stmt
        MOV dbl(*SP(#2)), AC0 ; |547| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c",line 548,column 1,is_stmt
        AADD #9, SP
	.dwcfi	cfa_offset, 1
$C$DW$155	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$155, DW_AT_low_pc(0x00)
	.dwattr $C$DW$155, DW_AT_TI_return
        RET
                                        ; return occurs
	.dwattr $C$DW$144, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/uart/CSL_UART_IntExample/csl_uart_intc_example.c")
	.dwattr $C$DW$144, DW_AT_TI_end_line(0x224)
	.dwattr $C$DW$144, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$144

;*******************************************************************************
;* FAR STRINGS                                                                 *
;*******************************************************************************
	.sect	".const:.string"
	.align	2
$C$FSL1:	.string	"UART_init failed error code %d",10,0
	.align	2
$C$FSL2:	.string	"UART_init Successful",10,0
	.align	2
$C$FSL3:	.string	"UART_setup failed error code %d",10,0
	.align	2
$C$FSL4:	.string	"UART_setup Successful",10,0
	.align	2
$C$FSL5:	.string	13,10,10,"UART INTERRUPT TEST!",0
	.align	2
$C$FSL6:	.string	"UART_fputs failed error code %d",10,0
	.align	2
$C$FSL7:	.string	13,10,"TEST READS A CHARACTER FROM HYPERTERMINAL CONTINUOUSL"
	.string	"Y",0
	.align	2
$C$FSL8:	.string	13,10,"ENTER '$' TO END THE TEST",13,10,0
	.align	2
$C$FSL9:	.string	"UART_setCallback Failed",10,0
	.align	2
$C$FSL10:	.string	"UART_eventEnable Failed",10,0
	.align	2
$C$FSL11:	.string	10,"USER ENTERED '$' on HyperTerminal",10,0
	.align	2
$C$FSL12:	.string	"END OF TEST!",10,0
	.align	2
$C$FSL13:	.string	13,10,10,"YOU HAVE ENTERED '$'.",0
	.align	2
$C$FSL14:	.string	13,10,"END OF THE TEST!!",13,10,0
	.align	2
$C$FSL15:	.string	"CSL UART INTERRUPT MODE TEST!",10,10,0
	.align	2
$C$FSL16:	.string	"Test Reads One Character at a time from the HyperTerminal",10
	.string	0
	.align	2
$C$FSL17:	.string	"Enter the Symbol - '$' on the HyperTerminal to Terminate th"
	.string	"e Test",10,10,0
	.align	2
$C$FSL18:	.string	10,"CSL UART INTERRUPT MODE TEST FAILED!!",10,0
	.align	2
$C$FSL19:	.string	10,"CSL UART INTERRUPT MODE TEST COMPLETED!!",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_printf
	.global	_IRQ_plug
	.global	_IRQ_clearAll
	.global	_IRQ_disable
	.global	_IRQ_disableAll
	.global	_IRQ_enable
	.global	_IRQ_setVecs
	.global	_IRQ_globalDisable
	.global	_IRQ_globalEnable
	.global	_UART_init
	.global	_UART_setup
	.global	_UART_eventEnable
	.global	_UART_eventDisable
	.global	_UART_read
	.global	_UART_write
	.global	_UART_fputs
	.global	_UART_getEventId
	.global	_UART_setCallback
	.global	_VECSTART
	.global	__divul
	.global	__mpyli

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$40	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$156	.dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
$C$DW$157	.dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$158	.dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$40

$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$159, DW_AT_name("THR")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("_THR")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$160, DW_AT_name("RSVD0")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$161, DW_AT_name("IER")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("_IER")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$162, DW_AT_name("RSVD1")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$163, DW_AT_name("FCR")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("_FCR")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$164, DW_AT_name("RSVD2")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$165, DW_AT_name("LCR")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("_LCR")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$166, DW_AT_name("RSVD3")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$167, DW_AT_name("MCR")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("_MCR")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$168, DW_AT_name("RSVD4")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$169, DW_AT_name("LSR")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("_LSR")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$170, DW_AT_name("RSVD5")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$171, DW_AT_name("SCR")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("_SCR")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$172, DW_AT_name("RSVD6")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$173, DW_AT_name("DLL")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("_DLL")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$174, DW_AT_name("RSVD7")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$175, DW_AT_name("DLH")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_DLH")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$176, DW_AT_name("RSVD8")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$177, DW_AT_name("PWREMU_MGMT")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_PWREMU_MGMT")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$23

$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$178	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
$C$DW$179	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$178)
$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$179)
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x10)
$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$180, DW_AT_name("EBSR")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$181, DW_AT_name("RSVD0")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$182, DW_AT_name("PCGCR1")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$183, DW_AT_name("PCGCR2")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$184, DW_AT_name("PSRCR")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$185, DW_AT_name("PRCR")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$186, DW_AT_name("RSVD1")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$187, DW_AT_name("TIAFR")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$188, DW_AT_name("RSVD2")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$189, DW_AT_name("ODSCR")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$190, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$191, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$192, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$193, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$194, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$195, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$196, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$197, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$198, DW_AT_name("CCR2")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$199, DW_AT_name("CGCR1")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$200, DW_AT_name("CGICR")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$201, DW_AT_name("CGCR2")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$202, DW_AT_name("CGOCR")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$203, DW_AT_name("CCSSR")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$204, DW_AT_name("RSVD3")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$205, DW_AT_name("ECDR")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$206, DW_AT_name("RSVD4")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$207, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$208, DW_AT_name("RSVD5")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$209, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$210, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$211, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$212, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$213, DW_AT_name("RSVD6")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$214, DW_AT_name("DMAIFR")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$215, DW_AT_name("DMAIER")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$216, DW_AT_name("USBSCR")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$217, DW_AT_name("ESCR")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$218, DW_AT_name("RSVD7")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$219, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$220, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$221, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$222, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$223, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$224, DW_AT_name("RSVD8")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$225, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$226, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$227, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$228, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$229, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$230, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$231, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$232, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$26

$C$DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
$C$DW$233	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$36)
$C$DW$234	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$233)
$C$DW$T$37	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$234)
$C$DW$T$38	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x10)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$235, DW_AT_name("clkInput")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_clkInput")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$236, DW_AT_name("baud")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_baud")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$237, DW_AT_name("wordLength")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_wordLength")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$238, DW_AT_name("stopBits")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_stopBits")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$239, DW_AT_name("parity")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_parity")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$240, DW_AT_name("fifoControl")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_fifoControl")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$241, DW_AT_name("loopBackEnable")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_loopBackEnable")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$242, DW_AT_name("afeEnable")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_afeEnable")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$243, DW_AT_name("rtsEnable")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_rtsEnable")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$28

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartSetup")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x17)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$244, DW_AT_name("lsiAddr")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_lsiAddr")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$245, DW_AT_name("rbiAddr")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_rbiAddr")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$246, DW_AT_name("tbeiAddr")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_tbeiAddr")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$247, DW_AT_name("ctoi")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_ctoi")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$31

$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartIsrAddr")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
$C$DW$T$47	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_address_class(0x17)

$C$DW$T$48	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$48, DW_AT_name("CSL_UartEventType")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$248	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_REG_DATA_INTERRUPT"), DW_AT_const_value(0x00)
$C$DW$249	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_XMITOR_REG_EMPTY_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$250	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_LINE_STATUS_INTERRUPT"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$48

$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartEventType")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("CSL_UartObj")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$251, DW_AT_name("insId")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_insId")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$252, DW_AT_name("uartRegs")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_uartRegs")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$253, DW_AT_name("sysAddr")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_sysAddr")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$254, DW_AT_name("opmode")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_opmode")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$255, DW_AT_name("trigLevel")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_trigLevel")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$256, DW_AT_name("UART_isrDispatchTable")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$43

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x17)
$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$29	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$T$30	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x20)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$257	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$55)
$C$DW$T$78	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$257)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$258	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$258)

$C$DW$T$21	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x03)
$C$DW$259	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$259, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x05)
$C$DW$260	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$260, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$22


$C$DW$T$24	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
$C$DW$261	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$261, DW_AT_upper_bound(0x0d)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
$C$DW$262	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$262, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$25


$C$DW$T$82	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$19)
