TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE    1

    8330              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:40 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

csl_usb_cdc_example.asm                                              PAGE  119

    4699              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    4700              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    4701                      .dwendtag $C$DW$T$115
    4702              
    4703              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    4704                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    4705                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    4706              
    4707              $C$DW$T$121     .dwtag  DW_TAG_enumeration_type
    4708                      .dwattr $C$DW$T$121, DW_AT_byte_size(0x01)
    4709              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    4710              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    4711              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    4712              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    4713              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    4714              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    4715              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    4716              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    4717              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    4718              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    4719              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    4720              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    4721              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    4722              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    4723              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    4724              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    4725                      .dwendtag $C$DW$T$121
    4726              
    4727              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    4728                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    4729                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4730              
    4731              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    4732                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    4733              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    4734              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    4735              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    4736              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    4737              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    4738                      .dwendtag $C$DW$T$123
    4739              
    4740              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    4741                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    4742                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    4743              
    4744              $C$DW$T$136     .dwtag  DW_TAG_enumeration_type
    4745                      .dwattr $C$DW$T$136, DW_AT_byte_size(0x01)
    4746              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DONE"), DW_AT_const_value(0x00)
    4747              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_STALL"), DW_AT_const_value(0x01)
    4748              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_SEND_ACK"), DW_AT_const_value(0x02)
    4749              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_GET_ACK"), DW_AT_const_value(0x03)
    4750              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_IN"), DW_AT_const_value(0x04)
    4751              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_OUT"), DW_AT_const_value(0x05)
    4752                      .dwendtag $C$DW$T$136
    4753              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  120

    4754              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcRequestRet")
    4755                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    4756                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    4757              
    4758              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4759                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
    4760              $C$DW$359       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    4762                      .dwattr $C$DW$359, DW_AT_name("dwBaudRate")
    4763                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_dwBaudRate")
    4764                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4765                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4766              $C$DW$360       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    4768                      .dwattr $C$DW$360, DW_AT_name("wCharFormat")
    4769                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_wCharFormat")
    4770                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4771                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$361       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    4774                      .dwattr $C$DW$361, DW_AT_name("wParityType")
    4775                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_wParityType")
    4776                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4777                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4778              $C$DW$362       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    4780                      .dwattr $C$DW$362, DW_AT_name("wDataBits")
    4781                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_wDataBits")
    4782                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4783                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4784                      .dwendtag $C$DW$T$21
    4785              
    4786              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcLineCoding")
    4787                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$21)
    4788                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4789              
    4790              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4791                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    4792              $C$DW$363       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
    4794                      .dwattr $C$DW$363, DW_AT_name("TXFUNCADDR")
    4795                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_TXFUNCADDR")
    4796                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4797                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$364       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    4800                      .dwattr $C$DW$364, DW_AT_name("TXHUBADDR_TXHUBPORT")
    4801                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    4802                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4803                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$365       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    4806                      .dwattr $C$DW$365, DW_AT_name("RSVD0")
    4807                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RSVD0")
    4808                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  121

    4809                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4810              $C$DW$366       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    4812                      .dwattr $C$DW$366, DW_AT_name("RXFUNCADDR")
    4813                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RXFUNCADDR")
    4814                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4815                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4816              $C$DW$367       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
    4818                      .dwattr $C$DW$367, DW_AT_name("RXHUBADDR_RXHUBPORT")
    4819                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    4820                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4821                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4822              $C$DW$368       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    4824                      .dwattr $C$DW$368, DW_AT_name("RSVD36")
    4825                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RSVD36")
    4826                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4827                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4828                      .dwendtag $C$DW$T$24
    4829              
    4830              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    4831                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$24)
    4832                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4833              
    4834              $C$DW$T$42      .dwtag  DW_TAG_array_type
    4835                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4836                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4837                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x28)
    4838              $C$DW$369       .dwtag  DW_TAG_subrange_type
    4839                      .dwattr $C$DW$369, DW_AT_upper_bound(0x04)
    4840                      .dwendtag $C$DW$T$42
    4841              
    4842              
    4843              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4844                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    4845              $C$DW$370       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$22)
    4847                      .dwattr $C$DW$370, DW_AT_name("TXMAXP")
    4848                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_TXMAXP")
    4849                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4850                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$371       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$22)
    4853                      .dwattr $C$DW$371, DW_AT_name("PERI_TXCSR")
    4854                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_PERI_TXCSR")
    4855                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4856                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$372       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4859                      .dwattr $C$DW$372, DW_AT_name("RSVD0")
    4860                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD0")
    4861                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4862                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$373       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  122

    4864                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    4865                      .dwattr $C$DW$373, DW_AT_name("RXMAXP")
    4866                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RXMAXP")
    4867                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4868                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$374       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$22)
    4871                      .dwattr $C$DW$374, DW_AT_name("PERI_RXCSR")
    4872                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_PERI_RXCSR")
    4873                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4874                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$375       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    4877                      .dwattr $C$DW$375, DW_AT_name("RSVD1")
    4878                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RSVD1")
    4879                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4880                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$376       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$22)
    4883                      .dwattr $C$DW$376, DW_AT_name("RXCOUNT")
    4884                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_RXCOUNT")
    4885                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4886                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$377       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$25)
    4889                      .dwattr $C$DW$377, DW_AT_name("RSVD41")
    4890                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RSVD41")
    4891                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4892                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4893                      .dwendtag $C$DW$T$26
    4894              
    4895              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    4896                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$26)
    4897                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4898              
    4899              $C$DW$T$45      .dwtag  DW_TAG_array_type
    4900                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4901                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4902                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
    4903              $C$DW$378       .dwtag  DW_TAG_subrange_type
    4904                      .dwattr $C$DW$378, DW_AT_upper_bound(0x03)
    4905                      .dwendtag $C$DW$T$45
    4906              
    4907              
    4908              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4909                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x20)
    4910              $C$DW$379       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$22)
    4912                      .dwattr $C$DW$379, DW_AT_name("TXGCR1")
    4913                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_TXGCR1")
    4914                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4915                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4916              $C$DW$380       .dwtag  DW_TAG_member
    4917                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
    4918                      .dwattr $C$DW$380, DW_AT_name("TXGCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  123

    4919                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_TXGCR2")
    4920                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4921                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4922              $C$DW$381       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$27)
    4924                      .dwattr $C$DW$381, DW_AT_name("RSVD0")
    4925                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD0")
    4926                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4927                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4928              $C$DW$382       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
    4930                      .dwattr $C$DW$382, DW_AT_name("RXGCR1")
    4931                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RXGCR1")
    4932                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4933                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4934              $C$DW$383       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$22)
    4936                      .dwattr $C$DW$383, DW_AT_name("RXGCR2")
    4937                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RXGCR2")
    4938                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4939                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4940              $C$DW$384       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4942                      .dwattr $C$DW$384, DW_AT_name("RSVD1")
    4943                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD1")
    4944                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4945                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$385       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$22)
    4948                      .dwattr $C$DW$385, DW_AT_name("RXHPCR1A")
    4949                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_RXHPCR1A")
    4950                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4951                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4952              $C$DW$386       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$22)
    4954                      .dwattr $C$DW$386, DW_AT_name("RXHPCR2A")
    4955                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RXHPCR2A")
    4956                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4957                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4958              $C$DW$387       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4960                      .dwattr $C$DW$387, DW_AT_name("RSVD2")
    4961                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RSVD2")
    4962                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4963                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$388       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$22)
    4966                      .dwattr $C$DW$388, DW_AT_name("RXHPCR1B")
    4967                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_RXHPCR1B")
    4968                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4969                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4970              $C$DW$389       .dwtag  DW_TAG_member
    4971                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$22)
    4972                      .dwattr $C$DW$389, DW_AT_name("RXHPCR2B")
    4973                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RXHPCR2B")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  124

    4974                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4975                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4976              $C$DW$390       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$28)
    4978                      .dwattr $C$DW$390, DW_AT_name("RSVD46")
    4979                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD46")
    4980                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4981                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4982                      .dwendtag $C$DW$T$29
    4983              
    4984              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    4985                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
    4986                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4987              
    4988              $C$DW$T$49      .dwtag  DW_TAG_array_type
    4989                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4990                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4991                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x80)
    4992              $C$DW$391       .dwtag  DW_TAG_subrange_type
    4993                      .dwattr $C$DW$391, DW_AT_upper_bound(0x03)
    4994                      .dwendtag $C$DW$T$49
    4995              
    4996              
    4997              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4998                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    4999              $C$DW$392       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$22)
    5001                      .dwattr $C$DW$392, DW_AT_name("ENTRYLSW")
    5002                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ENTRYLSW")
    5003                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5004                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$393       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$22)
    5007                      .dwattr $C$DW$393, DW_AT_name("ENTRYMSW")
    5008                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_ENTRYMSW")
    5009                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5010                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$394       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    5013                      .dwattr $C$DW$394, DW_AT_name("RSVD49")
    5014                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_RSVD49")
    5015                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5016                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5017                      .dwendtag $C$DW$T$30
    5018              
    5019              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    5020                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$30)
    5021                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5022              
    5023              $C$DW$T$53      .dwtag  DW_TAG_array_type
    5024                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    5025                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    5026                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x100)
    5027              $C$DW$395       .dwtag  DW_TAG_subrange_type
    5028                      .dwattr $C$DW$395, DW_AT_upper_bound(0x3f)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  125

    5029                      .dwendtag $C$DW$T$53
    5030              
    5031              
    5032              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5033                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    5034              $C$DW$396       .dwtag  DW_TAG_member
    5035                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$22)
    5036                      .dwattr $C$DW$396, DW_AT_name("QMEMRBASE1")
    5037                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_QMEMRBASE1")
    5038                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5039                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5040              $C$DW$397       .dwtag  DW_TAG_member
    5041                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$22)
    5042                      .dwattr $C$DW$397, DW_AT_name("QMEMRBASE2")
    5043                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_QMEMRBASE2")
    5044                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5045                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5046              $C$DW$398       .dwtag  DW_TAG_member
    5047                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    5048                      .dwattr $C$DW$398, DW_AT_name("RSVD0")
    5049                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_RSVD0")
    5050                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5051                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5052              $C$DW$399       .dwtag  DW_TAG_member
    5053                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$22)
    5054                      .dwattr $C$DW$399, DW_AT_name("QMEMRCTRL1")
    5055                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    5056                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5057                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5058              $C$DW$400       .dwtag  DW_TAG_member
    5059                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$22)
    5060                      .dwattr $C$DW$400, DW_AT_name("QMEMRCTRL2")
    5061                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    5062                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5063                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5064              $C$DW$401       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
    5066                      .dwattr $C$DW$401, DW_AT_name("RSVD63")
    5067                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RSVD63")
    5068                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5069                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5070                      .dwendtag $C$DW$T$32
    5071              
    5072              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    5073                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$32)
    5074                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5075              
    5076              $C$DW$T$59      .dwtag  DW_TAG_array_type
    5077                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    5078                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    5079                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x100)
    5080              $C$DW$402       .dwtag  DW_TAG_subrange_type
    5081                      .dwattr $C$DW$402, DW_AT_upper_bound(0x0f)
    5082                      .dwendtag $C$DW$T$59
    5083              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  126

    5084              
    5085              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5086                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    5087              $C$DW$403       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$33)
    5089                      .dwattr $C$DW$403, DW_AT_name("RSVD0")
    5090                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_RSVD0")
    5091                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5092                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5093              $C$DW$404       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$22)
    5095                      .dwattr $C$DW$404, DW_AT_name("CTRL1D")
    5096                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_CTRL1D")
    5097                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5098                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5099              $C$DW$405       .dwtag  DW_TAG_member
    5100                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$22)
    5101                      .dwattr $C$DW$405, DW_AT_name("CTRL2D")
    5102                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_CTRL2D")
    5103                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5104                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5105              $C$DW$406       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    5107                      .dwattr $C$DW$406, DW_AT_name("RSVD65")
    5108                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD65")
    5109                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5110                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5111                      .dwendtag $C$DW$T$34
    5112              
    5113              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    5114                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    5115                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    5116              
    5117              $C$DW$T$62      .dwtag  DW_TAG_array_type
    5118                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    5119                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5120                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x400)
    5121              $C$DW$407       .dwtag  DW_TAG_subrange_type
    5122                      .dwattr $C$DW$407, DW_AT_upper_bound(0x3f)
    5123                      .dwendtag $C$DW$T$62
    5124              
    5125              
    5126              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5127                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    5128              $C$DW$408       .dwtag  DW_TAG_member
    5129                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$22)
    5130                      .dwattr $C$DW$408, DW_AT_name("QSTATA")
    5131                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_QSTATA")
    5132                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5133                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5134              $C$DW$409       .dwtag  DW_TAG_member
    5135                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$35)
    5136                      .dwattr $C$DW$409, DW_AT_name("RSVD0")
    5137                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD0")
    5138                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  127

    5139                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5140              $C$DW$410       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$22)
    5142                      .dwattr $C$DW$410, DW_AT_name("QSTAT1B")
    5143                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_QSTAT1B")
    5144                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5145                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5146              $C$DW$411       .dwtag  DW_TAG_member
    5147                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
    5148                      .dwattr $C$DW$411, DW_AT_name("QSTAT2B")
    5149                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_QSTAT2B")
    5150                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5151                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5152              $C$DW$412       .dwtag  DW_TAG_member
    5153                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    5154                      .dwattr $C$DW$412, DW_AT_name("RSVD1")
    5155                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RSVD1")
    5156                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5157                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5158              $C$DW$413       .dwtag  DW_TAG_member
    5159                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
    5160                      .dwattr $C$DW$413, DW_AT_name("QSTAT1C")
    5161                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_QSTAT1C")
    5162                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5163                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5164              $C$DW$414       .dwtag  DW_TAG_member
    5165                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    5166                      .dwattr $C$DW$414, DW_AT_name("RSVD67")
    5167                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_RSVD67")
    5168                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5169                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5170                      .dwendtag $C$DW$T$36
    5171              
    5172              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    5173                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$36)
    5174                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5175              
    5176              $C$DW$T$65      .dwtag  DW_TAG_array_type
    5177                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    5178                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5179                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x400)
    5180              $C$DW$415       .dwtag  DW_TAG_subrange_type
    5181                      .dwattr $C$DW$415, DW_AT_upper_bound(0x3f)
    5182                      .dwendtag $C$DW$T$65
    5183              
    5184              
    5185              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    5186                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x6c00)
    5187              $C$DW$416       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$22)
    5189                      .dwattr $C$DW$416, DW_AT_name("REVID1")
    5190                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_REVID1")
    5191                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5192                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5193              $C$DW$417       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  128

    5194                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$22)
    5195                      .dwattr $C$DW$417, DW_AT_name("REVID2")
    5196                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_REVID2")
    5197                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5198                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5199              $C$DW$418       .dwtag  DW_TAG_member
    5200                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
    5201                      .dwattr $C$DW$418, DW_AT_name("RSVD0")
    5202                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD0")
    5203                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5204                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5205              $C$DW$419       .dwtag  DW_TAG_member
    5206                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$22)
    5207                      .dwattr $C$DW$419, DW_AT_name("CTRLR")
    5208                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_CTRLR")
    5209                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5210                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5211              $C$DW$420       .dwtag  DW_TAG_member
    5212                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$35)
    5213                      .dwattr $C$DW$420, DW_AT_name("RSVD1")
    5214                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_RSVD1")
    5215                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5216                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5217              $C$DW$421       .dwtag  DW_TAG_member
    5218                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$22)
    5219                      .dwattr $C$DW$421, DW_AT_name("STATR")
    5220                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_STATR")
    5221                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5222                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5223              $C$DW$422       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$35)
    5225                      .dwattr $C$DW$422, DW_AT_name("RSVD2")
    5226                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RSVD2")
    5227                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5228                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5229              $C$DW$423       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$22)
    5231                      .dwattr $C$DW$423, DW_AT_name("EMUR")
    5232                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_EMUR")
    5233                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5234                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5235              $C$DW$424       .dwtag  DW_TAG_member
    5236                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$35)
    5237                      .dwattr $C$DW$424, DW_AT_name("RSVD3")
    5238                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_RSVD3")
    5239                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5240                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5241              $C$DW$425       .dwtag  DW_TAG_member
    5242                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$22)
    5243                      .dwattr $C$DW$425, DW_AT_name("MODE1")
    5244                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_MODE1")
    5245                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5246                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5247              $C$DW$426       .dwtag  DW_TAG_member
    5248                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  129

    5249                      .dwattr $C$DW$426, DW_AT_name("MODE2")
    5250                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_MODE2")
    5251                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5252                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5253              $C$DW$427       .dwtag  DW_TAG_member
    5254                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$23)
    5255                      .dwattr $C$DW$427, DW_AT_name("RSVD4")
    5256                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD4")
    5257                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5258                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5259              $C$DW$428       .dwtag  DW_TAG_member
    5260                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$22)
    5261                      .dwattr $C$DW$428, DW_AT_name("AUTOREQ")
    5262                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_AUTOREQ")
    5263                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5264                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5265              $C$DW$429       .dwtag  DW_TAG_member
    5266                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$35)
    5267                      .dwattr $C$DW$429, DW_AT_name("RSVD5")
    5268                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_RSVD5")
    5269                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5270                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5271              $C$DW$430       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$22)
    5273                      .dwattr $C$DW$430, DW_AT_name("SPRFIXTIME1")
    5274                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    5275                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5276                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5277              $C$DW$431       .dwtag  DW_TAG_member
    5278                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$22)
    5279                      .dwattr $C$DW$431, DW_AT_name("SPRFIXTIME2")
    5280                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    5281                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5282                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5283              $C$DW$432       .dwtag  DW_TAG_member
    5284                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    5285                      .dwattr $C$DW$432, DW_AT_name("RSVD6")
    5286                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_RSVD6")
    5287                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5288                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5289              $C$DW$433       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$22)
    5291                      .dwattr $C$DW$433, DW_AT_name("TEARDOWN1")
    5292                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_TEARDOWN1")
    5293                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5294                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5295              $C$DW$434       .dwtag  DW_TAG_member
    5296                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$22)
    5297                      .dwattr $C$DW$434, DW_AT_name("TEARDOWN2")
    5298                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_TEARDOWN2")
    5299                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5300                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5301              $C$DW$435       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$23)
    5303                      .dwattr $C$DW$435, DW_AT_name("RSVD7")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  130

    5304                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_RSVD7")
    5305                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5306                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5307              $C$DW$436       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
    5309                      .dwattr $C$DW$436, DW_AT_name("INTSRCR1")
    5310                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_INTSRCR1")
    5311                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5312                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5313              $C$DW$437       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$22)
    5315                      .dwattr $C$DW$437, DW_AT_name("INTSRCR2")
    5316                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_INTSRCR2")
    5317                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5318                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5319              $C$DW$438       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
    5321                      .dwattr $C$DW$438, DW_AT_name("RSVD8")
    5322                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_RSVD8")
    5323                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5324                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5325              $C$DW$439       .dwtag  DW_TAG_member
    5326                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    5327                      .dwattr $C$DW$439, DW_AT_name("INTSETR1")
    5328                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_INTSETR1")
    5329                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5330                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5331              $C$DW$440       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    5333                      .dwattr $C$DW$440, DW_AT_name("INTSETR2")
    5334                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_INTSETR2")
    5335                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5336                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5337              $C$DW$441       .dwtag  DW_TAG_member
    5338                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$23)
    5339                      .dwattr $C$DW$441, DW_AT_name("RSVD9")
    5340                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD9")
    5341                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5342                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5343              $C$DW$442       .dwtag  DW_TAG_member
    5344                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    5345                      .dwattr $C$DW$442, DW_AT_name("INTCLRR1")
    5346                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_INTCLRR1")
    5347                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5348                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5349              $C$DW$443       .dwtag  DW_TAG_member
    5350                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    5351                      .dwattr $C$DW$443, DW_AT_name("INTCLRR2")
    5352                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_INTCLRR2")
    5353                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5354                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5355              $C$DW$444       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    5357                      .dwattr $C$DW$444, DW_AT_name("RSVD10")
    5358                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD10")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  131

    5359                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5360                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5361              $C$DW$445       .dwtag  DW_TAG_member
    5362                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    5363                      .dwattr $C$DW$445, DW_AT_name("INTMSKR1")
    5364                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_INTMSKR1")
    5365                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5366                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5367              $C$DW$446       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$22)
    5369                      .dwattr $C$DW$446, DW_AT_name("INTMSKR2")
    5370                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_INTMSKR2")
    5371                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5372                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5373              $C$DW$447       .dwtag  DW_TAG_member
    5374                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$23)
    5375                      .dwattr $C$DW$447, DW_AT_name("RSVD11")
    5376                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_RSVD11")
    5377                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5378                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5379              $C$DW$448       .dwtag  DW_TAG_member
    5380                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    5381                      .dwattr $C$DW$448, DW_AT_name("INTMSKSETR1")
    5382                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_INTMSKSETR1")
    5383                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5384                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5385              $C$DW$449       .dwtag  DW_TAG_member
    5386                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$22)
    5387                      .dwattr $C$DW$449, DW_AT_name("INTMSKSETR2")
    5388                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_INTMSKSETR2")
    5389                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    5390                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5391              $C$DW$450       .dwtag  DW_TAG_member
    5392                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    5393                      .dwattr $C$DW$450, DW_AT_name("RSVD12")
    5394                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD12")
    5395                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5396                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5397              $C$DW$451       .dwtag  DW_TAG_member
    5398                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$22)
    5399                      .dwattr $C$DW$451, DW_AT_name("INTMSKCLRR1")
    5400                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    5401                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5402                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5403              $C$DW$452       .dwtag  DW_TAG_member
    5404                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$22)
    5405                      .dwattr $C$DW$452, DW_AT_name("INTMSKCLRR2")
    5406                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    5407                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    5408                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5409              $C$DW$453       .dwtag  DW_TAG_member
    5410                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$23)
    5411                      .dwattr $C$DW$453, DW_AT_name("RSVD13")
    5412                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD13")
    5413                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  132

    5414                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5415              $C$DW$454       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$22)
    5417                      .dwattr $C$DW$454, DW_AT_name("INTMASKEDR1")
    5418                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_INTMASKEDR1")
    5419                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5420                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5421              $C$DW$455       .dwtag  DW_TAG_member
    5422                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$22)
    5423                      .dwattr $C$DW$455, DW_AT_name("INTMASKEDR2")
    5424                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_INTMASKEDR2")
    5425                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5426                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5427              $C$DW$456       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$23)
    5429                      .dwattr $C$DW$456, DW_AT_name("RSVD14")
    5430                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD14")
    5431                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5432                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5433              $C$DW$457       .dwtag  DW_TAG_member
    5434                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$22)
    5435                      .dwattr $C$DW$457, DW_AT_name("EOIR")
    5436                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_EOIR")
    5437                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5438                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5439              $C$DW$458       .dwtag  DW_TAG_member
    5440                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$35)
    5441                      .dwattr $C$DW$458, DW_AT_name("RSVD15")
    5442                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_RSVD15")
    5443                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    5444                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5445              $C$DW$459       .dwtag  DW_TAG_member
    5446                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$22)
    5447                      .dwattr $C$DW$459, DW_AT_name("INTVECTR1")
    5448                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_INTVECTR1")
    5449                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5450                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5451              $C$DW$460       .dwtag  DW_TAG_member
    5452                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
    5453                      .dwattr $C$DW$460, DW_AT_name("INTVECTR2")
    5454                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_INTVECTR2")
    5455                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5456                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5457              $C$DW$461       .dwtag  DW_TAG_member
    5458                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$28)
    5459                      .dwattr $C$DW$461, DW_AT_name("RSVD16")
    5460                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_RSVD16")
    5461                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5462                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5463              $C$DW$462       .dwtag  DW_TAG_member
    5464                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
    5465                      .dwattr $C$DW$462, DW_AT_name("GREP1SZR1")
    5466                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_GREP1SZR1")
    5467                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5468                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  133

    5469              $C$DW$463       .dwtag  DW_TAG_member
    5470                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
    5471                      .dwattr $C$DW$463, DW_AT_name("GREP1SZR2")
    5472                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_GREP1SZR2")
    5473                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    5474                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5475              $C$DW$464       .dwtag  DW_TAG_member
    5476                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
    5477                      .dwattr $C$DW$464, DW_AT_name("RSVD17")
    5478                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_RSVD17")
    5479                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    5480                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5481              $C$DW$465       .dwtag  DW_TAG_member
    5482                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$22)
    5483                      .dwattr $C$DW$465, DW_AT_name("GREP2SZR1")
    5484                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_GREP2SZR1")
    5485                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    5486                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5487              $C$DW$466       .dwtag  DW_TAG_member
    5488                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$22)
    5489                      .dwattr $C$DW$466, DW_AT_name("GREP2SZR2")
    5490                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_GREP2SZR2")
    5491                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    5492                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5493              $C$DW$467       .dwtag  DW_TAG_member
    5494                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
    5495                      .dwattr $C$DW$467, DW_AT_name("RSVD18")
    5496                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD18")
    5497                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5498                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5499              $C$DW$468       .dwtag  DW_TAG_member
    5500                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$22)
    5501                      .dwattr $C$DW$468, DW_AT_name("GREP3SZR1")
    5502                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_GREP3SZR1")
    5503                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5504                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5505              $C$DW$469       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
    5507                      .dwattr $C$DW$469, DW_AT_name("GREP3SZR2")
    5508                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_GREP3SZR2")
    5509                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    5510                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5511              $C$DW$470       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
    5513                      .dwattr $C$DW$470, DW_AT_name("RSVD19")
    5514                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD19")
    5515                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5516                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5517              $C$DW$471       .dwtag  DW_TAG_member
    5518                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$22)
    5519                      .dwattr $C$DW$471, DW_AT_name("GREP4SZR1")
    5520                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_GREP4SZR1")
    5521                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5522                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5523              $C$DW$472       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  134

    5524                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$22)
    5525                      .dwattr $C$DW$472, DW_AT_name("GREP4SZR2")
    5526                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_GREP4SZR2")
    5527                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    5528                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5529              $C$DW$473       .dwtag  DW_TAG_member
    5530                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$37)
    5531                      .dwattr $C$DW$473, DW_AT_name("RSVD20")
    5532                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_RSVD20")
    5533                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5534                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5535              $C$DW$474       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    5537                      .dwattr $C$DW$474, DW_AT_name("FADDR_POWER")
    5538                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_FADDR_POWER")
    5539                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    5540                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5541              $C$DW$475       .dwtag  DW_TAG_member
    5542                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
    5543                      .dwattr $C$DW$475, DW_AT_name("INTRTX")
    5544                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_INTRTX")
    5545                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    5546                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5547              $C$DW$476       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$23)
    5549                      .dwattr $C$DW$476, DW_AT_name("RSVD21")
    5550                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_RSVD21")
    5551                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    5552                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5553              $C$DW$477       .dwtag  DW_TAG_member
    5554                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    5555                      .dwattr $C$DW$477, DW_AT_name("INTRRX")
    5556                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_INTRRX")
    5557                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    5558                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5559              $C$DW$478       .dwtag  DW_TAG_member
    5560                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    5561                      .dwattr $C$DW$478, DW_AT_name("INTRTXE")
    5562                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_INTRTXE")
    5563                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    5564                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5565              $C$DW$479       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$23)
    5567                      .dwattr $C$DW$479, DW_AT_name("RSVD22")
    5568                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSVD22")
    5569                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    5570                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5571              $C$DW$480       .dwtag  DW_TAG_member
    5572                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    5573                      .dwattr $C$DW$480, DW_AT_name("INTRRXE")
    5574                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_INTRRXE")
    5575                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    5576                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5577              $C$DW$481       .dwtag  DW_TAG_member
    5578                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  135

    5579                      .dwattr $C$DW$481, DW_AT_name("INTRUSB_INTRUSBE")
    5580                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    5581                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    5582                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5583              $C$DW$482       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
    5585                      .dwattr $C$DW$482, DW_AT_name("RSVD23")
    5586                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_RSVD23")
    5587                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    5588                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5589              $C$DW$483       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
    5591                      .dwattr $C$DW$483, DW_AT_name("FRAME")
    5592                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_FRAME")
    5593                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    5594                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5595              $C$DW$484       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
    5597                      .dwattr $C$DW$484, DW_AT_name("INDEX_TESTMODE")
    5598                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    5599                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    5600                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5601              $C$DW$485       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$23)
    5603                      .dwattr $C$DW$485, DW_AT_name("RSVD24")
    5604                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_RSVD24")
    5605                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    5606                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5607              $C$DW$486       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
    5609                      .dwattr $C$DW$486, DW_AT_name("TXMAXP_INDX")
    5610                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    5611                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    5612                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5613              $C$DW$487       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
    5615                      .dwattr $C$DW$487, DW_AT_name("PERI_CSR0_INDX")
    5616                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    5617                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    5618                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5619              $C$DW$488       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
    5621                      .dwattr $C$DW$488, DW_AT_name("RSVD25")
    5622                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD25")
    5623                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    5624                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5625              $C$DW$489       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$22)
    5627                      .dwattr $C$DW$489, DW_AT_name("RXMAXP_INDX")
    5628                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    5629                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    5630                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5631              $C$DW$490       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$22)
    5633                      .dwattr $C$DW$490, DW_AT_name("PERI_RXCSR_INDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  136

    5634                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    5635                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    5636                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5637              $C$DW$491       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$23)
    5639                      .dwattr $C$DW$491, DW_AT_name("RSVD26")
    5640                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD26")
    5641                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    5642                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5643              $C$DW$492       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    5645                      .dwattr $C$DW$492, DW_AT_name("COUNT0_INDX")
    5646                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_COUNT0_INDX")
    5647                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    5648                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5649              $C$DW$493       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$38)
    5651                      .dwattr $C$DW$493, DW_AT_name("RSVD27")
    5652                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD27")
    5653                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    5654                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5655              $C$DW$494       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$22)
    5657                      .dwattr $C$DW$494, DW_AT_name("CONFIGDATA_INDX")
    5658                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    5659                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    5660                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5661              $C$DW$495       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$23)
    5663                      .dwattr $C$DW$495, DW_AT_name("RSVD28")
    5664                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_RSVD28")
    5665                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    5666                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5667              $C$DW$496       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    5669                      .dwattr $C$DW$496, DW_AT_name("FIFO0R1")
    5670                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_FIFO0R1")
    5671                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    5672                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5673              $C$DW$497       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
    5675                      .dwattr $C$DW$497, DW_AT_name("FIFO0R2")
    5676                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_FIFO0R2")
    5677                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    5678                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5679              $C$DW$498       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$23)
    5681                      .dwattr $C$DW$498, DW_AT_name("RSVD29")
    5682                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD29")
    5683                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    5684                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5685              $C$DW$499       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$22)
    5687                      .dwattr $C$DW$499, DW_AT_name("FIFO1R1")
    5688                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_FIFO1R1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  137

    5689                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    5690                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5691              $C$DW$500       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$22)
    5693                      .dwattr $C$DW$500, DW_AT_name("FIFO1R2")
    5694                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_FIFO1R2")
    5695                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    5696                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5697              $C$DW$501       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$23)
    5699                      .dwattr $C$DW$501, DW_AT_name("RSVD30")
    5700                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD30")
    5701                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    5702                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5703              $C$DW$502       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$22)
    5705                      .dwattr $C$DW$502, DW_AT_name("FIFO2R1")
    5706                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_FIFO2R1")
    5707                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    5708                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5709              $C$DW$503       .dwtag  DW_TAG_member
    5710                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$22)
    5711                      .dwattr $C$DW$503, DW_AT_name("FIFO2R2")
    5712                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_FIFO2R2")
    5713                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    5714                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5715              $C$DW$504       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$23)
    5717                      .dwattr $C$DW$504, DW_AT_name("RSVD31")
    5718                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD31")
    5719                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    5720                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5721              $C$DW$505       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$22)
    5723                      .dwattr $C$DW$505, DW_AT_name("FIFO3R1")
    5724                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_FIFO3R1")
    5725                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    5726                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5727              $C$DW$506       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
    5729                      .dwattr $C$DW$506, DW_AT_name("FIFO3R2")
    5730                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_FIFO3R2")
    5731                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    5732                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5733              $C$DW$507       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$23)
    5735                      .dwattr $C$DW$507, DW_AT_name("RSVD32")
    5736                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD32")
    5737                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    5738                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5739              $C$DW$508       .dwtag  DW_TAG_member
    5740                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$22)
    5741                      .dwattr $C$DW$508, DW_AT_name("FIFO4R1")
    5742                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_FIFO4R1")
    5743                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  138

    5744                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5745              $C$DW$509       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$22)
    5747                      .dwattr $C$DW$509, DW_AT_name("FIFO4R2")
    5748                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_FIFO4R2")
    5749                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    5750                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5751              $C$DW$510       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$39)
    5753                      .dwattr $C$DW$510, DW_AT_name("RSVD33")
    5754                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD33")
    5755                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    5756                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5757              $C$DW$511       .dwtag  DW_TAG_member
    5758                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$22)
    5759                      .dwattr $C$DW$511, DW_AT_name("DEVCTL")
    5760                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_DEVCTL")
    5761                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    5762                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5763              $C$DW$512       .dwtag  DW_TAG_member
    5764                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$22)
    5765                      .dwattr $C$DW$512, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    5766                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    5767                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    5768                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5769              $C$DW$513       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$23)
    5771                      .dwattr $C$DW$513, DW_AT_name("RSVD34")
    5772                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_RSVD34")
    5773                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    5774                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5775              $C$DW$514       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$22)
    5777                      .dwattr $C$DW$514, DW_AT_name("TXFIFOADDR")
    5778                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_TXFIFOADDR")
    5779                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    5780                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5781              $C$DW$515       .dwtag  DW_TAG_member
    5782                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
    5783                      .dwattr $C$DW$515, DW_AT_name("RXFIFOADDR")
    5784                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_RXFIFOADDR")
    5785                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    5786                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5787              $C$DW$516       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$27)
    5789                      .dwattr $C$DW$516, DW_AT_name("RSVD35")
    5790                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD35")
    5791                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    5792                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5793              $C$DW$517       .dwtag  DW_TAG_member
    5794                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
    5795                      .dwattr $C$DW$517, DW_AT_name("HWVERS")
    5796                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_HWVERS")
    5797                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    5798                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  139

    5799              $C$DW$518       .dwtag  DW_TAG_member
    5800                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$40)
    5801                      .dwattr $C$DW$518, DW_AT_name("RSVD37")
    5802                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_RSVD37")
    5803                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    5804                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5805              $C$DW$519       .dwtag  DW_TAG_member
    5806                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$42)
    5807                      .dwattr $C$DW$519, DW_AT_name("EPTRG")
    5808                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_EPTRG")
    5809                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    5810                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5811              $C$DW$520       .dwtag  DW_TAG_member
    5812                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$43)
    5813                      .dwattr $C$DW$520, DW_AT_name("RSVD38")
    5814                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_RSVD38")
    5815                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    5816                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5817              $C$DW$521       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    5819                      .dwattr $C$DW$521, DW_AT_name("PERI_CSR0")
    5820                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_PERI_CSR0")
    5821                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    5822                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5823              $C$DW$522       .dwtag  DW_TAG_member
    5824                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$27)
    5825                      .dwattr $C$DW$522, DW_AT_name("RSVD39")
    5826                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD39")
    5827                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    5828                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5829              $C$DW$523       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$22)
    5831                      .dwattr $C$DW$523, DW_AT_name("COUNT0")
    5832                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_COUNT0")
    5833                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    5834                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5835              $C$DW$524       .dwtag  DW_TAG_member
    5836                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$38)
    5837                      .dwattr $C$DW$524, DW_AT_name("RSVD40")
    5838                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_RSVD40")
    5839                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    5840                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5841              $C$DW$525       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$22)
    5843                      .dwattr $C$DW$525, DW_AT_name("CONFIGDATA")
    5844                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_CONFIGDATA")
    5845                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    5846                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5847              $C$DW$526       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$23)
    5849                      .dwattr $C$DW$526, DW_AT_name("RSVD42")
    5850                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_RSVD42")
    5851                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    5852                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5853              $C$DW$527       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  140

    5854                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$45)
    5855                      .dwattr $C$DW$527, DW_AT_name("EPCSR")
    5856                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_EPCSR")
    5857                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    5858                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5859              $C$DW$528       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$46)
    5861                      .dwattr $C$DW$528, DW_AT_name("RSVD43")
    5862                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_RSVD43")
    5863                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    5864                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5865              $C$DW$529       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
    5867                      .dwattr $C$DW$529, DW_AT_name("DMAREVID1")
    5868                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_DMAREVID1")
    5869                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    5870                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5871              $C$DW$530       .dwtag  DW_TAG_member
    5872                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
    5873                      .dwattr $C$DW$530, DW_AT_name("DMAREVID2")
    5874                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_DMAREVID2")
    5875                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    5876                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5877              $C$DW$531       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
    5879                      .dwattr $C$DW$531, DW_AT_name("RSVD44")
    5880                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_RSVD44")
    5881                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    5882                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5883              $C$DW$532       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    5885                      .dwattr $C$DW$532, DW_AT_name("TDFDQ")
    5886                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_TDFDQ")
    5887                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    5888                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5889              $C$DW$533       .dwtag  DW_TAG_member
    5890                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$35)
    5891                      .dwattr $C$DW$533, DW_AT_name("RSVD45")
    5892                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD45")
    5893                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    5894                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5895              $C$DW$534       .dwtag  DW_TAG_member
    5896                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$22)
    5897                      .dwattr $C$DW$534, DW_AT_name("DMAEMU")
    5898                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_DMAEMU")
    5899                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    5900                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5901              $C$DW$535       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$47)
    5903                      .dwattr $C$DW$535, DW_AT_name("RSVD47")
    5904                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_RSVD47")
    5905                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    5906                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5907              $C$DW$536       .dwtag  DW_TAG_member
    5908                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$49)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_cdc_example.asm                                              PAGE  141

    5909                      .dwattr $C$DW$536, DW_AT_name("CHANNEL")
    5910                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_CHANNEL")
    5911                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    5912                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
