TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE    1

    7624              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:53 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    5511              $C$DW$448       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
    5512              $C$DW$449       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
    5513              $C$DW$450       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    5514                      .dwendtag $C$DW$T$74
    5515              
    5516              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    5517                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    5518                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5519              
    5520              $C$DW$T$76      .dwtag  DW_TAG_enumeration_type
    5521                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
    5522              $C$DW$451       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    5523              $C$DW$452       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    5524              $C$DW$453       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
    5525              $C$DW$454       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    5526              $C$DW$455       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    5527                      .dwendtag $C$DW$T$76
    5528              
    5529              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    5530                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    5531                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    5532              
    5533              $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    5534                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
    5535              $C$DW$456       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    5536              $C$DW$457       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    5537              $C$DW$458       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
    5538                      .dwendtag $C$DW$T$78
    5539              
    5540              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    5541                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    5542                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    5543              
    5544              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  155

    5545                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    5546              $C$DW$459       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    5547              $C$DW$460       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    5548              $C$DW$461       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    5549                      .dwendtag $C$DW$T$80
    5550              
    5551              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    5552                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    5553                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    5554              
    5555              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    5556                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    5557              $C$DW$462       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    5558              $C$DW$463       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    5559              $C$DW$464       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    5560              $C$DW$465       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    5561                      .dwendtag $C$DW$T$82
    5562              
    5563              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    5564                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    5565                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    5566              
    5567              $C$DW$T$84      .dwtag  DW_TAG_enumeration_type
    5568                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x01)
    5569              $C$DW$466       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    5570              $C$DW$467       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    5571              $C$DW$468       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    5572              $C$DW$469       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    5573                      .dwendtag $C$DW$T$84
    5574              
    5575              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    5576                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    5577                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    5578              
    5579              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5580                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    5581              $C$DW$470       .dwtag  DW_TAG_member
    5582                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    5583                      .dwattr $C$DW$470, DW_AT_name("REV")
    5584                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_REV")
    5585                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5586                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5587              $C$DW$471       .dwtag  DW_TAG_member
    5588                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    5589                      .dwattr $C$DW$471, DW_AT_name("STATUS")
    5590                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_STATUS")
    5591                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5592                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5593              $C$DW$472       .dwtag  DW_TAG_member
    5594                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$21)
    5595                      .dwattr $C$DW$472, DW_AT_name("RSVD0")
    5596                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_RSVD0")
    5597                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5598                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5599              $C$DW$473       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  156

    5600                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    5601                      .dwattr $C$DW$473, DW_AT_name("AWCCR1")
    5602                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_AWCCR1")
    5603                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5604                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5605              $C$DW$474       .dwtag  DW_TAG_member
    5606                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    5607                      .dwattr $C$DW$474, DW_AT_name("AWCCR2")
    5608                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_AWCCR2")
    5609                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5610                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5611              $C$DW$475       .dwtag  DW_TAG_member
    5612                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$21)
    5613                      .dwattr $C$DW$475, DW_AT_name("RSVD1")
    5614                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD1")
    5615                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5616                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5617              $C$DW$476       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    5619                      .dwattr $C$DW$476, DW_AT_name("SDCR1")
    5620                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_SDCR1")
    5621                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5622                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5623              $C$DW$477       .dwtag  DW_TAG_member
    5624                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    5625                      .dwattr $C$DW$477, DW_AT_name("SDCR2")
    5626                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SDCR2")
    5627                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5628                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5629              $C$DW$478       .dwtag  DW_TAG_member
    5630                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$21)
    5631                      .dwattr $C$DW$478, DW_AT_name("RSVD2")
    5632                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_RSVD2")
    5633                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5634                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5635              $C$DW$479       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    5637                      .dwattr $C$DW$479, DW_AT_name("SDRCR")
    5638                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_SDRCR")
    5639                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5640                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5641              $C$DW$480       .dwtag  DW_TAG_member
    5642                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    5643                      .dwattr $C$DW$480, DW_AT_name("RSVD3")
    5644                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_RSVD3")
    5645                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5646                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5647              $C$DW$481       .dwtag  DW_TAG_member
    5648                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    5649                      .dwattr $C$DW$481, DW_AT_name("ACS2CR1")
    5650                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_ACS2CR1")
    5651                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5652                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5653              $C$DW$482       .dwtag  DW_TAG_member
    5654                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  157

    5655                      .dwattr $C$DW$482, DW_AT_name("ACS2CR2")
    5656                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_ACS2CR2")
    5657                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5658                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5659              $C$DW$483       .dwtag  DW_TAG_member
    5660                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$21)
    5661                      .dwattr $C$DW$483, DW_AT_name("RSVD4")
    5662                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD4")
    5663                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5664                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5665              $C$DW$484       .dwtag  DW_TAG_member
    5666                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    5667                      .dwattr $C$DW$484, DW_AT_name("ACS3CR1")
    5668                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_ACS3CR1")
    5669                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5670                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5671              $C$DW$485       .dwtag  DW_TAG_member
    5672                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    5673                      .dwattr $C$DW$485, DW_AT_name("ACS3CR2")
    5674                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_ACS3CR2")
    5675                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5676                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5677              $C$DW$486       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$21)
    5679                      .dwattr $C$DW$486, DW_AT_name("RSVD5")
    5680                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_RSVD5")
    5681                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5682                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5683              $C$DW$487       .dwtag  DW_TAG_member
    5684                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    5685                      .dwattr $C$DW$487, DW_AT_name("ACS4CR1")
    5686                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_ACS4CR1")
    5687                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5688                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5689              $C$DW$488       .dwtag  DW_TAG_member
    5690                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
    5691                      .dwattr $C$DW$488, DW_AT_name("ACS4CR2")
    5692                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_ACS4CR2")
    5693                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5694                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5695              $C$DW$489       .dwtag  DW_TAG_member
    5696                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$21)
    5697                      .dwattr $C$DW$489, DW_AT_name("RSVD6")
    5698                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD6")
    5699                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5700                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5701              $C$DW$490       .dwtag  DW_TAG_member
    5702                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    5703                      .dwattr $C$DW$490, DW_AT_name("ACS5CR1")
    5704                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_ACS5CR1")
    5705                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5706                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5707              $C$DW$491       .dwtag  DW_TAG_member
    5708                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
    5709                      .dwattr $C$DW$491, DW_AT_name("ACS5CR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  158

    5710                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_ACS5CR2")
    5711                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5712                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5713              $C$DW$492       .dwtag  DW_TAG_member
    5714                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$21)
    5715                      .dwattr $C$DW$492, DW_AT_name("RSVD7")
    5716                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_RSVD7")
    5717                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5718                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5719              $C$DW$493       .dwtag  DW_TAG_member
    5720                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    5721                      .dwattr $C$DW$493, DW_AT_name("SDTIMR1")
    5722                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_SDTIMR1")
    5723                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5724                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5725              $C$DW$494       .dwtag  DW_TAG_member
    5726                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$23)
    5727                      .dwattr $C$DW$494, DW_AT_name("RSVD8")
    5728                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD8")
    5729                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5730                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5731              $C$DW$495       .dwtag  DW_TAG_member
    5732                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    5733                      .dwattr $C$DW$495, DW_AT_name("SDSRETR")
    5734                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_SDSRETR")
    5735                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5736                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5737              $C$DW$496       .dwtag  DW_TAG_member
    5738                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    5739                      .dwattr $C$DW$496, DW_AT_name("RSVD9")
    5740                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD9")
    5741                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    5742                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5743              $C$DW$497       .dwtag  DW_TAG_member
    5744                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    5745                      .dwattr $C$DW$497, DW_AT_name("EIRR")
    5746                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_EIRR")
    5747                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5748                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5749              $C$DW$498       .dwtag  DW_TAG_member
    5750                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$22)
    5751                      .dwattr $C$DW$498, DW_AT_name("RSVD10")
    5752                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD10")
    5753                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5754                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5755              $C$DW$499       .dwtag  DW_TAG_member
    5756                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    5757                      .dwattr $C$DW$499, DW_AT_name("EIMR")
    5758                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_EIMR")
    5759                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5760                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5761              $C$DW$500       .dwtag  DW_TAG_member
    5762                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$22)
    5763                      .dwattr $C$DW$500, DW_AT_name("RSVD11")
    5764                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_RSVD11")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  159

    5765                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    5766                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5767              $C$DW$501       .dwtag  DW_TAG_member
    5768                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
    5769                      .dwattr $C$DW$501, DW_AT_name("EIMSR")
    5770                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_EIMSR")
    5771                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5772                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5773              $C$DW$502       .dwtag  DW_TAG_member
    5774                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$22)
    5775                      .dwattr $C$DW$502, DW_AT_name("RSVD12")
    5776                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_RSVD12")
    5777                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    5778                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5779              $C$DW$503       .dwtag  DW_TAG_member
    5780                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    5781                      .dwattr $C$DW$503, DW_AT_name("EIMCR")
    5782                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_EIMCR")
    5783                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5784                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5785              $C$DW$504       .dwtag  DW_TAG_member
    5786                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$24)
    5787                      .dwattr $C$DW$504, DW_AT_name("RSVD13")
    5788                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD13")
    5789                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    5790                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5791              $C$DW$505       .dwtag  DW_TAG_member
    5792                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
    5793                      .dwattr $C$DW$505, DW_AT_name("NANDFCR")
    5794                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_NANDFCR")
    5795                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5796                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5797              $C$DW$506       .dwtag  DW_TAG_member
    5798                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
    5799                      .dwattr $C$DW$506, DW_AT_name("RSVD14")
    5800                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_RSVD14")
    5801                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    5802                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5803              $C$DW$507       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
    5805                      .dwattr $C$DW$507, DW_AT_name("NANDFSR1")
    5806                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_NANDFSR1")
    5807                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    5808                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5809              $C$DW$508       .dwtag  DW_TAG_member
    5810                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
    5811                      .dwattr $C$DW$508, DW_AT_name("NANDFSR2")
    5812                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_NANDFSR2")
    5813                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    5814                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5815              $C$DW$509       .dwtag  DW_TAG_member
    5816                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$21)
    5817                      .dwattr $C$DW$509, DW_AT_name("RSVD15")
    5818                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_RSVD15")
    5819                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  160

    5820                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5821              $C$DW$510       .dwtag  DW_TAG_member
    5822                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$20)
    5823                      .dwattr $C$DW$510, DW_AT_name("PAGEMODCTRL1")
    5824                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    5825                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5826                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5827              $C$DW$511       .dwtag  DW_TAG_member
    5828                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    5829                      .dwattr $C$DW$511, DW_AT_name("PAGEMODCTRL2")
    5830                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    5831                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    5832                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5833              $C$DW$512       .dwtag  DW_TAG_member
    5834                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$25)
    5835                      .dwattr $C$DW$512, DW_AT_name("RSVD16")
    5836                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_RSVD16")
    5837                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    5838                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5839              $C$DW$513       .dwtag  DW_TAG_member
    5840                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
    5841                      .dwattr $C$DW$513, DW_AT_name("NCS2ECC1")
    5842                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_NCS2ECC1")
    5843                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    5844                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5845              $C$DW$514       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
    5847                      .dwattr $C$DW$514, DW_AT_name("NCS2ECC2")
    5848                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_NCS2ECC2")
    5849                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    5850                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5851              $C$DW$515       .dwtag  DW_TAG_member
    5852                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$21)
    5853                      .dwattr $C$DW$515, DW_AT_name("RSVD17")
    5854                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_RSVD17")
    5855                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    5856                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5857              $C$DW$516       .dwtag  DW_TAG_member
    5858                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
    5859                      .dwattr $C$DW$516, DW_AT_name("NCS3ECC1")
    5860                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_NCS3ECC1")
    5861                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    5862                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5863              $C$DW$517       .dwtag  DW_TAG_member
    5864                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
    5865                      .dwattr $C$DW$517, DW_AT_name("NCS3ECC2")
    5866                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_NCS3ECC2")
    5867                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
    5868                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5869              $C$DW$518       .dwtag  DW_TAG_member
    5870                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$21)
    5871                      .dwattr $C$DW$518, DW_AT_name("RSVD18")
    5872                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_RSVD18")
    5873                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5874                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  161

    5875              $C$DW$519       .dwtag  DW_TAG_member
    5876                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$20)
    5877                      .dwattr $C$DW$519, DW_AT_name("NCS4ECC1")
    5878                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_NCS4ECC1")
    5879                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5880                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5881              $C$DW$520       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    5883                      .dwattr $C$DW$520, DW_AT_name("NCS4ECC2")
    5884                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_NCS4ECC2")
    5885                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    5886                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5887              $C$DW$521       .dwtag  DW_TAG_member
    5888                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$21)
    5889                      .dwattr $C$DW$521, DW_AT_name("RSVD19")
    5890                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_RSVD19")
    5891                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5892                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5893              $C$DW$522       .dwtag  DW_TAG_member
    5894                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$20)
    5895                      .dwattr $C$DW$522, DW_AT_name("NCS5ECC1")
    5896                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_NCS5ECC1")
    5897                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5898                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5899              $C$DW$523       .dwtag  DW_TAG_member
    5900                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    5901                      .dwattr $C$DW$523, DW_AT_name("NCS5ECC2")
    5902                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_NCS5ECC2")
    5903                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    5904                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5905              $C$DW$524       .dwtag  DW_TAG_member
    5906                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$26)
    5907                      .dwattr $C$DW$524, DW_AT_name("RSVD20")
    5908                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_RSVD20")
    5909                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    5910                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5911              $C$DW$525       .dwtag  DW_TAG_member
    5912                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$20)
    5913                      .dwattr $C$DW$525, DW_AT_name("NAND4BITECCLOAD")
    5914                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    5915                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5916                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5917              $C$DW$526       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$22)
    5919                      .dwattr $C$DW$526, DW_AT_name("RSVD21")
    5920                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_RSVD21")
    5921                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    5922                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5923              $C$DW$527       .dwtag  DW_TAG_member
    5924                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$20)
    5925                      .dwattr $C$DW$527, DW_AT_name("NAND4BITECC1")
    5926                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_NAND4BITECC1")
    5927                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5928                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5929              $C$DW$528       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  162

    5930                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
    5931                      .dwattr $C$DW$528, DW_AT_name("NAND4BITECC2")
    5932                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_NAND4BITECC2")
    5933                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    5934                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5935              $C$DW$529       .dwtag  DW_TAG_member
    5936                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$21)
    5937                      .dwattr $C$DW$529, DW_AT_name("RSVD22")
    5938                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_RSVD22")
    5939                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    5940                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5941              $C$DW$530       .dwtag  DW_TAG_member
    5942                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$20)
    5943                      .dwattr $C$DW$530, DW_AT_name("NAND4BITECC3")
    5944                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_NAND4BITECC3")
    5945                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5946                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5947              $C$DW$531       .dwtag  DW_TAG_member
    5948                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    5949                      .dwattr $C$DW$531, DW_AT_name("NAND4BITECC4")
    5950                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_NAND4BITECC4")
    5951                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    5952                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5953              $C$DW$532       .dwtag  DW_TAG_member
    5954                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$21)
    5955                      .dwattr $C$DW$532, DW_AT_name("RSVD23")
    5956                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_RSVD23")
    5957                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5958                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5959              $C$DW$533       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$20)
    5961                      .dwattr $C$DW$533, DW_AT_name("NAND4BITECC5")
    5962                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_NAND4BITECC5")
    5963                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5964                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5965              $C$DW$534       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
    5967                      .dwattr $C$DW$534, DW_AT_name("NAND4BITECC6")
    5968                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_NAND4BITECC6")
    5969                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    5970                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5971              $C$DW$535       .dwtag  DW_TAG_member
    5972                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$21)
    5973                      .dwattr $C$DW$535, DW_AT_name("RSVD24")
    5974                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_RSVD24")
    5975                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5976                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5977              $C$DW$536       .dwtag  DW_TAG_member
    5978                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$20)
    5979                      .dwattr $C$DW$536, DW_AT_name("NAND4BITECC7")
    5980                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_NAND4BITECC7")
    5981                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5982                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5983              $C$DW$537       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  163

    5985                      .dwattr $C$DW$537, DW_AT_name("NAND4BITECC8")
    5986                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_NAND4BITECC8")
    5987                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    5988                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5989              $C$DW$538       .dwtag  DW_TAG_member
    5990                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$21)
    5991                      .dwattr $C$DW$538, DW_AT_name("RSVD25")
    5992                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_RSVD25")
    5993                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5994                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5995              $C$DW$539       .dwtag  DW_TAG_member
    5996                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$20)
    5997                      .dwattr $C$DW$539, DW_AT_name("NANDERRADD1")
    5998                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_NANDERRADD1")
    5999                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6000                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6001              $C$DW$540       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
    6003                      .dwattr $C$DW$540, DW_AT_name("NANDERRADD2")
    6004                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_NANDERRADD2")
    6005                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    6006                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6007              $C$DW$541       .dwtag  DW_TAG_member
    6008                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$21)
    6009                      .dwattr $C$DW$541, DW_AT_name("RSVD26")
    6010                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_RSVD26")
    6011                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6012                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6013              $C$DW$542       .dwtag  DW_TAG_member
    6014                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$20)
    6015                      .dwattr $C$DW$542, DW_AT_name("NANDERRADD3")
    6016                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_NANDERRADD3")
    6017                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6018                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6019              $C$DW$543       .dwtag  DW_TAG_member
    6020                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
    6021                      .dwattr $C$DW$543, DW_AT_name("NANDERRADD4")
    6022                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_NANDERRADD4")
    6023                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    6024                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6025              $C$DW$544       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$21)
    6027                      .dwattr $C$DW$544, DW_AT_name("RSVD27")
    6028                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_RSVD27")
    6029                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6030                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6031              $C$DW$545       .dwtag  DW_TAG_member
    6032                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
    6033                      .dwattr $C$DW$545, DW_AT_name("NANDERRVAL1")
    6034                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_NANDERRVAL1")
    6035                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6036                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6037              $C$DW$546       .dwtag  DW_TAG_member
    6038                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$20)
    6039                      .dwattr $C$DW$546, DW_AT_name("NANDERRVAL2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  164

    6040                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_NANDERRVAL2")
    6041                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    6042                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6043              $C$DW$547       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$21)
    6045                      .dwattr $C$DW$547, DW_AT_name("RSVD28")
    6046                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_RSVD28")
    6047                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6048                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6049              $C$DW$548       .dwtag  DW_TAG_member
    6050                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$20)
    6051                      .dwattr $C$DW$548, DW_AT_name("NANDERRVAL3")
    6052                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_NANDERRVAL3")
    6053                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6054                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6055              $C$DW$549       .dwtag  DW_TAG_member
    6056                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
    6057                      .dwattr $C$DW$549, DW_AT_name("NANDERRVAL4")
    6058                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_NANDERRVAL4")
    6059                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    6060                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6061                      .dwendtag $C$DW$T$27
    6062              
    6063              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    6064                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$27)
    6065                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    6066              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    6067                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$91)
    6068              $C$DW$551       .dwtag  DW_TAG_TI_ioport_type
    6069                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$550)
    6070              $C$DW$T$92      .dwtag  DW_TAG_volatile_type
    6071                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$551)
    6072              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    6073                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    6074                      .dwattr $C$DW$T$93, DW_AT_address_class(0x10)
    6075              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    6076                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    6077                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    6078              
    6079              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6080                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    6081              $C$DW$552       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$20)
    6083                      .dwattr $C$DW$552, DW_AT_name("EBSR")
    6084                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_EBSR")
    6085                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6086                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6087              $C$DW$553       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$20)
    6089                      .dwattr $C$DW$553, DW_AT_name("RSVD0")
    6090                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_RSVD0")
    6091                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6092                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6093              $C$DW$554       .dwtag  DW_TAG_member
    6094                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  165

    6095                      .dwattr $C$DW$554, DW_AT_name("PCGCR1")
    6096                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_PCGCR1")
    6097                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6098                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6099              $C$DW$555       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$20)
    6101                      .dwattr $C$DW$555, DW_AT_name("PCGCR2")
    6102                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_PCGCR2")
    6103                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6104                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6105              $C$DW$556       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$20)
    6107                      .dwattr $C$DW$556, DW_AT_name("PSRCR")
    6108                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_PSRCR")
    6109                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6110                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6111              $C$DW$557       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$20)
    6113                      .dwattr $C$DW$557, DW_AT_name("PRCR")
    6114                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_PRCR")
    6115                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6116                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6117              $C$DW$558       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$28)
    6119                      .dwattr $C$DW$558, DW_AT_name("RSVD1")
    6120                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_RSVD1")
    6121                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6122                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6123              $C$DW$559       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$20)
    6125                      .dwattr $C$DW$559, DW_AT_name("TIAFR")
    6126                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_TIAFR")
    6127                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6128                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6129              $C$DW$560       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$20)
    6131                      .dwattr $C$DW$560, DW_AT_name("RSVD2")
    6132                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_RSVD2")
    6133                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6134                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6135              $C$DW$561       .dwtag  DW_TAG_member
    6136                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
    6137                      .dwattr $C$DW$561, DW_AT_name("ODSCR")
    6138                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ODSCR")
    6139                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6140                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6141              $C$DW$562       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$20)
    6143                      .dwattr $C$DW$562, DW_AT_name("PDINHIBR1")
    6144                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_PDINHIBR1")
    6145                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6146                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6147              $C$DW$563       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$20)
    6149                      .dwattr $C$DW$563, DW_AT_name("PDINHIBR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  166

    6150                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_PDINHIBR2")
    6151                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6152                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6153              $C$DW$564       .dwtag  DW_TAG_member
    6154                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$20)
    6155                      .dwattr $C$DW$564, DW_AT_name("PDINHIBR3")
    6156                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_PDINHIBR3")
    6157                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6158                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6159              $C$DW$565       .dwtag  DW_TAG_member
    6160                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
    6161                      .dwattr $C$DW$565, DW_AT_name("DMA0CESR1")
    6162                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_DMA0CESR1")
    6163                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6164                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6165              $C$DW$566       .dwtag  DW_TAG_member
    6166                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    6167                      .dwattr $C$DW$566, DW_AT_name("DMA0CESR2")
    6168                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_DMA0CESR2")
    6169                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6170                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6171              $C$DW$567       .dwtag  DW_TAG_member
    6172                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$20)
    6173                      .dwattr $C$DW$567, DW_AT_name("DMA1CESR1")
    6174                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_DMA1CESR1")
    6175                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6176                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6177              $C$DW$568       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
    6179                      .dwattr $C$DW$568, DW_AT_name("DMA1CESR2")
    6180                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_DMA1CESR2")
    6181                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6182                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6183              $C$DW$569       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
    6185                      .dwattr $C$DW$569, DW_AT_name("SDRAMCCR")
    6186                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_SDRAMCCR")
    6187                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6188                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6189              $C$DW$570       .dwtag  DW_TAG_member
    6190                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$20)
    6191                      .dwattr $C$DW$570, DW_AT_name("CCR2")
    6192                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_CCR2")
    6193                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6194                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6195              $C$DW$571       .dwtag  DW_TAG_member
    6196                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$20)
    6197                      .dwattr $C$DW$571, DW_AT_name("CGCR1")
    6198                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_CGCR1")
    6199                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6200                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6201              $C$DW$572       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$20)
    6203                      .dwattr $C$DW$572, DW_AT_name("CGICR")
    6204                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_CGICR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  167

    6205                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6206                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6207              $C$DW$573       .dwtag  DW_TAG_member
    6208                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$20)
    6209                      .dwattr $C$DW$573, DW_AT_name("CGCR2")
    6210                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_CGCR2")
    6211                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6212                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6213              $C$DW$574       .dwtag  DW_TAG_member
    6214                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$20)
    6215                      .dwattr $C$DW$574, DW_AT_name("CGOCR")
    6216                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_CGOCR")
    6217                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6218                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6219              $C$DW$575       .dwtag  DW_TAG_member
    6220                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    6221                      .dwattr $C$DW$575, DW_AT_name("CCSSR")
    6222                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_CCSSR")
    6223                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6224                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6225              $C$DW$576       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$20)
    6227                      .dwattr $C$DW$576, DW_AT_name("RSVD3")
    6228                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD3")
    6229                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6230                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6231              $C$DW$577       .dwtag  DW_TAG_member
    6232                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
    6233                      .dwattr $C$DW$577, DW_AT_name("ECDR")
    6234                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_ECDR")
    6235                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6236                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6237              $C$DW$578       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    6239                      .dwattr $C$DW$578, DW_AT_name("RSVD4")
    6240                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_RSVD4")
    6241                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6242                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6243              $C$DW$579       .dwtag  DW_TAG_member
    6244                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$20)
    6245                      .dwattr $C$DW$579, DW_AT_name("RAMSLPMDCNTLR1")
    6246                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    6247                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6248                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6249              $C$DW$580       .dwtag  DW_TAG_member
    6250                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    6251                      .dwattr $C$DW$580, DW_AT_name("RSVD5")
    6252                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_RSVD5")
    6253                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6254                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6255              $C$DW$581       .dwtag  DW_TAG_member
    6256                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$20)
    6257                      .dwattr $C$DW$581, DW_AT_name("RAMSLPMDCNTLR2")
    6258                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    6259                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  168

    6260                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6261              $C$DW$582       .dwtag  DW_TAG_member
    6262                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$20)
    6263                      .dwattr $C$DW$582, DW_AT_name("RAMSLPMDCNTLR3")
    6264                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    6265                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6266                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6267              $C$DW$583       .dwtag  DW_TAG_member
    6268                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
    6269                      .dwattr $C$DW$583, DW_AT_name("RAMSLPMDCNTLR4")
    6270                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    6271                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6272                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6273              $C$DW$584       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    6275                      .dwattr $C$DW$584, DW_AT_name("RAMSLPMDCNTLR5")
    6276                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    6277                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6278                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6279              $C$DW$585       .dwtag  DW_TAG_member
    6280                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    6281                      .dwattr $C$DW$585, DW_AT_name("RSVD6")
    6282                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD6")
    6283                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6284                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6285              $C$DW$586       .dwtag  DW_TAG_member
    6286                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    6287                      .dwattr $C$DW$586, DW_AT_name("DMAIFR")
    6288                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_DMAIFR")
    6289                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6290                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6291              $C$DW$587       .dwtag  DW_TAG_member
    6292                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
    6293                      .dwattr $C$DW$587, DW_AT_name("DMAIER")
    6294                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_DMAIER")
    6295                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    6296                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6297              $C$DW$588       .dwtag  DW_TAG_member
    6298                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$20)
    6299                      .dwattr $C$DW$588, DW_AT_name("USBSCR")
    6300                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_USBSCR")
    6301                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6302                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6303              $C$DW$589       .dwtag  DW_TAG_member
    6304                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$20)
    6305                      .dwattr $C$DW$589, DW_AT_name("ESCR")
    6306                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_ESCR")
    6307                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    6308                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6309              $C$DW$590       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$21)
    6311                      .dwattr $C$DW$590, DW_AT_name("RSVD7")
    6312                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_RSVD7")
    6313                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6314                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  169

    6315              $C$DW$591       .dwtag  DW_TAG_member
    6316                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$20)
    6317                      .dwattr $C$DW$591, DW_AT_name("DMA2CESR1")
    6318                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_DMA2CESR1")
    6319                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6320                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6321              $C$DW$592       .dwtag  DW_TAG_member
    6322                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    6323                      .dwattr $C$DW$592, DW_AT_name("DMA2CESR2")
    6324                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_DMA2CESR2")
    6325                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    6326                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6327              $C$DW$593       .dwtag  DW_TAG_member
    6328                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$20)
    6329                      .dwattr $C$DW$593, DW_AT_name("DMA3CESR1")
    6330                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_DMA3CESR1")
    6331                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6332                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6333              $C$DW$594       .dwtag  DW_TAG_member
    6334                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
    6335                      .dwattr $C$DW$594, DW_AT_name("DMA3CESR2")
    6336                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_DMA3CESR2")
    6337                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6338                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6339              $C$DW$595       .dwtag  DW_TAG_member
    6340                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
    6341                      .dwattr $C$DW$595, DW_AT_name("CLKSTOP")
    6342                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_CLKSTOP")
    6343                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6344                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6345              $C$DW$596       .dwtag  DW_TAG_member
    6346                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$29)
    6347                      .dwattr $C$DW$596, DW_AT_name("RSVD8")
    6348                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_RSVD8")
    6349                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    6350                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6351              $C$DW$597       .dwtag  DW_TAG_member
    6352                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$20)
    6353                      .dwattr $C$DW$597, DW_AT_name("DIEIDR0")
    6354                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_DIEIDR0")
    6355                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6356                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6357              $C$DW$598       .dwtag  DW_TAG_member
    6358                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
    6359                      .dwattr $C$DW$598, DW_AT_name("DIEIDR1")
    6360                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_DIEIDR1")
    6361                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6362                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6363              $C$DW$599       .dwtag  DW_TAG_member
    6364                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    6365                      .dwattr $C$DW$599, DW_AT_name("DIEIDR2")
    6366                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_DIEIDR2")
    6367                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6368                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6369              $C$DW$600       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  170

    6370                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$20)
    6371                      .dwattr $C$DW$600, DW_AT_name("DIEIDR3")
    6372                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_DIEIDR3")
    6373                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    6374                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6375              $C$DW$601       .dwtag  DW_TAG_member
    6376                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
    6377                      .dwattr $C$DW$601, DW_AT_name("DIEIDR4")
    6378                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_DIEIDR4")
    6379                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6380                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6381              $C$DW$602       .dwtag  DW_TAG_member
    6382                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$20)
    6383                      .dwattr $C$DW$602, DW_AT_name("DIEIDR5")
    6384                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_DIEIDR5")
    6385                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6386                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6387              $C$DW$603       .dwtag  DW_TAG_member
    6388                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    6389                      .dwattr $C$DW$603, DW_AT_name("DIEIDR6")
    6390                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_DIEIDR6")
    6391                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6392                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6393              $C$DW$604       .dwtag  DW_TAG_member
    6394                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$20)
    6395                      .dwattr $C$DW$604, DW_AT_name("DIEIDR7")
    6396                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_DIEIDR7")
    6397                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    6398                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6399                      .dwendtag $C$DW$T$30
    6400              
    6401              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    6402                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$30)
    6403                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    6404              $C$DW$605       .dwtag  DW_TAG_TI_far_type
    6405                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$95)
    6406              $C$DW$606       .dwtag  DW_TAG_TI_ioport_type
    6407                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$605)
    6408              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
    6409                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$606)
    6410              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    6411                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    6412                      .dwattr $C$DW$T$97, DW_AT_address_class(0x10)
    6413              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    6414                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    6415                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    6416              
    6417              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6418                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x66)
    6419              $C$DW$607       .dwtag  DW_TAG_member
    6420                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
    6421                      .dwattr $C$DW$607, DW_AT_name("DMACH0SSAL")
    6422                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_DMACH0SSAL")
    6423                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6424                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  171

    6425              $C$DW$608       .dwtag  DW_TAG_member
    6426                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$20)
    6427                      .dwattr $C$DW$608, DW_AT_name("DMACH0SSAU")
    6428                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_DMACH0SSAU")
    6429                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6430                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6431              $C$DW$609       .dwtag  DW_TAG_member
    6432                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$20)
    6433                      .dwattr $C$DW$609, DW_AT_name("DMACH0DSAL")
    6434                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_DMACH0DSAL")
    6435                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6436                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6437              $C$DW$610       .dwtag  DW_TAG_member
    6438                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$20)
    6439                      .dwattr $C$DW$610, DW_AT_name("DMACH0DSAU")
    6440                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_DMACH0DSAU")
    6441                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6442                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6443              $C$DW$611       .dwtag  DW_TAG_member
    6444                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$20)
    6445                      .dwattr $C$DW$611, DW_AT_name("DMACH0TCR1")
    6446                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_DMACH0TCR1")
    6447                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6448                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6449              $C$DW$612       .dwtag  DW_TAG_member
    6450                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$20)
    6451                      .dwattr $C$DW$612, DW_AT_name("DMACH0TCR2")
    6452                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_DMACH0TCR2")
    6453                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6454                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6455              $C$DW$613       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$31)
    6457                      .dwattr $C$DW$613, DW_AT_name("RSVD0")
    6458                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_RSVD0")
    6459                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6460                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6461              $C$DW$614       .dwtag  DW_TAG_member
    6462                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$20)
    6463                      .dwattr $C$DW$614, DW_AT_name("DMACH1SSAL")
    6464                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_DMACH1SSAL")
    6465                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6466                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6467              $C$DW$615       .dwtag  DW_TAG_member
    6468                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$20)
    6469                      .dwattr $C$DW$615, DW_AT_name("DMACH1SSAU")
    6470                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_DMACH1SSAU")
    6471                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6472                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6473              $C$DW$616       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$20)
    6475                      .dwattr $C$DW$616, DW_AT_name("DMACH1DSAL")
    6476                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_DMACH1DSAL")
    6477                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6478                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6479              $C$DW$617       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  172

    6480                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$20)
    6481                      .dwattr $C$DW$617, DW_AT_name("DMACH1DSAU")
    6482                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_DMACH1DSAU")
    6483                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6484                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6485              $C$DW$618       .dwtag  DW_TAG_member
    6486                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$20)
    6487                      .dwattr $C$DW$618, DW_AT_name("DMACH1TCR1")
    6488                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_DMACH1TCR1")
    6489                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6490                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6491              $C$DW$619       .dwtag  DW_TAG_member
    6492                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$20)
    6493                      .dwattr $C$DW$619, DW_AT_name("DMACH1TCR2")
    6494                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_DMACH1TCR2")
    6495                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6496                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6497              $C$DW$620       .dwtag  DW_TAG_member
    6498                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$31)
    6499                      .dwattr $C$DW$620, DW_AT_name("RSVD1")
    6500                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_RSVD1")
    6501                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6502                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6503              $C$DW$621       .dwtag  DW_TAG_member
    6504                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
    6505                      .dwattr $C$DW$621, DW_AT_name("DMACH2SSAL")
    6506                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_DMACH2SSAL")
    6507                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6508                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6509              $C$DW$622       .dwtag  DW_TAG_member
    6510                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$20)
    6511                      .dwattr $C$DW$622, DW_AT_name("DMACH2SSAU")
    6512                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_DMACH2SSAU")
    6513                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6514                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6515              $C$DW$623       .dwtag  DW_TAG_member
    6516                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$20)
    6517                      .dwattr $C$DW$623, DW_AT_name("DMACH2DSAL")
    6518                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_DMACH2DSAL")
    6519                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6520                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6521              $C$DW$624       .dwtag  DW_TAG_member
    6522                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$20)
    6523                      .dwattr $C$DW$624, DW_AT_name("DMACH2DSAU")
    6524                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_DMACH2DSAU")
    6525                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    6526                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6527              $C$DW$625       .dwtag  DW_TAG_member
    6528                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
    6529                      .dwattr $C$DW$625, DW_AT_name("DMACH2TCR1")
    6530                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_DMACH2TCR1")
    6531                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6532                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6533              $C$DW$626       .dwtag  DW_TAG_member
    6534                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  173

    6535                      .dwattr $C$DW$626, DW_AT_name("DMACH2TCR2")
    6536                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_DMACH2TCR2")
    6537                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6538                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6539              $C$DW$627       .dwtag  DW_TAG_member
    6540                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$31)
    6541                      .dwattr $C$DW$627, DW_AT_name("RSVD2")
    6542                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_RSVD2")
    6543                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6544                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6545              $C$DW$628       .dwtag  DW_TAG_member
    6546                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
    6547                      .dwattr $C$DW$628, DW_AT_name("DMACH3SSAL")
    6548                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_DMACH3SSAL")
    6549                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6550                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6551              $C$DW$629       .dwtag  DW_TAG_member
    6552                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$20)
    6553                      .dwattr $C$DW$629, DW_AT_name("DMACH3SSAU")
    6554                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_DMACH3SSAU")
    6555                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    6556                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6557              $C$DW$630       .dwtag  DW_TAG_member
    6558                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$20)
    6559                      .dwattr $C$DW$630, DW_AT_name("DMACH3DSAL")
    6560                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_DMACH3DSAL")
    6561                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6562                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6563              $C$DW$631       .dwtag  DW_TAG_member
    6564                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$20)
    6565                      .dwattr $C$DW$631, DW_AT_name("DMACH3DSAU")
    6566                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_DMACH3DSAU")
    6567                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    6568                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6569              $C$DW$632       .dwtag  DW_TAG_member
    6570                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$20)
    6571                      .dwattr $C$DW$632, DW_AT_name("DMACH3TCR1")
    6572                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_DMACH3TCR1")
    6573                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6574                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6575              $C$DW$633       .dwtag  DW_TAG_member
    6576                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$20)
    6577                      .dwattr $C$DW$633, DW_AT_name("DMACH3TCR2")
    6578                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_DMACH3TCR2")
    6579                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    6580                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6581                      .dwendtag $C$DW$T$32
    6582              
    6583              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    6584                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6585                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6586              $C$DW$634       .dwtag  DW_TAG_TI_far_type
    6587                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$33)
    6588              $C$DW$635       .dwtag  DW_TAG_TI_ioport_type
    6589                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$634)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  174

    6590              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    6591                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$635)
    6592              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    6593                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    6594                      .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    6595              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    6596                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    6597                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    6598              
    6599              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6600                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x09)
    6601              $C$DW$636       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$36)
    6603                      .dwattr $C$DW$636, DW_AT_name("dmaRegs")
    6604                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_dmaRegs")
    6605                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6606                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6607              $C$DW$637       .dwtag  DW_TAG_member
    6608                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$38)
    6609                      .dwattr $C$DW$637, DW_AT_name("chanNum")
    6610                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_chanNum")
    6611                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6612                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6613              $C$DW$638       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$40)
    6615                      .dwattr $C$DW$638, DW_AT_name("dmaInstNum")
    6616                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_dmaInstNum")
    6617                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6618                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6619              $C$DW$639       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$41)
    6621                      .dwattr $C$DW$639, DW_AT_name("isChanFree")
    6622                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_isChanFree")
    6623                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6624                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$640       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$43)
    6627                      .dwattr $C$DW$640, DW_AT_name("chanDir")
    6628                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_chanDir")
    6629                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6630                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6631              $C$DW$641       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$45)
    6633                      .dwattr $C$DW$641, DW_AT_name("trigger")
    6634                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_trigger")
    6635                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6636                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6637              $C$DW$642       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$47)
    6639                      .dwattr $C$DW$642, DW_AT_name("trfType")
    6640                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_trfType")
    6641                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6642                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6643              $C$DW$643       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$49)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  175

    6645                      .dwattr $C$DW$643, DW_AT_name("dmaInt")
    6646                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_dmaInt")
    6647                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6648                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6649              $C$DW$644       .dwtag  DW_TAG_member
    6650                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$41)
    6651                      .dwattr $C$DW$644, DW_AT_name("pingPongEnabled")
    6652                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_pingPongEnabled")
    6653                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6654                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6655                      .dwendtag $C$DW$T$50
    6656              
    6657              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    6658                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$50)
    6659                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6660              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    6661                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    6662                      .dwattr $C$DW$T$104, DW_AT_address_class(0x17)
    6663              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    6664                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    6665                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6666              
    6667              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6668                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x0e)
    6669              $C$DW$645       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$52)
    6671                      .dwattr $C$DW$645, DW_AT_name("pingPongMode")
    6672                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_pingPongMode")
    6673                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6674                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6675              $C$DW$646       .dwtag  DW_TAG_member
    6676                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$54)
    6677                      .dwattr $C$DW$646, DW_AT_name("autoMode")
    6678                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_autoMode")
    6679                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6680                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6681              $C$DW$647       .dwtag  DW_TAG_member
    6682                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$56)
    6683                      .dwattr $C$DW$647, DW_AT_name("burstLen")
    6684                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_burstLen")
    6685                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6686                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6687              $C$DW$648       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$45)
    6689                      .dwattr $C$DW$648, DW_AT_name("trigger")
    6690                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_trigger")
    6691                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6692                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6693              $C$DW$649       .dwtag  DW_TAG_member
    6694                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$58)
    6695                      .dwattr $C$DW$649, DW_AT_name("dmaEvt")
    6696                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_dmaEvt")
    6697                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6698                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6699              $C$DW$650       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:55 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_dmaWordSwap_example.asm                                     PAGE  176

    6700                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$49)
    6701                      .dwattr $C$DW$650, DW_AT_name("dmaInt")
    6702                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_dmaInt")
    6703                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6704                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6705              $C$DW$651       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$43)
    6707                      .dwattr $C$DW$651, DW_AT_name("chanDir")
    6708                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_chanDir")
    6709                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6710                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6711              $C$DW$652       .dwtag  DW_TAG_member
