TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE    1

    3233              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:44 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         00022b 0065 
         00022c 0020 
         00022d 0074 
         00022e 0068 
    2063 00022f 0065          .string "e Test",10,10,0
         000230 0020 
         000231 0054 
         000232 0065 
         000233 0073 
         000234 0074 
         000235 000A 
         000236 000A 
         000237 0000 
    2064                      .align  2
    2065 000238 000A  $C$FSL18:       .string 10,"CSL UART INTERRUPT MODE TEST FAILED!!",10,0
         000239 0043 
         00023a 0053 
         00023b 004C 
         00023c 0020 
         00023d 0055 
         00023e 0041 
         00023f 0052 
         000240 0054 
         000241 0020 
         000242 0049 
         000243 004E 
         000244 0054 
         000245 0045 
         000246 0052 
         000247 0052 
         000248 0055 
         000249 0050 
         00024a 0054 
         00024b 0020 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   56

         00024c 004D 
         00024d 004F 
         00024e 0044 
         00024f 0045 
         000250 0020 
         000251 0054 
         000252 0045 
         000253 0053 
         000254 0054 
         000255 0020 
         000256 0046 
         000257 0041 
         000258 0049 
         000259 004C 
         00025a 0045 
         00025b 0044 
         00025c 0021 
         00025d 0021 
         00025e 000A 
         00025f 0000 
    2066                      .align  2
    2067 000260 000A  $C$FSL19:       .string 10,"CSL UART INTERRUPT MODE TEST COMPLETED!!",10,0
         000261 0043 
         000262 0053 
         000263 004C 
         000264 0020 
         000265 0055 
         000266 0041 
         000267 0052 
         000268 0054 
         000269 0020 
         00026a 0049 
         00026b 004E 
         00026c 0054 
         00026d 0045 
         00026e 0052 
         00026f 0052 
         000270 0055 
         000271 0050 
         000272 0054 
         000273 0020 
         000274 004D 
         000275 004F 
         000276 0044 
         000277 0045 
         000278 0020 
         000279 0054 
         00027a 0045 
         00027b 0053 
         00027c 0054 
         00027d 0020 
         00027e 0043 
         00027f 004F 
         000280 004D 
         000281 0050 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   57

         000282 004C 
         000283 0045 
         000284 0054 
         000285 0045 
         000286 0044 
         000287 0021 
         000288 0021 
         000289 000A 
         00028a 0000 
    2068              ;******************************************************************************
    2069              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2070              ;******************************************************************************
    2071                      .global _printf
    2072                      .global _IRQ_plug
    2073                      .global _IRQ_clearAll
    2074                      .global _IRQ_disable
    2075                      .global _IRQ_disableAll
    2076                      .global _IRQ_enable
    2077                      .global _IRQ_setVecs
    2078                      .global _IRQ_globalDisable
    2079                      .global _IRQ_globalEnable
    2080                      .global _UART_init
    2081                      .global _UART_setup
    2082                      .global _UART_eventEnable
    2083                      .global _UART_eventDisable
    2084                      .global _UART_read
    2085                      .global _UART_write
    2086                      .global _UART_fputs
    2087                      .global _UART_getEventId
    2088                      .global _UART_setCallback
    2089                      .global _VECSTART
    2090                      .global __divul
    2091                      .global __mpyli
    2092              
    2093              ;*******************************************************************************
    2094              ;* TYPE INFORMATION                                                            *
    2095              ;*******************************************************************************
    2096              
    2097              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    2098                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2099              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
    2100              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
    2101              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
    2102                      .dwendtag $C$DW$T$40
    2103              
    2104              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
    2105                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2106                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2107              
    2108              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2109                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
    2110              $C$DW$159       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2112                      .dwattr $C$DW$159, DW_AT_name("THR")
    2113                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_THR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   58

    2114                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$160       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2118                      .dwattr $C$DW$160, DW_AT_name("RSVD0")
    2119                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_RSVD0")
    2120                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2121                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$161       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2124                      .dwattr $C$DW$161, DW_AT_name("IER")
    2125                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IER")
    2126                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2127                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$162       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2130                      .dwattr $C$DW$162, DW_AT_name("RSVD1")
    2131                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_RSVD1")
    2132                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2133                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$163       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2136                      .dwattr $C$DW$163, DW_AT_name("FCR")
    2137                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_FCR")
    2138                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2139                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$164       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2142                      .dwattr $C$DW$164, DW_AT_name("RSVD2")
    2143                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD2")
    2144                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2145                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$165       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2148                      .dwattr $C$DW$165, DW_AT_name("LCR")
    2149                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_LCR")
    2150                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2151                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$166       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2154                      .dwattr $C$DW$166, DW_AT_name("RSVD3")
    2155                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD3")
    2156                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2157                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$167       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2160                      .dwattr $C$DW$167, DW_AT_name("MCR")
    2161                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_MCR")
    2162                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2163                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$168       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2166                      .dwattr $C$DW$168, DW_AT_name("RSVD4")
    2167                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD4")
    2168                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   59

    2169                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$169       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2172                      .dwattr $C$DW$169, DW_AT_name("LSR")
    2173                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LSR")
    2174                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2175                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$170       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2178                      .dwattr $C$DW$170, DW_AT_name("RSVD5")
    2179                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RSVD5")
    2180                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2181                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$171       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2184                      .dwattr $C$DW$171, DW_AT_name("SCR")
    2185                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SCR")
    2186                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2187                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$172       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2190                      .dwattr $C$DW$172, DW_AT_name("RSVD6")
    2191                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RSVD6")
    2192                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2193                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$173       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2196                      .dwattr $C$DW$173, DW_AT_name("DLL")
    2197                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DLL")
    2198                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2199                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$174       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    2202                      .dwattr $C$DW$174, DW_AT_name("RSVD7")
    2203                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_RSVD7")
    2204                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2205                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$175       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    2208                      .dwattr $C$DW$175, DW_AT_name("DLH")
    2209                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DLH")
    2210                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2211                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$176       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2214                      .dwattr $C$DW$176, DW_AT_name("RSVD8")
    2215                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_RSVD8")
    2216                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2217                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$177       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2220                      .dwattr $C$DW$177, DW_AT_name("PWREMU_MGMT")
    2221                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PWREMU_MGMT")
    2222                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2223                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   60

    2224                      .dwendtag $C$DW$T$23
    2225              
    2226              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
    2227                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    2228                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2229              $C$DW$178       .dwtag  DW_TAG_TI_far_type
    2230                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
    2231              $C$DW$179       .dwtag  DW_TAG_TI_ioport_type
    2232                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$178)
    2233              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2234                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$179)
    2235              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2236                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2237                      .dwattr $C$DW$T$34, DW_AT_address_class(0x10)
    2238              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
    2239                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2240                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2241              
    2242              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2243                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    2244              $C$DW$180       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2246                      .dwattr $C$DW$180, DW_AT_name("EBSR")
    2247                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_EBSR")
    2248                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$181       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2252                      .dwattr $C$DW$181, DW_AT_name("RSVD0")
    2253                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RSVD0")
    2254                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2255                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$182       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2258                      .dwattr $C$DW$182, DW_AT_name("PCGCR1")
    2259                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PCGCR1")
    2260                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2261                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$183       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2264                      .dwattr $C$DW$183, DW_AT_name("PCGCR2")
    2265                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PCGCR2")
    2266                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2267                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$184       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2270                      .dwattr $C$DW$184, DW_AT_name("PSRCR")
    2271                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PSRCR")
    2272                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2273                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$185       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    2276                      .dwattr $C$DW$185, DW_AT_name("PRCR")
    2277                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PRCR")
    2278                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   61

    2279                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2280              $C$DW$186       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$24)
    2282                      .dwattr $C$DW$186, DW_AT_name("RSVD1")
    2283                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RSVD1")
    2284                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2285                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$187       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2288                      .dwattr $C$DW$187, DW_AT_name("TIAFR")
    2289                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_TIAFR")
    2290                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2291                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$188       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2294                      .dwattr $C$DW$188, DW_AT_name("RSVD2")
    2295                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD2")
    2296                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2297                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$189       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2300                      .dwattr $C$DW$189, DW_AT_name("ODSCR")
    2301                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ODSCR")
    2302                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2303                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$190       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2306                      .dwattr $C$DW$190, DW_AT_name("PDINHIBR1")
    2307                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PDINHIBR1")
    2308                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2309                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$191       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2312                      .dwattr $C$DW$191, DW_AT_name("PDINHIBR2")
    2313                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PDINHIBR2")
    2314                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2315                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$192       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2318                      .dwattr $C$DW$192, DW_AT_name("PDINHIBR3")
    2319                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PDINHIBR3")
    2320                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2321                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$193       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2324                      .dwattr $C$DW$193, DW_AT_name("DMA0CESR1")
    2325                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DMA0CESR1")
    2326                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2327                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$194       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2330                      .dwattr $C$DW$194, DW_AT_name("DMA0CESR2")
    2331                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DMA0CESR2")
    2332                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2333                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   62

    2334              $C$DW$195       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2336                      .dwattr $C$DW$195, DW_AT_name("DMA1CESR1")
    2337                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DMA1CESR1")
    2338                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2339                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$196       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2342                      .dwattr $C$DW$196, DW_AT_name("DMA1CESR2")
    2343                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DMA1CESR2")
    2344                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2345                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$197       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    2348                      .dwattr $C$DW$197, DW_AT_name("SDRAMCCR")
    2349                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_SDRAMCCR")
    2350                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2351                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$198       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    2354                      .dwattr $C$DW$198, DW_AT_name("CCR2")
    2355                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CCR2")
    2356                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2357                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$199       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2360                      .dwattr $C$DW$199, DW_AT_name("CGCR1")
    2361                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CGCR1")
    2362                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2363                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$200       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2366                      .dwattr $C$DW$200, DW_AT_name("CGICR")
    2367                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CGICR")
    2368                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2369                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$201       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2372                      .dwattr $C$DW$201, DW_AT_name("CGCR2")
    2373                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CGCR2")
    2374                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2375                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$202       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2378                      .dwattr $C$DW$202, DW_AT_name("CGOCR")
    2379                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_CGOCR")
    2380                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2381                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$203       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    2384                      .dwattr $C$DW$203, DW_AT_name("CCSSR")
    2385                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_CCSSR")
    2386                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2387                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$204       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   63

    2389                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2390                      .dwattr $C$DW$204, DW_AT_name("RSVD3")
    2391                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_RSVD3")
    2392                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2393                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$205       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    2396                      .dwattr $C$DW$205, DW_AT_name("ECDR")
    2397                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ECDR")
    2398                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2399                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$206       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    2402                      .dwattr $C$DW$206, DW_AT_name("RSVD4")
    2403                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD4")
    2404                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2405                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$207       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    2408                      .dwattr $C$DW$207, DW_AT_name("RAMSLPMDCNTLR1")
    2409                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2410                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2411                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$208       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2414                      .dwattr $C$DW$208, DW_AT_name("RSVD5")
    2415                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD5")
    2416                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2417                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$209       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2420                      .dwattr $C$DW$209, DW_AT_name("RAMSLPMDCNTLR2")
    2421                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2422                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2423                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$210       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    2426                      .dwattr $C$DW$210, DW_AT_name("RAMSLPMDCNTLR3")
    2427                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2428                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2429                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$211       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2432                      .dwattr $C$DW$211, DW_AT_name("RAMSLPMDCNTLR4")
    2433                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2434                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2435                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$212       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2438                      .dwattr $C$DW$212, DW_AT_name("RAMSLPMDCNTLR5")
    2439                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2440                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2441                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$213       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$25)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   64

    2444                      .dwattr $C$DW$213, DW_AT_name("RSVD6")
    2445                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RSVD6")
    2446                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2447                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$214       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    2450                      .dwattr $C$DW$214, DW_AT_name("DMAIFR")
    2451                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMAIFR")
    2452                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2453                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$215       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2456                      .dwattr $C$DW$215, DW_AT_name("DMAIER")
    2457                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMAIER")
    2458                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2459                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$216       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2462                      .dwattr $C$DW$216, DW_AT_name("USBSCR")
    2463                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_USBSCR")
    2464                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2465                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$217       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2468                      .dwattr $C$DW$217, DW_AT_name("ESCR")
    2469                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ESCR")
    2470                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2471                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$218       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    2474                      .dwattr $C$DW$218, DW_AT_name("RSVD7")
    2475                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RSVD7")
    2476                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2477                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$219       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2480                      .dwattr $C$DW$219, DW_AT_name("DMA2CESR1")
    2481                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DMA2CESR1")
    2482                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2483                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$220       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2486                      .dwattr $C$DW$220, DW_AT_name("DMA2CESR2")
    2487                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_DMA2CESR2")
    2488                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2489                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$221       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2492                      .dwattr $C$DW$221, DW_AT_name("DMA3CESR1")
    2493                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMA3CESR1")
    2494                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2495                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$222       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2498                      .dwattr $C$DW$222, DW_AT_name("DMA3CESR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   65

    2499                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMA3CESR2")
    2500                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2501                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2502              $C$DW$223       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2504                      .dwattr $C$DW$223, DW_AT_name("CLKSTOP")
    2505                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_CLKSTOP")
    2506                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2507                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2508              $C$DW$224       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    2510                      .dwattr $C$DW$224, DW_AT_name("RSVD8")
    2511                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD8")
    2512                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2513                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2514              $C$DW$225       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2516                      .dwattr $C$DW$225, DW_AT_name("DIEIDR0")
    2517                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_DIEIDR0")
    2518                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2519                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$226       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2522                      .dwattr $C$DW$226, DW_AT_name("DIEIDR1")
    2523                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_DIEIDR1")
    2524                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2525                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$227       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2528                      .dwattr $C$DW$227, DW_AT_name("DIEIDR2")
    2529                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_DIEIDR2")
    2530                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2531                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$228       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2534                      .dwattr $C$DW$228, DW_AT_name("DIEIDR3")
    2535                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_DIEIDR3")
    2536                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2537                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$229       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2540                      .dwattr $C$DW$229, DW_AT_name("DIEIDR4")
    2541                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_DIEIDR4")
    2542                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2543                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$230       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2546                      .dwattr $C$DW$230, DW_AT_name("DIEIDR5")
    2547                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_DIEIDR5")
    2548                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2549                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$231       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2552                      .dwattr $C$DW$231, DW_AT_name("DIEIDR6")
    2553                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_DIEIDR6")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   66

    2554                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2555                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$232       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2558                      .dwattr $C$DW$232, DW_AT_name("DIEIDR7")
    2559                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DIEIDR7")
    2560                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2561                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2562                      .dwendtag $C$DW$T$26
    2563              
    2564              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2565                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
    2566                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2567              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    2568                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$36)
    2569              $C$DW$234       .dwtag  DW_TAG_TI_ioport_type
    2570                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$233)
    2571              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    2572                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$234)
    2573              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2574                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2575                      .dwattr $C$DW$T$38, DW_AT_address_class(0x10)
    2576              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2577                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2578                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2579              
    2580              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2581                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2582              $C$DW$235       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    2584                      .dwattr $C$DW$235, DW_AT_name("clkInput")
    2585                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_clkInput")
    2586                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$236       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    2590                      .dwattr $C$DW$236, DW_AT_name("baud")
    2591                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_baud")
    2592                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2593                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$237       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2596                      .dwattr $C$DW$237, DW_AT_name("wordLength")
    2597                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_wordLength")
    2598                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2599                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2600              $C$DW$238       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2602                      .dwattr $C$DW$238, DW_AT_name("stopBits")
    2603                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_stopBits")
    2604                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2605                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2606              $C$DW$239       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$239, DW_AT_name("parity")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   67

    2609                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_parity")
    2610                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2611                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2612              $C$DW$240       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2614                      .dwattr $C$DW$240, DW_AT_name("fifoControl")
    2615                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_fifoControl")
    2616                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2617                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$241       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2620                      .dwattr $C$DW$241, DW_AT_name("loopBackEnable")
    2621                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_loopBackEnable")
    2622                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2623                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$242       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$242, DW_AT_name("afeEnable")
    2627                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_afeEnable")
    2628                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2629                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$243       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2632                      .dwattr $C$DW$243, DW_AT_name("rtsEnable")
    2633                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rtsEnable")
    2634                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2635                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2636                      .dwendtag $C$DW$T$28
    2637              
    2638              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartSetup")
    2639                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$28)
    2640                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2641              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2642                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2643                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    2644              
    2645              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2646                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    2647              $C$DW$244       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$30)
    2649                      .dwattr $C$DW$244, DW_AT_name("lsiAddr")
    2650                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_lsiAddr")
    2651                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$245       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$30)
    2655                      .dwattr $C$DW$245, DW_AT_name("rbiAddr")
    2656                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rbiAddr")
    2657                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2658                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$246       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
    2661                      .dwattr $C$DW$246, DW_AT_name("tbeiAddr")
    2662                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_tbeiAddr")
    2663                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   68

    2664                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$247       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$30)
    2667                      .dwattr $C$DW$247, DW_AT_name("ctoi")
    2668                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_ctoi")
    2669                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2670                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2671                      .dwendtag $C$DW$T$31
    2672              
    2673              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartIsrAddr")
    2674                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$31)
    2675                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2676              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2677                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2678                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    2679              
    2680              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2681                      .dwattr $C$DW$T$48, DW_AT_name("CSL_UartEventType")
    2682                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2683              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_REG_DATA_INTERRUPT"), DW_AT_const_valu
    2684              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_XMITOR_REG_EMPTY_INTERRUPT"), DW_AT_const_val
    2685              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_LINE_STATUS_INTERRUPT"), DW_AT_const_v
    2686                      .dwendtag $C$DW$T$48
    2687              
    2688              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartEventType")
    2689                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2690                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2691              
    2692              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2693                      .dwattr $C$DW$T$43, DW_AT_name("CSL_UartObj")
    2694                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    2695              $C$DW$251       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$251, DW_AT_name("insId")
    2698                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_insId")
    2699                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2701              $C$DW$252       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$35)
    2703                      .dwattr $C$DW$252, DW_AT_name("uartRegs")
    2704                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_uartRegs")
    2705                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2706                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2707              $C$DW$253       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$39)
    2709                      .dwattr $C$DW$253, DW_AT_name("sysAddr")
    2710                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_sysAddr")
    2711                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2712                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2713              $C$DW$254       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$41)
    2715                      .dwattr $C$DW$254, DW_AT_name("opmode")
    2716                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_opmode")
    2717                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2718                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   69

    2719              $C$DW$255       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2721                      .dwattr $C$DW$255, DW_AT_name("trigLevel")
    2722                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_trigLevel")
    2723                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2724                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2725              $C$DW$256       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$42)
    2727                      .dwattr $C$DW$256, DW_AT_name("UART_isrDispatchTable")
    2728                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
    2729                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2730                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2731                      .dwendtag $C$DW$T$43
    2732              
    2733              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
    2734                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$43)
    2735                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2736              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2737                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2738                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
    2739              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
    2740                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2741                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2742              
    2743              $C$DW$T$29      .dwtag  DW_TAG_subroutine_type
    2744                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2745              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    2746                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2747                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    2748              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2749                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$30)
    2750                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2751              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2752                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2753                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2754                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2755              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2756                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2757                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2758                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2759              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2760                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2761                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2762                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2763              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2764                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2765                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2766                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2767              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2768                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2769                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2770                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2771              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2772                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
    2773                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_intc_example.asm                                            PAGE   70

    2774              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2775                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2776                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2777              $C$DW$257       .dwtag  DW_TAG_TI_far_type
    2778                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$55)
    2779              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    2780                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$257)
    2781              $C$DW$T$9       .dwtag  DW_TAG_base_type
