TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE    1

    2341              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:43 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         0001d2 0020 
         0001d3 0074 
         0001d4 0068 
         0001d5 0065 
         0001d6 0020 
         0001d7 0020 
         0001d8 0073 
         0001d9 0074 
         0001da 0072 
         0001db 0069 
         0001dc 006E 
         0001dd 0067 
         0001de 0020 
         0001df 0065 
         0001e0 006E 
         0001e1 0074 
         0001e2 0065 
         0001e3 0072 
         0001e4 0065 
         0001e5 0064 
         0001e6 003A 
         0001e7 0020 
         0001e8 0025 
         0001e9 0064 
         0001ea 000A 
         0001eb 0000 
    1236                      .align  2
    1237 0001ec 000A  $C$FSL15:       .string 10,"String Read from HyperTerminal ",10,0
         0001ed 0053 
         0001ee 0074 
         0001ef 0072 
         0001f0 0069 
         0001f1 006E 
         0001f2 0067 
         0001f3 0020 
         0001f4 0052 
         0001f5 0065 
         0001f6 0061 
         0001f7 0064 
         0001f8 0020 
         0001f9 0066 
         0001fa 0072 
         0001fb 006F 
         0001fc 006D 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   37

         0001fd 0020 
         0001fe 0048 
         0001ff 0079 
         000200 0070 
         000201 0065 
         000202 0072 
         000203 0054 
         000204 0065 
         000205 0072 
         000206 006D 
         000207 0069 
         000208 006E 
         000209 0061 
         00020a 006C 
         00020b 0020 
         00020c 000A 
         00020d 0000 
    1238                      .align  2
    1239 00020e 000D  $C$FSL16:       .string 13,10,"YOU HAVE ENTERED: ",0
         00020f 000A 
         000210 0059 
         000211 004F 
         000212 0055 
         000213 0020 
         000214 0048 
         000215 0041 
         000216 0056 
         000217 0045 
         000218 0020 
         000219 0045 
         00021a 004E 
         00021b 0054 
         00021c 0045 
         00021d 0052 
         00021e 0045 
         00021f 0044 
         000220 003A 
         000221 0020 
         000222 0000 
    1240                      .align  2
    1241 000224 000A  $C$FSL17:       .string 10,"Message Sent to HyperTerminal : ",10,"%s%s",10,0
         000225 004D 
         000226 0065 
         000227 0073 
         000228 0073 
         000229 0061 
         00022a 0067 
         00022b 0065 
         00022c 0020 
         00022d 0053 
         00022e 0065 
         00022f 006E 
         000230 0074 
         000231 0020 
         000232 0074 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   38

         000233 006F 
         000234 0020 
         000235 0048 
         000236 0079 
         000237 0070 
         000238 0065 
         000239 0072 
         00023a 0054 
         00023b 0065 
         00023c 0072 
         00023d 006D 
         00023e 0069 
         00023f 006E 
         000240 0061 
         000241 006C 
         000242 0020 
         000243 003A 
         000244 0020 
         000245 000A 
         000246 0025 
         000247 0073 
         000248 0025 
         000249 0073 
         00024a 000A 
         00024b 0000 
    1242                      .align  2
    1243 00024c 000D  $C$FSL18:       .string 13,10,0
         00024d 000A 
         00024e 0000 
    1244              ;******************************************************************************
    1245              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1246              ;******************************************************************************
    1247                      .global _printf
    1248                      .global _UART_init
    1249                      .global _UART_setup
    1250                      .global _UART_read
    1251                      .global _UART_fputs
    1252                      .global __divul
    1253                      .global __mpyli
    1254              
    1255              ;*******************************************************************************
    1256              ;* TYPE INFORMATION                                                            *
    1257              ;*******************************************************************************
    1258              
    1259              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1260                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1261              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
    1262              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
    1263              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
    1264                      .dwendtag $C$DW$T$37
    1265              
    1266              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
    1267                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1268                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1269              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   39

    1270              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1271                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
    1272              $C$DW$88        .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1274                      .dwattr $C$DW$88, DW_AT_name("THR")
    1275                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_THR")
    1276                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$89        .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1280                      .dwattr $C$DW$89, DW_AT_name("RSVD0")
    1281                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_RSVD0")
    1282                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1283                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$90        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1286                      .dwattr $C$DW$90, DW_AT_name("IER")
    1287                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IER")
    1288                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1289                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1290              $C$DW$91        .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1292                      .dwattr $C$DW$91, DW_AT_name("RSVD1")
    1293                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_RSVD1")
    1294                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1295                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$92        .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1298                      .dwattr $C$DW$92, DW_AT_name("FCR")
    1299                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_FCR")
    1300                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1301                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1302              $C$DW$93        .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1304                      .dwattr $C$DW$93, DW_AT_name("RSVD2")
    1305                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RSVD2")
    1306                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1307                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$94        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1310                      .dwattr $C$DW$94, DW_AT_name("LCR")
    1311                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_LCR")
    1312                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1313                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$95        .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1316                      .dwattr $C$DW$95, DW_AT_name("RSVD3")
    1317                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RSVD3")
    1318                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1319                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$96        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1322                      .dwattr $C$DW$96, DW_AT_name("MCR")
    1323                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_MCR")
    1324                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   40

    1325                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$97        .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1328                      .dwattr $C$DW$97, DW_AT_name("RSVD4")
    1329                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD4")
    1330                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1331                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1332              $C$DW$98        .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1334                      .dwattr $C$DW$98, DW_AT_name("LSR")
    1335                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_LSR")
    1336                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1337                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$99        .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1340                      .dwattr $C$DW$99, DW_AT_name("RSVD5")
    1341                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_RSVD5")
    1342                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1343                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1344              $C$DW$100       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    1346                      .dwattr $C$DW$100, DW_AT_name("SCR")
    1347                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SCR")
    1348                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1349                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$101       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1352                      .dwattr $C$DW$101, DW_AT_name("RSVD6")
    1353                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_RSVD6")
    1354                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1355                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$102       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1358                      .dwattr $C$DW$102, DW_AT_name("DLL")
    1359                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_DLL")
    1360                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1361                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$103       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1364                      .dwattr $C$DW$103, DW_AT_name("RSVD7")
    1365                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RSVD7")
    1366                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1367                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$104       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1370                      .dwattr $C$DW$104, DW_AT_name("DLH")
    1371                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_DLH")
    1372                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1373                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$105       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    1376                      .dwattr $C$DW$105, DW_AT_name("RSVD8")
    1377                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_RSVD8")
    1378                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1379                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   41

    1380              $C$DW$106       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1382                      .dwattr $C$DW$106, DW_AT_name("PWREMU_MGMT")
    1383                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PWREMU_MGMT")
    1384                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1385                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1386                      .dwendtag $C$DW$T$23
    1387              
    1388              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
    1389                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    1390                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1391              $C$DW$107       .dwtag  DW_TAG_TI_far_type
    1392                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    1393              $C$DW$108       .dwtag  DW_TAG_TI_ioport_type
    1394                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$107)
    1395              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1396                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$108)
    1397              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1398                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1399                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    1400              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
    1401                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1402                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1403              
    1404              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1405                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    1406              $C$DW$109       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1408                      .dwattr $C$DW$109, DW_AT_name("EBSR")
    1409                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_EBSR")
    1410                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$110       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1414                      .dwattr $C$DW$110, DW_AT_name("RSVD0")
    1415                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD0")
    1416                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1417                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$111       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1420                      .dwattr $C$DW$111, DW_AT_name("PCGCR1")
    1421                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PCGCR1")
    1422                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1423                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$112       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1426                      .dwattr $C$DW$112, DW_AT_name("PCGCR2")
    1427                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PCGCR2")
    1428                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1429                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$113       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    1432                      .dwattr $C$DW$113, DW_AT_name("PSRCR")
    1433                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PSRCR")
    1434                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   42

    1435                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$114       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1438                      .dwattr $C$DW$114, DW_AT_name("PRCR")
    1439                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PRCR")
    1440                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1441                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$115       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$24)
    1444                      .dwattr $C$DW$115, DW_AT_name("RSVD1")
    1445                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD1")
    1446                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1447                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$116       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1450                      .dwattr $C$DW$116, DW_AT_name("TIAFR")
    1451                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TIAFR")
    1452                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1453                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$117       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1456                      .dwattr $C$DW$117, DW_AT_name("RSVD2")
    1457                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RSVD2")
    1458                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1459                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$118       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1462                      .dwattr $C$DW$118, DW_AT_name("ODSCR")
    1463                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_ODSCR")
    1464                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1465                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$119       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1468                      .dwattr $C$DW$119, DW_AT_name("PDINHIBR1")
    1469                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PDINHIBR1")
    1470                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1471                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$120       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1474                      .dwattr $C$DW$120, DW_AT_name("PDINHIBR2")
    1475                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PDINHIBR2")
    1476                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1477                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$121       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1480                      .dwattr $C$DW$121, DW_AT_name("PDINHIBR3")
    1481                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PDINHIBR3")
    1482                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1483                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$122       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1486                      .dwattr $C$DW$122, DW_AT_name("DMA0CESR1")
    1487                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_DMA0CESR1")
    1488                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1489                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   43

    1490              $C$DW$123       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1492                      .dwattr $C$DW$123, DW_AT_name("DMA0CESR2")
    1493                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_DMA0CESR2")
    1494                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1495                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$124       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1498                      .dwattr $C$DW$124, DW_AT_name("DMA1CESR1")
    1499                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_DMA1CESR1")
    1500                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1501                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$125       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1504                      .dwattr $C$DW$125, DW_AT_name("DMA1CESR2")
    1505                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DMA1CESR2")
    1506                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1507                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$126       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$126, DW_AT_name("SDRAMCCR")
    1511                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SDRAMCCR")
    1512                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1513                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$127       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1516                      .dwattr $C$DW$127, DW_AT_name("CCR2")
    1517                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CCR2")
    1518                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1519                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$128       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1522                      .dwattr $C$DW$128, DW_AT_name("CGCR1")
    1523                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CGCR1")
    1524                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1525                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$129       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1528                      .dwattr $C$DW$129, DW_AT_name("CGICR")
    1529                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CGICR")
    1530                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1531                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$130       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1534                      .dwattr $C$DW$130, DW_AT_name("CGCR2")
    1535                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CGCR2")
    1536                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1537                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$131       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1540                      .dwattr $C$DW$131, DW_AT_name("CGOCR")
    1541                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CGOCR")
    1542                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1543                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$132       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   44

    1545                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1546                      .dwattr $C$DW$132, DW_AT_name("CCSSR")
    1547                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CCSSR")
    1548                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1549                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$133       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1552                      .dwattr $C$DW$133, DW_AT_name("RSVD3")
    1553                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_RSVD3")
    1554                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1555                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$134       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1558                      .dwattr $C$DW$134, DW_AT_name("ECDR")
    1559                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ECDR")
    1560                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1561                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$135       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1564                      .dwattr $C$DW$135, DW_AT_name("RSVD4")
    1565                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_RSVD4")
    1566                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1567                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$136       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1570                      .dwattr $C$DW$136, DW_AT_name("RAMSLPMDCNTLR1")
    1571                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1572                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1573                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$137       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1576                      .dwattr $C$DW$137, DW_AT_name("RSVD5")
    1577                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_RSVD5")
    1578                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1579                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$138       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1582                      .dwattr $C$DW$138, DW_AT_name("RAMSLPMDCNTLR2")
    1583                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1584                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1585                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$139       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1588                      .dwattr $C$DW$139, DW_AT_name("RAMSLPMDCNTLR3")
    1589                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1590                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1591                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$140       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1594                      .dwattr $C$DW$140, DW_AT_name("RAMSLPMDCNTLR4")
    1595                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1596                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1597                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$141       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   45

    1600                      .dwattr $C$DW$141, DW_AT_name("RAMSLPMDCNTLR5")
    1601                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1602                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1603                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$142       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$25)
    1606                      .dwattr $C$DW$142, DW_AT_name("RSVD6")
    1607                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RSVD6")
    1608                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1609                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$143       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1612                      .dwattr $C$DW$143, DW_AT_name("DMAIFR")
    1613                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DMAIFR")
    1614                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1615                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$144       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1618                      .dwattr $C$DW$144, DW_AT_name("DMAIER")
    1619                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DMAIER")
    1620                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1621                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$145       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1624                      .dwattr $C$DW$145, DW_AT_name("USBSCR")
    1625                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_USBSCR")
    1626                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1627                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$146       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1630                      .dwattr $C$DW$146, DW_AT_name("ESCR")
    1631                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ESCR")
    1632                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1633                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$147       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1636                      .dwattr $C$DW$147, DW_AT_name("RSVD7")
    1637                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RSVD7")
    1638                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1639                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$148       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1642                      .dwattr $C$DW$148, DW_AT_name("DMA2CESR1")
    1643                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DMA2CESR1")
    1644                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1645                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$149       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1648                      .dwattr $C$DW$149, DW_AT_name("DMA2CESR2")
    1649                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_DMA2CESR2")
    1650                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1651                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$150       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    1654                      .dwattr $C$DW$150, DW_AT_name("DMA3CESR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   46

    1655                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_DMA3CESR1")
    1656                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1657                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$151       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    1660                      .dwattr $C$DW$151, DW_AT_name("DMA3CESR2")
    1661                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_DMA3CESR2")
    1662                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1663                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$152       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    1666                      .dwattr $C$DW$152, DW_AT_name("CLKSTOP")
    1667                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_CLKSTOP")
    1668                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1669                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$153       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$22)
    1672                      .dwattr $C$DW$153, DW_AT_name("RSVD8")
    1673                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_RSVD8")
    1674                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1675                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1676              $C$DW$154       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1678                      .dwattr $C$DW$154, DW_AT_name("DIEIDR0")
    1679                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DIEIDR0")
    1680                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1681                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1682              $C$DW$155       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    1684                      .dwattr $C$DW$155, DW_AT_name("DIEIDR1")
    1685                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DIEIDR1")
    1686                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1687                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1688              $C$DW$156       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    1690                      .dwattr $C$DW$156, DW_AT_name("DIEIDR2")
    1691                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DIEIDR2")
    1692                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1693                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1694              $C$DW$157       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1696                      .dwattr $C$DW$157, DW_AT_name("DIEIDR3")
    1697                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_DIEIDR3")
    1698                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1699                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1700              $C$DW$158       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1702                      .dwattr $C$DW$158, DW_AT_name("DIEIDR4")
    1703                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DIEIDR4")
    1704                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1705                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1706              $C$DW$159       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1708                      .dwattr $C$DW$159, DW_AT_name("DIEIDR5")
    1709                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_DIEIDR5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   47

    1710                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1711                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1712              $C$DW$160       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1714                      .dwattr $C$DW$160, DW_AT_name("DIEIDR6")
    1715                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DIEIDR6")
    1716                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1717                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1718              $C$DW$161       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1720                      .dwattr $C$DW$161, DW_AT_name("DIEIDR7")
    1721                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DIEIDR7")
    1722                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1723                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwendtag $C$DW$T$26
    1725              
    1726              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1727                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$26)
    1728                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1729              $C$DW$162       .dwtag  DW_TAG_TI_far_type
    1730                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$33)
    1731              $C$DW$163       .dwtag  DW_TAG_TI_ioport_type
    1732                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$162)
    1733              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    1734                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$163)
    1735              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1736                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1737                      .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    1738              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1739                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1740                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1741              
    1742              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1743                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    1744              $C$DW$164       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    1746                      .dwattr $C$DW$164, DW_AT_name("clkInput")
    1747                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_clkInput")
    1748                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$165       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    1752                      .dwattr $C$DW$165, DW_AT_name("baud")
    1753                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_baud")
    1754                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1755                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$166       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$166, DW_AT_name("wordLength")
    1759                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_wordLength")
    1760                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1761                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$167       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$167, DW_AT_name("stopBits")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   48

    1765                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_stopBits")
    1766                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1767                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$168       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$168, DW_AT_name("parity")
    1771                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_parity")
    1772                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1773                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1774              $C$DW$169       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1776                      .dwattr $C$DW$169, DW_AT_name("fifoControl")
    1777                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_fifoControl")
    1778                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1779                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$170       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$170, DW_AT_name("loopBackEnable")
    1783                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_loopBackEnable")
    1784                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1785                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$171       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$171, DW_AT_name("afeEnable")
    1789                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_afeEnable")
    1790                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1791                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$172       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1794                      .dwattr $C$DW$172, DW_AT_name("rtsEnable")
    1795                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rtsEnable")
    1796                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1797                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1798                      .dwendtag $C$DW$T$28
    1799              
    1800              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartSetup")
    1801                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    1802                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1803              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1804                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1805                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1806              
    1807              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1808                      .dwattr $C$DW$T$40, DW_AT_name("CSL_UartObj")
    1809                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1810              $C$DW$173       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$173, DW_AT_name("insId")
    1813                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_insId")
    1814                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$174       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$32)
    1818                      .dwattr $C$DW$174, DW_AT_name("uartRegs")
    1819                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_uartRegs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   49

    1820                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1821                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$175       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$36)
    1824                      .dwattr $C$DW$175, DW_AT_name("sysAddr")
    1825                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_sysAddr")
    1826                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1827                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$176       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$38)
    1830                      .dwattr $C$DW$176, DW_AT_name("opmode")
    1831                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_opmode")
    1832                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1833                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1834              $C$DW$177       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1836                      .dwattr $C$DW$177, DW_AT_name("trigLevel")
    1837                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_trigLevel")
    1838                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1839                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1840              $C$DW$178       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$39)
    1842                      .dwattr $C$DW$178, DW_AT_name("UART_isrDispatchTable")
    1843                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
    1844                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1845                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1846                      .dwendtag $C$DW$T$40
    1847              
    1848              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
    1849                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    1850                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1851              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1852                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1853                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    1854              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
    1855                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1856                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1857              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1858                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1859                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1860                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1861              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1862                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1863                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1864                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1865              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1866                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1867                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1868                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1869              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1870                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1871                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1872                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1873              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1874                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:43 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_polled_example.asm                                          PAGE   50

    1875                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1876                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1877              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1878                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
    1879                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1880              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1881                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1882                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1883              $C$DW$179       .dwtag  DW_TAG_TI_far_type
    1884                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$46)
    1885              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    1886                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$179)
    1887              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1888                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1889                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1890                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1891              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1892                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1893                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1894              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    1895                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
