TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE    1

    1521              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:30 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         00023f 0057 
         000240 0044 
         000241 0054 
         000242 0020 
         000243 0053 
         000244 0065 
         000245 0072 
         000246 0076 
         000247 0069 
         000248 0063 
         000249 0065 
         00024a 0020 
         00024b 002D 
         00024c 0020 
         00024d 0025 
         00024e 006C 
         00024f 0064 
         000250 000A 
         000251 0000 
     936                      .align  2
     937 000252 0057  $C$FSL16:       .string "Watchdog Count is: %ld",10,0
         000253 0061 
         000254 0074 
         000255 0063 
         000256 0068 
         000257 0064 
         000258 006F 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   32

         000259 0067 
         00025a 0020 
         00025b 0043 
         00025c 006F 
         00025d 0075 
         00025e 006E 
         00025f 0074 
         000260 0020 
         000261 0069 
         000262 0073 
         000263 003A 
         000264 0020 
         000265 0025 
         000266 006C 
         000267 0064 
         000268 000A 
         000269 0000 
     938                      .align  2
     939 00026a 000A  $C$FSL17:       .string 10,"WDT Out of Service - %ld",10,0
         00026b 0057 
         00026c 0044 
         00026d 0054 
         00026e 0020 
         00026f 004F 
         000270 0075 
         000271 0074 
         000272 0020 
         000273 006F 
         000274 0066 
         000275 0020 
         000276 0053 
         000277 0065 
         000278 0072 
         000279 0076 
         00027a 0069 
         00027b 0063 
         00027c 0065 
         00027d 0020 
         00027e 002D 
         00027f 0020 
         000280 0025 
         000281 006C 
         000282 0064 
         000283 000A 
         000284 0000 
     940                      .align  2
     941 000286 0043  $C$FSL18:       .string "CSL WATCHDOG TIMER TESTS!",10,10,0
         000287 0053 
         000288 004C 
         000289 0020 
         00028a 0057 
         00028b 0041 
         00028c 0054 
         00028d 0043 
         00028e 0048 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   33

         00028f 0044 
         000290 004F 
         000291 0047 
         000292 0020 
         000293 0054 
         000294 0049 
         000295 004D 
         000296 0045 
         000297 0052 
         000298 0020 
         000299 0054 
         00029a 0045 
         00029b 0053 
         00029c 0054 
         00029d 0053 
         00029e 0021 
         00029f 000A 
         0002a0 000A 
         0002a1 0000 
     942                      .align  2
     943 0002a2 000A  $C$FSL19:       .string 10,"WDTIM: Test case Failed!!",10,0
         0002a3 0057 
         0002a4 0044 
         0002a5 0054 
         0002a6 0049 
         0002a7 004D 
         0002a8 003A 
         0002a9 0020 
         0002aa 0054 
         0002ab 0065 
         0002ac 0073 
         0002ad 0074 
         0002ae 0020 
         0002af 0063 
         0002b0 0061 
         0002b1 0073 
         0002b2 0065 
         0002b3 0020 
         0002b4 0046 
         0002b5 0061 
         0002b6 0069 
         0002b7 006C 
         0002b8 0065 
         0002b9 0064 
         0002ba 0021 
         0002bb 0021 
         0002bc 000A 
         0002bd 0000 
     944              ;******************************************************************************
     945              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     946              ;******************************************************************************
     947                      .global _WDTIM_open
     948                      .global _WDTIM_start
     949                      .global _WDTIM_stop
     950                      .global _WDTIM_getCnt
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   34

     951                      .global _WDTIM_service
     952                      .global _WDTIM_config
     953                      .global _WDTIM_getConfig
     954                      .global _printf
     955              
     956              ;*******************************************************************************
     957              ;* TYPE INFORMATION                                                            *
     958              ;*******************************************************************************
     959              
     960              $C$DW$T$22      .dwtag  DW_TAG_enumeration_type
     961                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     962              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("WDT_INST_0"), DW_AT_const_value(0x00)
     963              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("WDT_INST_INVALID"), DW_AT_const_value(0x01)
     964                      .dwendtag $C$DW$T$22
     965              
     966              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("WDT_Instance")
     967                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     968                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     969              
     970              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     971                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0f)
     972              $C$DW$84        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     974                      .dwattr $C$DW$84, DW_AT_name("WDKCKLK")
     975                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_WDKCKLK")
     976                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     978              $C$DW$85        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     980                      .dwattr $C$DW$85, DW_AT_name("RSVD0")
     981                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_RSVD0")
     982                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     983                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     984              $C$DW$86        .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     986                      .dwattr $C$DW$86, DW_AT_name("WDKICK")
     987                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_WDKICK")
     988                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     989                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$87        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     992                      .dwattr $C$DW$87, DW_AT_name("RSVD1")
     993                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD1")
     994                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     995                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$88        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
     998                      .dwattr $C$DW$88, DW_AT_name("WDSVLR")
     999                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_WDSVLR")
    1000                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1001                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$89        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1004                      .dwattr $C$DW$89, DW_AT_name("RSVD2")
    1005                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_RSVD2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   35

    1006                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1007                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$90        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1010                      .dwattr $C$DW$90, DW_AT_name("WDSVR")
    1011                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_WDSVR")
    1012                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1013                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1014              $C$DW$91        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1016                      .dwattr $C$DW$91, DW_AT_name("RSVD3")
    1017                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_RSVD3")
    1018                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1019                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1020              $C$DW$92        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1022                      .dwattr $C$DW$92, DW_AT_name("WDENLOK")
    1023                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_WDENLOK")
    1024                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1025                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1026              $C$DW$93        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1028                      .dwattr $C$DW$93, DW_AT_name("RSVD4")
    1029                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RSVD4")
    1030                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1031                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$94        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1034                      .dwattr $C$DW$94, DW_AT_name("WDEN")
    1035                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_WDEN")
    1036                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1037                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$95        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1040                      .dwattr $C$DW$95, DW_AT_name("RSVD5")
    1041                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RSVD5")
    1042                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1043                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$96        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1046                      .dwattr $C$DW$96, DW_AT_name("WDPSLR")
    1047                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_WDPSLR")
    1048                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1049                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$97        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1052                      .dwattr $C$DW$97, DW_AT_name("RSVD6")
    1053                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD6")
    1054                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1055                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$98        .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1058                      .dwattr $C$DW$98, DW_AT_name("WDPS")
    1059                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_WDPS")
    1060                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   36

    1061                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1062                      .dwendtag $C$DW$T$21
    1063              
    1064              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtRegs")
    1065                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1066                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1067              $C$DW$99        .dwtag  DW_TAG_TI_far_type
    1068                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$24)
    1069              $C$DW$100       .dwtag  DW_TAG_TI_ioport_type
    1070                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$99)
    1071              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1072                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$100)
    1073              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1074                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1075                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1076              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtRegsOvly")
    1077                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1078                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1079              
    1080              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1081                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1082              $C$DW$101       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1084                      .dwattr $C$DW$101, DW_AT_name("wdtInstance")
    1085                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_wdtInstance")
    1086                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1088              $C$DW$102       .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
    1090                      .dwattr $C$DW$102, DW_AT_name("hwRegs")
    1091                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_hwRegs")
    1092                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1093                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1094                      .dwendtag $C$DW$T$28
    1095              
    1096              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtObj")
    1097                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    1098                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1099              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1100                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1101                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    1102              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtHandle")
    1103                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1104                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1105              
    1106              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1107                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1108              $C$DW$103       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$103, DW_AT_name("counter")
    1111                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_counter")
    1112                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$104       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   37

    1116                      .dwattr $C$DW$104, DW_AT_name("prescale")
    1117                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_prescale")
    1118                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1119                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1120                      .dwendtag $C$DW$T$29
    1121              
    1122              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("WDTIM_Config")
    1123                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$29)
    1124                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1125              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1126                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1127                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    1128              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1129                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1130                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1131                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1132              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1133                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1134                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1135                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1136              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1137                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1138                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1139                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1140              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1141                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1142                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1143                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1144              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1145                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1146                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1147                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1148              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1149                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$8)
    1150                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1151              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1152                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1153                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1154              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1155                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1156                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1157              $C$DW$105       .dwtag  DW_TAG_TI_far_type
    1158                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$33)
    1159              $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1160                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$105)
    1161              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1162                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1163                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1164                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1165              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1166                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1167                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1168              $C$DW$106       .dwtag  DW_TAG_TI_far_type
    1169                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1170              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:30 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt_example.asm                                                  PAGE   38

