TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE    1

    2978              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:15 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1544                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1545                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1546              
    1547              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1548                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1549              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1550              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1551              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1552              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1553              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1554                      .dwendtag $C$DW$T$32
    1555              
    1556              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1557                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1558                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1559              
    1560              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1561                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1562              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1563              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1564                      .dwendtag $C$DW$T$38
    1565              
    1566              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1567                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1568                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1569              
    1570              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1571                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1572              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1573              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1574              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1575              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1576              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1577                      .dwendtag $C$DW$T$41
    1578              
    1579              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1580                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1581                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1582              
    1583              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1584                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1585              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1586              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1587                      .dwendtag $C$DW$T$43
    1588              
    1589              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1590                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1591                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1592              
    1593              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1594                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   43

    1595              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1596              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1597                      .dwendtag $C$DW$T$45
    1598              
    1599              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1600                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1601                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1602              
    1603              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1604                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1605              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
    1606              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1607                      .dwendtag $C$DW$T$47
    1608              
    1609              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1610                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1611                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1612              
    1613              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1614                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1615              $C$DW$153       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    1617                      .dwattr $C$DW$153, DW_AT_name("LCDREVMIN")
    1618                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_LCDREVMIN")
    1619                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$154       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1623                      .dwattr $C$DW$154, DW_AT_name("LCDREVMAJ")
    1624                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1625                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$155       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1629                      .dwattr $C$DW$155, DW_AT_name("RSVD0")
    1630                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_RSVD0")
    1631                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1632                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$156       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    1635                      .dwattr $C$DW$156, DW_AT_name("LCDCR")
    1636                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_LCDCR")
    1637                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1638                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$157       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1641                      .dwattr $C$DW$157, DW_AT_name("RSVD1")
    1642                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RSVD1")
    1643                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1644                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$158       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1647                      .dwattr $C$DW$158, DW_AT_name("LCDSR")
    1648                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LCDSR")
    1649                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   44

    1650                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$159       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    1653                      .dwattr $C$DW$159, DW_AT_name("RSVD2")
    1654                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RSVD2")
    1655                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1656                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$160       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1659                      .dwattr $C$DW$160, DW_AT_name("LCDLIDDCR")
    1660                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1661                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1662                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$161       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
    1665                      .dwattr $C$DW$161, DW_AT_name("RSVD3")
    1666                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_RSVD3")
    1667                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1668                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$162       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1671                      .dwattr $C$DW$162, DW_AT_name("LCDLIDDCS0CONFIG0")
    1672                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1673                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1674                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$163       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    1677                      .dwattr $C$DW$163, DW_AT_name("LCDLIDDCS0CONFIG1")
    1678                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1679                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1680                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$164       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    1683                      .dwattr $C$DW$164, DW_AT_name("RSVD4")
    1684                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD4")
    1685                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1686                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$165       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1689                      .dwattr $C$DW$165, DW_AT_name("LCDLIDDCS0ADDR")
    1690                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1691                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1692                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$166       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1695                      .dwattr $C$DW$166, DW_AT_name("RSVD5")
    1696                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD5")
    1697                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1698                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$167       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1701                      .dwattr $C$DW$167, DW_AT_name("LCDLIDDCS0DATA")
    1702                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1703                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1704                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   45

    1705              $C$DW$168       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    1707                      .dwattr $C$DW$168, DW_AT_name("RSVD6")
    1708                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD6")
    1709                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1710                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$169       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1713                      .dwattr $C$DW$169, DW_AT_name("LCDLIDDCS1CONFIG0")
    1714                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1715                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1716                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$170       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1719                      .dwattr $C$DW$170, DW_AT_name("LCDLIDDCS1CONFIG1")
    1720                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    1721                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1722                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$171       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    1725                      .dwattr $C$DW$171, DW_AT_name("RSVD7")
    1726                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD7")
    1727                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1728                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$172       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1731                      .dwattr $C$DW$172, DW_AT_name("LCDLIDDCS1ADDR")
    1732                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1733                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1734                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$173       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    1737                      .dwattr $C$DW$173, DW_AT_name("RSVD8")
    1738                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD8")
    1739                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1740                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$174       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1743                      .dwattr $C$DW$174, DW_AT_name("LCDLIDDCS1DATA")
    1744                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1745                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1746                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$175       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    1749                      .dwattr $C$DW$175, DW_AT_name("RSVD9")
    1750                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD9")
    1751                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1752                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$176       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1755                      .dwattr $C$DW$176, DW_AT_name("LCDDMACR")
    1756                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_LCDDMACR")
    1757                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1758                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$177       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   46

    1760                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1761                      .dwattr $C$DW$177, DW_AT_name("RSVD10")
    1762                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_RSVD10")
    1763                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1764                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$178       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1767                      .dwattr $C$DW$178, DW_AT_name("LCDDMAFB0BAR0")
    1768                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1769                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1770                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$179       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1773                      .dwattr $C$DW$179, DW_AT_name("LCDDMAFB0BAR1")
    1774                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1775                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1776                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$180       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1779                      .dwattr $C$DW$180, DW_AT_name("RSVD11")
    1780                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD11")
    1781                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1782                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$181       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1785                      .dwattr $C$DW$181, DW_AT_name("LCDDMAFB0CAR0")
    1786                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1787                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1788                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$182       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1791                      .dwattr $C$DW$182, DW_AT_name("LCDDMAFB0CAR1")
    1792                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1793                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1794                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$183       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1797                      .dwattr $C$DW$183, DW_AT_name("RSVD12")
    1798                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RSVD12")
    1799                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1800                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$184       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1803                      .dwattr $C$DW$184, DW_AT_name("LCDDMAFB1BAR0")
    1804                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    1805                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1806                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$185       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1809                      .dwattr $C$DW$185, DW_AT_name("LCDDMAFB1BAR1")
    1810                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1811                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1812                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$186       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   47

    1815                      .dwattr $C$DW$186, DW_AT_name("RSVD13")
    1816                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RSVD13")
    1817                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1818                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$187       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    1821                      .dwattr $C$DW$187, DW_AT_name("LCDDMAFB1CAR0")
    1822                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1823                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1824                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$188       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1827                      .dwattr $C$DW$188, DW_AT_name("LCDDMAFB1CAR1")
    1828                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1829                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1830                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1831                      .dwendtag $C$DW$T$24
    1832              
    1833              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1834                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$24)
    1835                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1836              $C$DW$189       .dwtag  DW_TAG_TI_far_type
    1837                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$56)
    1838              $C$DW$190       .dwtag  DW_TAG_TI_ioport_type
    1839                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$189)
    1840              $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1841                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$190)
    1842              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1843                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1844                      .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    1845              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    1846                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1847                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1848              
    1849              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1850                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    1851              $C$DW$191       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$191, DW_AT_name("clkDiv")
    1854                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_clkDiv")
    1855                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$192       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$26)
    1859                      .dwattr $C$DW$192, DW_AT_name("fdoneIntEn")
    1860                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_fdoneIntEn")
    1861                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1862                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$193       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$28)
    1865                      .dwattr $C$DW$193, DW_AT_name("dmaCs0Cs1")
    1866                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    1867                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1868                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$194       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   48

    1870                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$30)
    1871                      .dwattr $C$DW$194, DW_AT_name("dmaEnable")
    1872                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_dmaEnable")
    1873                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1874                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$195       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1877                      .dwattr $C$DW$195, DW_AT_name("polControl")
    1878                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_polControl")
    1879                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1880                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$196       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$33)
    1883                      .dwattr $C$DW$196, DW_AT_name("modeSel")
    1884                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_modeSel")
    1885                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1886                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1887                      .dwendtag $C$DW$T$34
    1888              
    1889              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    1890                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    1891                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1892              
    1893              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1894                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    1895              $C$DW$197       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$197, DW_AT_name("wSu")
    1898                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_wSu")
    1899                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1901              $C$DW$198       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$198, DW_AT_name("wStrobe")
    1904                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_wStrobe")
    1905                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1906                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1907              $C$DW$199       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1909                      .dwattr $C$DW$199, DW_AT_name("wHold")
    1910                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_wHold")
    1911                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1912                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$200       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$200, DW_AT_name("rSu")
    1916                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rSu")
    1917                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1918                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1919              $C$DW$201       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$201, DW_AT_name("rStrobe")
    1922                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rStrobe")
    1923                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1924                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   49

    1925              $C$DW$202       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1927                      .dwattr $C$DW$202, DW_AT_name("rHold")
    1928                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rHold")
    1929                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1930                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1931              $C$DW$203       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$203, DW_AT_name("ta")
    1934                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ta")
    1935                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1936                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1937                      .dwendtag $C$DW$T$35
    1938              
    1939              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    1940                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    1941                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1942              
    1943              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1944                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    1945              $C$DW$204       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$3)
    1947                      .dwattr $C$DW$204, DW_AT_name("extendSetup")
    1948                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_extendSetup")
    1949                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$205       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$36)
    1953                      .dwattr $C$DW$205, DW_AT_name("config")
    1954                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_config")
    1955                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1956                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$206       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$37)
    1959                      .dwattr $C$DW$206, DW_AT_name("timingCs0")
    1960                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_timingCs0")
    1961                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1962                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$207       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$39)
    1965                      .dwattr $C$DW$207, DW_AT_name("useCs1")
    1966                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_useCs1")
    1967                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1968                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$208       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$37)
    1971                      .dwattr $C$DW$208, DW_AT_name("timingCs1")
    1972                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_timingCs1")
    1973                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1974                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1975                      .dwendtag $C$DW$T$40
    1976              
    1977              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    1978                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$40)
    1979                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   50

    1980              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1981                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1982                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1983              
    1984              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1985                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    1986              $C$DW$209       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    1988                      .dwattr $C$DW$209, DW_AT_name("burstSize")
    1989                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_burstSize")
    1990                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$210       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$44)
    1994                      .dwattr $C$DW$210, DW_AT_name("eofIntEn")
    1995                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_eofIntEn")
    1996                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1997                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$211       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$46)
    2000                      .dwattr $C$DW$211, DW_AT_name("bigEndian")
    2001                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_bigEndian")
    2002                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2003                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$212       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$48)
    2006                      .dwattr $C$DW$212, DW_AT_name("frameMode")
    2007                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_frameMode")
    2008                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2009                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$213       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$49)
    2012                      .dwattr $C$DW$213, DW_AT_name("fb0Base")
    2013                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_fb0Base")
    2014                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2015                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$214       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$49)
    2018                      .dwattr $C$DW$214, DW_AT_name("fb0Ceil")
    2019                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_fb0Ceil")
    2020                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2021                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$215       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$49)
    2024                      .dwattr $C$DW$215, DW_AT_name("fb1Base")
    2025                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_fb1Base")
    2026                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2027                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$216       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$49)
    2030                      .dwattr $C$DW$216, DW_AT_name("fb1Ceil")
    2031                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_fb1Ceil")
    2032                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2033                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2034                      .dwendtag $C$DW$T$50
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   51

    2035              
    2036              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    2037                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$50)
    2038                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2039              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2040                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2041                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    2042              
    2043              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2044                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    2045              $C$DW$217       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2047                      .dwattr $C$DW$217, DW_AT_name("EBSR")
    2048                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_EBSR")
    2049                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2051              $C$DW$218       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2053                      .dwattr $C$DW$218, DW_AT_name("RSVD0")
    2054                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RSVD0")
    2055                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2056                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2057              $C$DW$219       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2059                      .dwattr $C$DW$219, DW_AT_name("PCGCR1")
    2060                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PCGCR1")
    2061                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2062                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2063              $C$DW$220       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2065                      .dwattr $C$DW$220, DW_AT_name("PCGCR2")
    2066                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PCGCR2")
    2067                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2068                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2069              $C$DW$221       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2071                      .dwattr $C$DW$221, DW_AT_name("PSRCR")
    2072                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PSRCR")
    2073                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2074                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2075              $C$DW$222       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2077                      .dwattr $C$DW$222, DW_AT_name("PRCR")
    2078                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PRCR")
    2079                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2080                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2081              $C$DW$223       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$51)
    2083                      .dwattr $C$DW$223, DW_AT_name("RSVD1")
    2084                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RSVD1")
    2085                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2086                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2087              $C$DW$224       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    2089                      .dwattr $C$DW$224, DW_AT_name("TIAFR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   52

    2090                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_TIAFR")
    2091                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2092                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2093              $C$DW$225       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2095                      .dwattr $C$DW$225, DW_AT_name("RSVD2")
    2096                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RSVD2")
    2097                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2098                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2099              $C$DW$226       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2101                      .dwattr $C$DW$226, DW_AT_name("ODSCR")
    2102                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_ODSCR")
    2103                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2104                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2105              $C$DW$227       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2107                      .dwattr $C$DW$227, DW_AT_name("PDINHIBR1")
    2108                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_PDINHIBR1")
    2109                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2110                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2111              $C$DW$228       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2113                      .dwattr $C$DW$228, DW_AT_name("PDINHIBR2")
    2114                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_PDINHIBR2")
    2115                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2116                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$229       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2119                      .dwattr $C$DW$229, DW_AT_name("PDINHIBR3")
    2120                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PDINHIBR3")
    2121                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2122                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2123              $C$DW$230       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2125                      .dwattr $C$DW$230, DW_AT_name("DMA0CESR1")
    2126                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_DMA0CESR1")
    2127                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2128                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$231       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2131                      .dwattr $C$DW$231, DW_AT_name("DMA0CESR2")
    2132                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_DMA0CESR2")
    2133                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2134                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$232       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2137                      .dwattr $C$DW$232, DW_AT_name("DMA1CESR1")
    2138                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DMA1CESR1")
    2139                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2140                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2141              $C$DW$233       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2143                      .dwattr $C$DW$233, DW_AT_name("DMA1CESR2")
    2144                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DMA1CESR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   53

    2145                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2146                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$234       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2149                      .dwattr $C$DW$234, DW_AT_name("SDRAMCCR")
    2150                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_SDRAMCCR")
    2151                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2152                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2153              $C$DW$235       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2155                      .dwattr $C$DW$235, DW_AT_name("CCR2")
    2156                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_CCR2")
    2157                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2158                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$236       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2161                      .dwattr $C$DW$236, DW_AT_name("CGCR1")
    2162                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_CGCR1")
    2163                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2164                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2165              $C$DW$237       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    2167                      .dwattr $C$DW$237, DW_AT_name("CGICR")
    2168                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_CGICR")
    2169                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2170                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$238       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2173                      .dwattr $C$DW$238, DW_AT_name("CGCR2")
    2174                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_CGCR2")
    2175                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2176                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2177              $C$DW$239       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2179                      .dwattr $C$DW$239, DW_AT_name("CGOCR")
    2180                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_CGOCR")
    2181                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2182                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2183              $C$DW$240       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2185                      .dwattr $C$DW$240, DW_AT_name("CCSSR")
    2186                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_CCSSR")
    2187                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2188                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2189              $C$DW$241       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2191                      .dwattr $C$DW$241, DW_AT_name("RSVD3")
    2192                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RSVD3")
    2193                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2194                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2195              $C$DW$242       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2197                      .dwattr $C$DW$242, DW_AT_name("ECDR")
    2198                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_ECDR")
    2199                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   54

    2200                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$243       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2203                      .dwattr $C$DW$243, DW_AT_name("RSVD4")
    2204                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_RSVD4")
    2205                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2206                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2207              $C$DW$244       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2209                      .dwattr $C$DW$244, DW_AT_name("RAMSLPMDCNTLR1")
    2210                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2211                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2212                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$245       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2215                      .dwattr $C$DW$245, DW_AT_name("RSVD5")
    2216                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_RSVD5")
    2217                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2218                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2219              $C$DW$246       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2221                      .dwattr $C$DW$246, DW_AT_name("RAMSLPMDCNTLR2")
    2222                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2223                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2224                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2225              $C$DW$247       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2227                      .dwattr $C$DW$247, DW_AT_name("RAMSLPMDCNTLR3")
    2228                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2229                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2230                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2231              $C$DW$248       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2233                      .dwattr $C$DW$248, DW_AT_name("RAMSLPMDCNTLR4")
    2234                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2235                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2236                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2237              $C$DW$249       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2239                      .dwattr $C$DW$249, DW_AT_name("RAMSLPMDCNTLR5")
    2240                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2241                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2242                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$250       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
    2245                      .dwattr $C$DW$250, DW_AT_name("RSVD6")
    2246                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_RSVD6")
    2247                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2248                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$251       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2251                      .dwattr $C$DW$251, DW_AT_name("DMAIFR")
    2252                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DMAIFR")
    2253                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2254                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   55

    2255              $C$DW$252       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2257                      .dwattr $C$DW$252, DW_AT_name("DMAIER")
    2258                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DMAIER")
    2259                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2260                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2261              $C$DW$253       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2263                      .dwattr $C$DW$253, DW_AT_name("USBSCR")
    2264                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_USBSCR")
    2265                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2266                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2267              $C$DW$254       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2269                      .dwattr $C$DW$254, DW_AT_name("ESCR")
    2270                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_ESCR")
    2271                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2272                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2273              $C$DW$255       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
    2275                      .dwattr $C$DW$255, DW_AT_name("RSVD7")
    2276                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RSVD7")
    2277                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2278                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$256       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2281                      .dwattr $C$DW$256, DW_AT_name("DMA2CESR1")
    2282                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DMA2CESR1")
    2283                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2284                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$257       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2287                      .dwattr $C$DW$257, DW_AT_name("DMA2CESR2")
    2288                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_DMA2CESR2")
    2289                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2290                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2291              $C$DW$258       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2293                      .dwattr $C$DW$258, DW_AT_name("DMA3CESR1")
    2294                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_DMA3CESR1")
    2295                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2296                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2297              $C$DW$259       .dwtag  DW_TAG_member
    2298                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2299                      .dwattr $C$DW$259, DW_AT_name("DMA3CESR2")
    2300                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_DMA3CESR2")
    2301                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2302                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2303              $C$DW$260       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2305                      .dwattr $C$DW$260, DW_AT_name("CLKSTOP")
    2306                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_CLKSTOP")
    2307                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2308                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2309              $C$DW$261       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   56

    2310                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$52)
    2311                      .dwattr $C$DW$261, DW_AT_name("RSVD8")
    2312                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_RSVD8")
    2313                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2314                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$262       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2317                      .dwattr $C$DW$262, DW_AT_name("DIEIDR0")
    2318                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_DIEIDR0")
    2319                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2320                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$263       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2323                      .dwattr $C$DW$263, DW_AT_name("DIEIDR1")
    2324                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_DIEIDR1")
    2325                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2326                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2327              $C$DW$264       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2329                      .dwattr $C$DW$264, DW_AT_name("DIEIDR2")
    2330                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_DIEIDR2")
    2331                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2332                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2333              $C$DW$265       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2335                      .dwattr $C$DW$265, DW_AT_name("DIEIDR3")
    2336                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_DIEIDR3")
    2337                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2338                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2339              $C$DW$266       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2341                      .dwattr $C$DW$266, DW_AT_name("DIEIDR4")
    2342                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_DIEIDR4")
    2343                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2344                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$267       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2347                      .dwattr $C$DW$267, DW_AT_name("DIEIDR5")
    2348                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_DIEIDR5")
    2349                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2350                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$268       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2353                      .dwattr $C$DW$268, DW_AT_name("DIEIDR6")
    2354                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_DIEIDR6")
    2355                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2356                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$269       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2359                      .dwattr $C$DW$269, DW_AT_name("DIEIDR7")
    2360                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DIEIDR7")
    2361                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2362                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2363                      .dwendtag $C$DW$T$53
    2364              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   57

    2365              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2366                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$53)
    2367                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2368              $C$DW$270       .dwtag  DW_TAG_TI_far_type
    2369                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$67)
    2370              $C$DW$271       .dwtag  DW_TAG_TI_ioport_type
    2371                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$270)
    2372              $C$DW$T$68      .dwtag  DW_TAG_volatile_type
    2373                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$271)
    2374              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2375                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2376                      .dwattr $C$DW$T$69, DW_AT_address_class(0x10)
    2377              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2378                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2379                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2380              
    2381              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2382                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
    2383              $C$DW$272       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$54)
    2385                      .dwattr $C$DW$272, DW_AT_name("RSVD0")
    2386                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_RSVD0")
    2387                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2389              $C$DW$273       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2391                      .dwattr $C$DW$273, DW_AT_name("IODIR1")
    2392                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_IODIR1")
    2393                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2394                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$274       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2397                      .dwattr $C$DW$274, DW_AT_name("IODIR2")
    2398                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_IODIR2")
    2399                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2400                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2401              $C$DW$275       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2403                      .dwattr $C$DW$275, DW_AT_name("IOINDATA1")
    2404                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_IOINDATA1")
    2405                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2406                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2407              $C$DW$276       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2409                      .dwattr $C$DW$276, DW_AT_name("IOINDATA2")
    2410                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_IOINDATA2")
    2411                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2412                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2413              $C$DW$277       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2415                      .dwattr $C$DW$277, DW_AT_name("IOOUTDATA1")
    2416                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_IOOUTDATA1")
    2417                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2418                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2419              $C$DW$278       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   58

    2420                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2421                      .dwattr $C$DW$278, DW_AT_name("IOOUTDATA2")
    2422                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_IOOUTDATA2")
    2423                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2424                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2425              $C$DW$279       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2427                      .dwattr $C$DW$279, DW_AT_name("IOINTEDG1")
    2428                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_IOINTEDG1")
    2429                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2430                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2431              $C$DW$280       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2433                      .dwattr $C$DW$280, DW_AT_name("IOINTEDG2")
    2434                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_IOINTEDG2")
    2435                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2436                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2437              $C$DW$281       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2439                      .dwattr $C$DW$281, DW_AT_name("IOINTEN1")
    2440                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_IOINTEN1")
    2441                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2442                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2443              $C$DW$282       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2445                      .dwattr $C$DW$282, DW_AT_name("IOINTEN2")
    2446                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_IOINTEN2")
    2447                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2448                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2449              $C$DW$283       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2451                      .dwattr $C$DW$283, DW_AT_name("IOINTFLG1")
    2452                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_IOINTFLG1")
    2453                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2454                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2455              $C$DW$284       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2457                      .dwattr $C$DW$284, DW_AT_name("IOINTFLG2")
    2458                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_IOINTFLG2")
    2459                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2460                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2461                      .dwendtag $C$DW$T$55
    2462              
    2463              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    2464                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$55)
    2465                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2466              $C$DW$285       .dwtag  DW_TAG_TI_far_type
    2467                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$71)
    2468              $C$DW$286       .dwtag  DW_TAG_TI_ioport_type
    2469                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$285)
    2470              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2471                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$286)
    2472              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2473                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2474                      .dwattr $C$DW$T$73, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   59

    2475              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    2476                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2477                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2478              
    2479              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2480                      .dwattr $C$DW$T$62, DW_AT_name("CSL_LcdcObj")
    2481                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2482              $C$DW$287       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$59)
    2484                      .dwattr $C$DW$287, DW_AT_name("regs")
    2485                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_regs")
    2486                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$288       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$61)
    2490                      .dwattr $C$DW$288, DW_AT_name("perNum")
    2491                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_perNum")
    2492                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2493                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2494                      .dwendtag $C$DW$T$62
    2495              
    2496              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2497                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$62)
    2498                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2499              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2500                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2501                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    2502              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2503                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2504                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2505              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2506                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2507              
    2508              $C$DW$T$88      .dwtag  DW_TAG_subroutine_type
    2509                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2510              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    2511                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2512                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    2513              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2514                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2515                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2516              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2517                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2518                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2519                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2520              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2521                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2522                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2523                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2524              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2525                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2526                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2527                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2528              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2529                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_DmaIntcExample.asm                                          PAGE   60

    2530                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2531                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2532              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2533                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2534                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2535                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2536              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2537                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2538                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2539              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2540                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2541                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2542              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2543                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$60)
