TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE    1

    8420              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:15 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7676                      .dwattr $C$DW$715, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lc
    7677                      .dwattr $C$DW$715, DW_AT_TI_begin_line(0x4b8)
    7678                      .dwattr $C$DW$715, DW_AT_TI_end_line(0x4bf)
    7679              $C$DW$716       .dwtag  DW_TAG_TI_loop_range
    7680                      .dwattr $C$DW$716, DW_AT_low_pc($C$DW$L$_draw_65K_colorbar$2$B)
    7681                      .dwattr $C$DW$716, DW_AT_high_pc($C$DW$L$_draw_65K_colorbar$2$E)
    7682              $C$DW$717       .dwtag  DW_TAG_TI_loop_range
    7683                      .dwattr $C$DW$717, DW_AT_low_pc($C$DW$L$_draw_65K_colorbar$4$B)
    7684                      .dwattr $C$DW$717, DW_AT_high_pc($C$DW$L$_draw_65K_colorbar$4$E)
    7685              
    7686              $C$DW$718       .dwtag  DW_TAG_TI_loop
    7687                      .dwattr $C$DW$718, DW_AT_name("F:\eZdsp_DBG\tmp1\c55x-sim2\foo\Debug\lcdc_panel.asm:$C$L117:2:1538287
    7688                      .dwattr $C$DW$718, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lc
    7689                      .dwattr $C$DW$718, DW_AT_TI_begin_line(0x4ba)
    7690                      .dwattr $C$DW$718, DW_AT_TI_end_line(0x4be)
    7691              $C$DW$719       .dwtag  DW_TAG_TI_loop_range
    7692                      .dwattr $C$DW$719, DW_AT_low_pc($C$DW$L$_draw_65K_colorbar$3$B)
    7693                      .dwattr $C$DW$719, DW_AT_high_pc($C$DW$L$_draw_65K_colorbar$3$E)
    7694                      .dwendtag $C$DW$718
    7695              
    7696                      .dwendtag $C$DW$715
    7697              
    7698                      .dwattr $C$DW$658, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/ccs_v4.0_examples/lcd/
    7699                      .dwattr $C$DW$658, DW_AT_TI_end_line(0x4fd)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  159

    7700                      .dwattr $C$DW$658, DW_AT_TI_end_column(0x01)
    7701                      .dwendentry
    7702                      .dwendtag $C$DW$658
    7703              
    7704              ;******************************************************************************
    7705              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    7706              ;******************************************************************************
    7707                      .global _hLcdc
    7708              
    7709              ;*******************************************************************************
    7710              ;* TYPE INFORMATION                                                            *
    7711              ;*******************************************************************************
    7712              
    7713              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    7714                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    7715              $C$DW$720       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS0"), DW_AT_const_value(0x00)
    7716              $C$DW$721       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_CS1"), DW_AT_const_value(0x01)
    7717                      .dwendtag $C$DW$T$32
    7718              
    7719              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcChipSelect")
    7720                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    7721                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7722              
    7723              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    7724                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    7725              $C$DW$722       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_256"), DW_AT_const_value(0x00)
    7726              $C$DW$723       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_65K"), DW_AT_const_value(0x01)
    7727              $C$DW$724       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_1ST"), DW_AT_const_value(0x02)
    7728              $C$DW$725       .dwtag  DW_TAG_enumerator, DW_AT_name("COLOURS_262K_2ND"), DW_AT_const_value(0x03)
    7729                      .dwendtag $C$DW$T$34
    7730              
    7731              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("eColourMode")
    7732                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    7733                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    7734              
    7735              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    7736                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    7737              $C$DW$726       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_NP"), DW_AT_const_value(0x00)
    7738              $C$DW$727       .dwtag  DW_TAG_enumerator, DW_AT_name("I_VSL_PS"), DW_AT_const_value(0x12)
    7739              $C$DW$728       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_NP"), DW_AT_const_value(0x05)
    7740              $C$DW$729       .dwtag  DW_TAG_enumerator, DW_AT_name("E_VSL_PS"), DW_AT_const_value(0x15)
    7741                      .dwendtag $C$DW$T$36
    7742              
    7743              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("ePowerSaveMode")
    7744                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    7745                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7746              
    7747              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7748                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    7749              $C$DW$730       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$20)
    7751                      .dwattr $C$DW$730, DW_AT_name("LCDREVMIN")
    7752                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_LCDREVMIN")
    7753                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7754                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  160

    7755              $C$DW$731       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$20)
    7757                      .dwattr $C$DW$731, DW_AT_name("LCDREVMAJ")
    7758                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_LCDREVMAJ")
    7759                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7760                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7761              $C$DW$732       .dwtag  DW_TAG_member
    7762                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$21)
    7763                      .dwattr $C$DW$732, DW_AT_name("RSVD0")
    7764                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_RSVD0")
    7765                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7766                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7767              $C$DW$733       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$20)
    7769                      .dwattr $C$DW$733, DW_AT_name("LCDCR")
    7770                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_LCDCR")
    7771                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7772                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7773              $C$DW$734       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$22)
    7775                      .dwattr $C$DW$734, DW_AT_name("RSVD1")
    7776                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_RSVD1")
    7777                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7778                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7779              $C$DW$735       .dwtag  DW_TAG_member
    7780                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$20)
    7781                      .dwattr $C$DW$735, DW_AT_name("LCDSR")
    7782                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_LCDSR")
    7783                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7784                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7785              $C$DW$736       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$22)
    7787                      .dwattr $C$DW$736, DW_AT_name("RSVD2")
    7788                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_RSVD2")
    7789                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7790                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7791              $C$DW$737       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$20)
    7793                      .dwattr $C$DW$737, DW_AT_name("LCDLIDDCR")
    7794                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_LCDLIDDCR")
    7795                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7796                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7797              $C$DW$738       .dwtag  DW_TAG_member
    7798                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$22)
    7799                      .dwattr $C$DW$738, DW_AT_name("RSVD3")
    7800                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_RSVD3")
    7801                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7802                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7803              $C$DW$739       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$20)
    7805                      .dwattr $C$DW$739, DW_AT_name("LCDLIDDCS0CONFIG0")
    7806                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    7807                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7808                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7809              $C$DW$740       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  161

    7810                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$20)
    7811                      .dwattr $C$DW$740, DW_AT_name("LCDLIDDCS0CONFIG1")
    7812                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    7813                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7814                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7815              $C$DW$741       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$21)
    7817                      .dwattr $C$DW$741, DW_AT_name("RSVD4")
    7818                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_RSVD4")
    7819                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7820                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7821              $C$DW$742       .dwtag  DW_TAG_member
    7822                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$20)
    7823                      .dwattr $C$DW$742, DW_AT_name("LCDLIDDCS0ADDR")
    7824                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    7825                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7826                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7827              $C$DW$743       .dwtag  DW_TAG_member
    7828                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$22)
    7829                      .dwattr $C$DW$743, DW_AT_name("RSVD5")
    7830                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_RSVD5")
    7831                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7832                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7833              $C$DW$744       .dwtag  DW_TAG_member
    7834                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$20)
    7835                      .dwattr $C$DW$744, DW_AT_name("LCDLIDDCS0DATA")
    7836                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    7837                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7838                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7839              $C$DW$745       .dwtag  DW_TAG_member
    7840                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$22)
    7841                      .dwattr $C$DW$745, DW_AT_name("RSVD6")
    7842                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_RSVD6")
    7843                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7844                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7845              $C$DW$746       .dwtag  DW_TAG_member
    7846                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$20)
    7847                      .dwattr $C$DW$746, DW_AT_name("LCDLIDDCS1CONFIG0")
    7848                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    7849                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7850                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7851              $C$DW$747       .dwtag  DW_TAG_member
    7852                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$20)
    7853                      .dwattr $C$DW$747, DW_AT_name("LCDLIDDCS1CONFIG1")
    7854                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    7855                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7856                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7857              $C$DW$748       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$21)
    7859                      .dwattr $C$DW$748, DW_AT_name("RSVD7")
    7860                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_RSVD7")
    7861                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7862                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7863              $C$DW$749       .dwtag  DW_TAG_member
    7864                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  162

    7865                      .dwattr $C$DW$749, DW_AT_name("LCDLIDDCS1ADDR")
    7866                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    7867                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7868                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7869              $C$DW$750       .dwtag  DW_TAG_member
    7870                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$22)
    7871                      .dwattr $C$DW$750, DW_AT_name("RSVD8")
    7872                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_RSVD8")
    7873                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7874                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7875              $C$DW$751       .dwtag  DW_TAG_member
    7876                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$20)
    7877                      .dwattr $C$DW$751, DW_AT_name("LCDLIDDCS1DATA")
    7878                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    7879                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7880                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7881              $C$DW$752       .dwtag  DW_TAG_member
    7882                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$23)
    7883                      .dwattr $C$DW$752, DW_AT_name("RSVD9")
    7884                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_RSVD9")
    7885                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    7886                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7887              $C$DW$753       .dwtag  DW_TAG_member
    7888                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$20)
    7889                      .dwattr $C$DW$753, DW_AT_name("LCDDMACR")
    7890                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_LCDDMACR")
    7891                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7892                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7893              $C$DW$754       .dwtag  DW_TAG_member
    7894                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$22)
    7895                      .dwattr $C$DW$754, DW_AT_name("RSVD10")
    7896                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_RSVD10")
    7897                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    7898                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7899              $C$DW$755       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$20)
    7901                      .dwattr $C$DW$755, DW_AT_name("LCDDMAFB0BAR0")
    7902                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    7903                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7904                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7905              $C$DW$756       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$20)
    7907                      .dwattr $C$DW$756, DW_AT_name("LCDDMAFB0BAR1")
    7908                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    7909                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    7910                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7911              $C$DW$757       .dwtag  DW_TAG_member
    7912                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$21)
    7913                      .dwattr $C$DW$757, DW_AT_name("RSVD11")
    7914                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_RSVD11")
    7915                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7916                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7917              $C$DW$758       .dwtag  DW_TAG_member
    7918                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$20)
    7919                      .dwattr $C$DW$758, DW_AT_name("LCDDMAFB0CAR0")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  163

    7920                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    7921                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7922                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7923              $C$DW$759       .dwtag  DW_TAG_member
    7924                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$20)
    7925                      .dwattr $C$DW$759, DW_AT_name("LCDDMAFB0CAR1")
    7926                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    7927                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    7928                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7929              $C$DW$760       .dwtag  DW_TAG_member
    7930                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$21)
    7931                      .dwattr $C$DW$760, DW_AT_name("RSVD12")
    7932                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RSVD12")
    7933                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7934                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7935              $C$DW$761       .dwtag  DW_TAG_member
    7936                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$20)
    7937                      .dwattr $C$DW$761, DW_AT_name("LCDDMAFB1BAR0")
    7938                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    7939                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7940                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7941              $C$DW$762       .dwtag  DW_TAG_member
    7942                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$20)
    7943                      .dwattr $C$DW$762, DW_AT_name("LCDDMAFB1BAR1")
    7944                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    7945                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    7946                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7947              $C$DW$763       .dwtag  DW_TAG_member
    7948                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$21)
    7949                      .dwattr $C$DW$763, DW_AT_name("RSVD13")
    7950                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_RSVD13")
    7951                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7952                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7953              $C$DW$764       .dwtag  DW_TAG_member
    7954                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$20)
    7955                      .dwattr $C$DW$764, DW_AT_name("LCDDMAFB1CAR0")
    7956                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    7957                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7958                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7959              $C$DW$765       .dwtag  DW_TAG_member
    7960                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$20)
    7961                      .dwattr $C$DW$765, DW_AT_name("LCDDMAFB1CAR1")
    7962                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    7963                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    7964                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7965                      .dwendtag $C$DW$T$24
    7966              
    7967              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    7968                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    7969                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    7970              $C$DW$766       .dwtag  DW_TAG_TI_far_type
    7971                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$25)
    7972              $C$DW$767       .dwtag  DW_TAG_TI_ioport_type
    7973                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$766)
    7974              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  164

    7975                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$767)
    7976              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    7977                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    7978                      .dwattr $C$DW$T$27, DW_AT_address_class(0x10)
    7979              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    7980                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    7981                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    7982              
    7983              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7984                      .dwattr $C$DW$T$31, DW_AT_name("CSL_LcdcObj")
    7985                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    7986              $C$DW$768       .dwtag  DW_TAG_member
    7987                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$28)
    7988                      .dwattr $C$DW$768, DW_AT_name("regs")
    7989                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_regs")
    7990                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7991                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7992              $C$DW$769       .dwtag  DW_TAG_member
    7993                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$30)
    7994                      .dwattr $C$DW$769, DW_AT_name("perNum")
    7995                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_perNum")
    7996                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7997                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7998                      .dwendtag $C$DW$T$31
    7999              
    8000              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    8001                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    8002                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8003              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    8004                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    8005                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    8006              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    8007                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    8008                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8009              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    8010                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    8011              $C$DW$T$4       .dwtag  DW_TAG_base_type
    8012                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    8013                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    8014                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    8015              $C$DW$T$5       .dwtag  DW_TAG_base_type
    8016                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    8017                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    8018                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    8019              $C$DW$T$6       .dwtag  DW_TAG_base_type
    8020                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    8021                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    8022                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    8023              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    8024                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$6)
    8025                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    8026              $C$DW$T$7       .dwtag  DW_TAG_base_type
    8027                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    8028                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    8029                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
lcdc_panel.asm                                                       PAGE  165

    8030              $C$DW$T$8       .dwtag  DW_TAG_base_type
    8031                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    8032                      .dwattr $C$DW$T$8, DW_AT_name("short")
    8033                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    8034              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    8035                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$8)
    8036                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    8037              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    8038                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    8039                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    8040              $C$DW$T$9       .dwtag  DW_TAG_base_type
    8041                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    8042                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    8043                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    8044              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    8045                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    8046                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    8047              $C$DW$770       .dwtag  DW_TAG_TI_far_type
