TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE    1

    1666              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         0000b5 0034 
         0000b6 0078 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   22

         0000b7 0020 
         0000b8 0054 
         0000b9 0065 
         0000ba 0073 
         0000bb 0074 
         0000bc 0020 
         0000bd 004C 
         0000be 006F 
         0000bf 0063 
         0000c0 006B 
         0000c1 0020 
         0000c2 004D 
         0000c3 006F 
         0000c4 006E 
         0000c5 0020 
         0000c6 0077 
         0000c7 0069 
         0000c8 006C 
         0000c9 006C 
         0000ca 0020 
         0000cb 0067 
         0000cc 0065 
         0000cd 0074 
         0000ce 0020 
         0000cf 0073 
         0000d0 0065 
         0000d1 0074 
         0000d2 0020 
         0000d3 0061 
         0000d4 0066 
         0000d5 0074 
         0000d6 0065 
         0000d7 0072 
         0000d8 0020 
         0000d9 0050 
         0000da 004C 
         0000db 004C 
         0000dc 0020 
         0000dd 0069 
         0000de 0073 
         0000df 0020 
         0000e0 0075 
         0000e1 0070 
         0000e2 000A 
     819 0000e3 0000          .string 0
     820                      .align  2
     821 0000e4 0050  $C$FSL8:        .string "PLL bypass failed:%d",10,0
         0000e5 004C 
         0000e6 004C 
         0000e7 0020 
         0000e8 0062 
         0000e9 0079 
         0000ea 0070 
         0000eb 0061 
         0000ec 0073 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   23

         0000ed 0073 
         0000ee 0020 
         0000ef 0066 
         0000f0 0061 
         0000f1 0069 
         0000f2 006C 
         0000f3 0065 
         0000f4 0064 
         0000f5 003A 
         0000f6 0025 
         0000f7 0064 
         0000f8 000A 
         0000f9 0000 
     822                      .align  2
     823 0000fa 0050  $C$FSL9:        .string "PLL enable failed:%d",10,0
         0000fb 004C 
         0000fc 004C 
         0000fd 0020 
         0000fe 0065 
         0000ff 006E 
         000100 0061 
         000101 0062 
         000102 006C 
         000103 0065 
         000104 0020 
         000105 0066 
         000106 0061 
         000107 0069 
         000108 006C 
         000109 0065 
         00010a 0064 
         00010b 003A 
         00010c 0025 
         00010d 0064 
         00010e 000A 
         00010f 0000 
     824                      .align  2
     825 000110 0043  $C$FSL10:       .string "CSL PLL TEST",10,10,0
         000111 0053 
         000112 004C 
         000113 0020 
         000114 0050 
         000115 004C 
         000116 004C 
         000117 0020 
         000118 0054 
         000119 0045 
         00011a 0053 
         00011b 0054 
         00011c 000A 
         00011d 000A 
         00011e 0000 
     826                      .align  2
     827 000120 000A  $C$FSL11:       .string 10,"CSL PLL TEST PASSED",10,0
         000121 0043 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   24

         000122 0053 
         000123 004C 
         000124 0020 
         000125 0050 
         000126 004C 
         000127 004C 
         000128 0020 
         000129 0054 
         00012a 0045 
         00012b 0053 
         00012c 0054 
         00012d 0020 
         00012e 0050 
         00012f 0041 
         000130 0053 
         000131 0053 
         000132 0045 
         000133 0044 
         000134 000A 
         000135 0000 
     828                      .align  2
     829 000136 000A  $C$FSL12:       .string 10,"CSL PLL TEST FAILED",10,0
         000137 0043 
         000138 0053 
         000139 004C 
         00013a 0020 
         00013b 0050 
         00013c 004C 
         00013d 004C 
         00013e 0020 
         00013f 0054 
         000140 0045 
         000141 0053 
         000142 0054 
         000143 0020 
         000144 0046 
         000145 0041 
         000146 0049 
         000147 004C 
         000148 0045 
         000149 0044 
         00014a 000A 
         00014b 0000 
     830              ;******************************************************************************
     831              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     832              ;******************************************************************************
     833                      .global _printf
     834                      .global _PLL_init
     835                      .global _PLL_config
     836                      .global _PLL_enable
     837                      .global _PLL_bypass
     838                      .global _PLL_reset
     839              
     840              ;*******************************************************************************
     841              ;* TYPE INFORMATION                                                            *
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   25

     842              ;*******************************************************************************
     843              
     844              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     845                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     846              $C$DW$62        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$62, DW_AT_name("PLLCNTL1")
     849                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PLLCNTL1")
     850                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$63        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$63, DW_AT_name("PLLINCNTL")
     855                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PLLINCNTL")
     856                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     857                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$64        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$64, DW_AT_name("PLLCNTL2")
     861                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PLLCNTL2")
     862                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     863                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$65        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$65, DW_AT_name("PLLOUTCNTL")
     867                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PLLOUTCNTL")
     868                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     869                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     870                      .dwendtag $C$DW$T$20
     871              
     872              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
     873                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
     874                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     875              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     876                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     877                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     878              
     879              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     880                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
     881              $C$DW$66        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     883                      .dwattr $C$DW$66, DW_AT_name("EBSR")
     884                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_EBSR")
     885                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$67        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     889                      .dwattr $C$DW$67, DW_AT_name("RSVD0")
     890                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_RSVD0")
     891                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     892                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$68        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     895                      .dwattr $C$DW$68, DW_AT_name("PCGCR1")
     896                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PCGCR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   26

     897                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     898                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     899              $C$DW$69        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     901                      .dwattr $C$DW$69, DW_AT_name("PCGCR2")
     902                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PCGCR2")
     903                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     904                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$70        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     907                      .dwattr $C$DW$70, DW_AT_name("PSRCR")
     908                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PSRCR")
     909                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     910                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     911              $C$DW$71        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     913                      .dwattr $C$DW$71, DW_AT_name("PRCR")
     914                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PRCR")
     915                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     916                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$72        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
     919                      .dwattr $C$DW$72, DW_AT_name("RSVD1")
     920                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD1")
     921                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     922                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$73        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     925                      .dwattr $C$DW$73, DW_AT_name("TIAFR")
     926                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_TIAFR")
     927                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     928                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$74        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     931                      .dwattr $C$DW$74, DW_AT_name("RSVD2")
     932                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_RSVD2")
     933                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     934                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$75        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     937                      .dwattr $C$DW$75, DW_AT_name("ODSCR")
     938                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ODSCR")
     939                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     940                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$76        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     943                      .dwattr $C$DW$76, DW_AT_name("PDINHIBR1")
     944                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PDINHIBR1")
     945                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     946                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$77        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
     949                      .dwattr $C$DW$77, DW_AT_name("PDINHIBR2")
     950                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PDINHIBR2")
     951                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   27

     952                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     953              $C$DW$78        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
     955                      .dwattr $C$DW$78, DW_AT_name("PDINHIBR3")
     956                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PDINHIBR3")
     957                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     958                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     959              $C$DW$79        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
     961                      .dwattr $C$DW$79, DW_AT_name("DMA0CESR1")
     962                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_DMA0CESR1")
     963                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     964                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     965              $C$DW$80        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
     967                      .dwattr $C$DW$80, DW_AT_name("DMA0CESR2")
     968                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_DMA0CESR2")
     969                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     970                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     971              $C$DW$81        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
     973                      .dwattr $C$DW$81, DW_AT_name("DMA1CESR1")
     974                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_DMA1CESR1")
     975                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     976                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     977              $C$DW$82        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     979                      .dwattr $C$DW$82, DW_AT_name("DMA1CESR2")
     980                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_DMA1CESR2")
     981                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     982                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$83        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
     985                      .dwattr $C$DW$83, DW_AT_name("SDRAMCCR")
     986                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SDRAMCCR")
     987                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     988                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$84        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
     991                      .dwattr $C$DW$84, DW_AT_name("CCR2")
     992                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CCR2")
     993                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     994                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$85        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     997                      .dwattr $C$DW$85, DW_AT_name("CGCR1")
     998                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CGCR1")
     999                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1000                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$86        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1003                      .dwattr $C$DW$86, DW_AT_name("CGICR")
    1004                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CGICR")
    1005                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1006                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   28

    1007              $C$DW$87        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1009                      .dwattr $C$DW$87, DW_AT_name("CGCR2")
    1010                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CGCR2")
    1011                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1012                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1013              $C$DW$88        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1015                      .dwattr $C$DW$88, DW_AT_name("CGOCR")
    1016                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CGOCR")
    1017                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1018                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1019              $C$DW$89        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1021                      .dwattr $C$DW$89, DW_AT_name("CCSSR")
    1022                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CCSSR")
    1023                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1024                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$90        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1027                      .dwattr $C$DW$90, DW_AT_name("RSVD3")
    1028                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD3")
    1029                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1030                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$91        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1033                      .dwattr $C$DW$91, DW_AT_name("ECDR")
    1034                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ECDR")
    1035                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1036                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1037              $C$DW$92        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1039                      .dwattr $C$DW$92, DW_AT_name("RSVD4")
    1040                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_RSVD4")
    1041                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1042                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$93        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1045                      .dwattr $C$DW$93, DW_AT_name("RAMSLPMDCNTLR1")
    1046                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1047                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1048                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1049              $C$DW$94        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1051                      .dwattr $C$DW$94, DW_AT_name("RSVD5")
    1052                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RSVD5")
    1053                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1054                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1055              $C$DW$95        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1057                      .dwattr $C$DW$95, DW_AT_name("RAMSLPMDCNTLR2")
    1058                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1059                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1060                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$96        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   29

    1062                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1063                      .dwattr $C$DW$96, DW_AT_name("RAMSLPMDCNTLR3")
    1064                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1065                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1066                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1067              $C$DW$97        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1069                      .dwattr $C$DW$97, DW_AT_name("RAMSLPMDCNTLR4")
    1070                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1071                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1072                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1073              $C$DW$98        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1075                      .dwattr $C$DW$98, DW_AT_name("RAMSLPMDCNTLR5")
    1076                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1077                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1078                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$99        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$23)
    1081                      .dwattr $C$DW$99, DW_AT_name("RSVD6")
    1082                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_RSVD6")
    1083                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1084                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$100       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1087                      .dwattr $C$DW$100, DW_AT_name("DMAIFR")
    1088                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DMAIFR")
    1089                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1090                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$101       .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1093                      .dwattr $C$DW$101, DW_AT_name("DMAIER")
    1094                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_DMAIER")
    1095                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1096                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$102       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1099                      .dwattr $C$DW$102, DW_AT_name("USBSCR")
    1100                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_USBSCR")
    1101                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1102                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$103       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1105                      .dwattr $C$DW$103, DW_AT_name("ESCR")
    1106                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ESCR")
    1107                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1108                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$104       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    1111                      .dwattr $C$DW$104, DW_AT_name("RSVD7")
    1112                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_RSVD7")
    1113                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1114                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$105       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   30

    1117                      .dwattr $C$DW$105, DW_AT_name("DMA2CESR1")
    1118                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DMA2CESR1")
    1119                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1120                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$106       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1123                      .dwattr $C$DW$106, DW_AT_name("DMA2CESR2")
    1124                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DMA2CESR2")
    1125                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1126                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$107       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1129                      .dwattr $C$DW$107, DW_AT_name("DMA3CESR1")
    1130                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_DMA3CESR1")
    1131                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1132                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$108       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1135                      .dwattr $C$DW$108, DW_AT_name("DMA3CESR2")
    1136                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_DMA3CESR2")
    1137                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1138                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1139              $C$DW$109       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1141                      .dwattr $C$DW$109, DW_AT_name("CLKSTOP")
    1142                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CLKSTOP")
    1143                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1144                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$110       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$24)
    1147                      .dwattr $C$DW$110, DW_AT_name("RSVD8")
    1148                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD8")
    1149                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1150                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1151              $C$DW$111       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1153                      .dwattr $C$DW$111, DW_AT_name("DIEIDR0")
    1154                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DIEIDR0")
    1155                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1156                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1157              $C$DW$112       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1159                      .dwattr $C$DW$112, DW_AT_name("DIEIDR1")
    1160                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_DIEIDR1")
    1161                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1162                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$113       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1165                      .dwattr $C$DW$113, DW_AT_name("DIEIDR2")
    1166                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_DIEIDR2")
    1167                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1168                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$114       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1171                      .dwattr $C$DW$114, DW_AT_name("DIEIDR3")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   31

    1172                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_DIEIDR3")
    1173                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1174                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$115       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1177                      .dwattr $C$DW$115, DW_AT_name("DIEIDR4")
    1178                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DIEIDR4")
    1179                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1180                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$116       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1183                      .dwattr $C$DW$116, DW_AT_name("DIEIDR5")
    1184                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DIEIDR5")
    1185                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1186                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$117       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1189                      .dwattr $C$DW$117, DW_AT_name("DIEIDR6")
    1190                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_DIEIDR6")
    1191                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1192                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$118       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1195                      .dwattr $C$DW$118, DW_AT_name("DIEIDR7")
    1196                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_DIEIDR7")
    1197                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1198                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1199                      .dwendtag $C$DW$T$25
    1200              
    1201              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1202                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    1203                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1204              $C$DW$119       .dwtag  DW_TAG_TI_far_type
    1205                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
    1206              $C$DW$120       .dwtag  DW_TAG_TI_ioport_type
    1207                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$119)
    1208              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1209                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$120)
    1210              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1211                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1212                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    1213              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1214                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1215                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1216              
    1217              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1218                      .dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
    1219                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    1220              $C$DW$121       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$27)
    1222                      .dwattr $C$DW$121, DW_AT_name("pllConfig")
    1223                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_pllConfig")
    1224                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$122       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   32

    1227                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$28)
    1228                      .dwattr $C$DW$122, DW_AT_name("instId")
    1229                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_instId")
    1230                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1231                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$123       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1234                      .dwattr $C$DW$123, DW_AT_name("sysAddr")
    1235                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_sysAddr")
    1236                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1237                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1238                      .dwendtag $C$DW$T$33
    1239              
    1240              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    1241                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1242                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1243              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1244                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1245                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1246              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1247                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1248                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    1249              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    1250                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1251                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1252              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1253                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1254                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1255                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1256              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1257                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1258                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1259                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1260              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1261                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1262                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1263                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1264              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1265                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1266                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1267                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1268              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1269                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1270                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1271                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1272              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1273                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    1274                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1275              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1276                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1277                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1278              $C$DW$124       .dwtag  DW_TAG_TI_far_type
    1279                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$39)
    1280              $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1281                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$124)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll_example.asm                                                  PAGE   33

    1282              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1283                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1284                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1285                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1286              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1287                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
