TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE    1

    1709              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:49 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         00039b 0054 
         00039c 0043 
         00039d 0020 
         00039e 0063 
         00039f 006F 
         0003a0 006D 
         0003a1 0070 
         0003a2 0065 
         0003a3 006E 
         0003a4 0073 
         0003a5 0061 
         0003a6 0074 
         0003a7 0069 
         0003a8 006F 
         0003a9 006E 
         0003aa 0020 
         0003ab 0073 
         0003ac 0065 
         0003ad 0074 
         0003ae 0020 
         0003af 0073 
         0003b0 0075 
         0003b1 0063 
         0003b2 0063 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   43

         0003b3 0065 
         0003b4 0073 
         0003b5 0073 
         0003b6 0066 
         0003b7 0075 
         0003b8 006C 
         0003b9 0021 
         0003ba 000A 
         0003bb 0000 
    1127                      .align  2
    1128 0003bc 0054  $C$FSL26:       .string "Time and Date is : %02d:%02d:%02d:%04d, %02d-%02d-%02d",10,0
         0003bd 0069 
         0003be 006D 
         0003bf 0065 
         0003c0 0020 
         0003c1 0061 
         0003c2 006E 
         0003c3 0064 
         0003c4 0020 
         0003c5 0044 
         0003c6 0061 
         0003c7 0074 
         0003c8 0065 
         0003c9 0020 
         0003ca 0069 
         0003cb 0073 
         0003cc 0020 
         0003cd 003A 
         0003ce 0020 
         0003cf 0025 
         0003d0 0030 
         0003d1 0032 
         0003d2 0064 
         0003d3 003A 
         0003d4 0025 
         0003d5 0030 
         0003d6 0032 
         0003d7 0064 
         0003d8 003A 
         0003d9 0025 
         0003da 0030 
         0003db 0032 
         0003dc 0064 
         0003dd 003A 
         0003de 0025 
         0003df 0030 
         0003e0 0034 
         0003e1 0064 
         0003e2 002C 
         0003e3 0020 
         0003e4 0025 
         0003e5 0030 
         0003e6 0032 
         0003e7 0064 
         0003e8 002D 
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   44

         0003e9 0025 
         0003ea 0030 
         0003eb 0032 
         0003ec 0064 
         0003ed 002D 
         0003ee 0025 
         0003ef 0030 
         0003f0 0032 
         0003f1 0064 
         0003f2 000A 
         0003f3 0000 
    1129                      .align  2
    1130 0003f4 0052  $C$FSL27:       .string "RTC compensation set failed!",10,0
         0003f5 0054 
         0003f6 0043 
         0003f7 0020 
         0003f8 0063 
         0003f9 006F 
         0003fa 006D 
         0003fb 0070 
         0003fc 0065 
         0003fd 006E 
         0003fe 0073 
         0003ff 0061 
         000400 0074 
         000401 0069 
         000402 006F 
         000403 006E 
         000404 0020 
         000405 0073 
         000406 0065 
         000407 0074 
         000408 0020 
         000409 0066 
         00040a 0061 
         00040b 0069 
         00040c 006C 
         00040d 0065 
         00040e 0064 
         00040f 0021 
         000410 000A 
         000411 0000 
    1131              ;******************************************************************************
    1132              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1133              ;******************************************************************************
    1134                      .global _printf
    1135                      .global _RTC_reset
    1136                      .global _RTC_start
    1137                      .global _RTC_stop
    1138                      .global _RTC_config
    1139                      .global _RTC_getConfig
    1140                      .global _RTC_setTime
    1141                      .global _RTC_getTime
    1142                      .global _RTC_setDate
    1143                      .global _RTC_getDate
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   45

    1144                      .global _RTC_setCompensation
    1145              
    1146              ;*******************************************************************************
    1147              ;* TYPE INFORMATION                                                            *
    1148              ;*******************************************************************************
    1149              
    1150              $C$DW$T$23      .dwtag  DW_TAG_enumeration_type
    1151                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1152              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_NEGATIVE"), DW_AT_const_value(0x0
    1153              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_POSITIVE"), DW_AT_const_value(0x0
    1154              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_INVALID"), DW_AT_const_value(0x02
    1155                      .dwendtag $C$DW$T$23
    1156              
    1157              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCCompType")
    1158                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1159                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1160              
    1161              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1162                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0f)
    1163              $C$DW$100       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$100, DW_AT_name("rtcmSec")
    1166                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rtcmSec")
    1167                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$101       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$101, DW_AT_name("rtcsec")
    1172                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rtcsec")
    1173                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1174                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$102       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$102, DW_AT_name("rtcmin")
    1178                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rtcmin")
    1179                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1180                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$103       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$103, DW_AT_name("rtchour")
    1184                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rtchour")
    1185                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1186                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$104       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$104, DW_AT_name("rtcday")
    1190                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rtcday")
    1191                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1192                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$105       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$105, DW_AT_name("rtcmonth")
    1196                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rtcmonth")
    1197                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1198                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   46

    1199              $C$DW$106       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$106, DW_AT_name("rtcyear")
    1202                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rtcyear")
    1203                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1204                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$107       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$107, DW_AT_name("rtcmSeca")
    1208                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rtcmSeca")
    1209                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1210                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$108       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$108, DW_AT_name("rtcseca")
    1214                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rtcseca")
    1215                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1216                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$109       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$109, DW_AT_name("rtcmina")
    1220                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rtcmina")
    1221                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1222                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$110       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$110, DW_AT_name("rtchoura")
    1226                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rtchoura")
    1227                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1228                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$111       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$111, DW_AT_name("rtcdaya")
    1232                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rtcdaya")
    1233                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1234                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$112       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$112, DW_AT_name("rtcmontha")
    1238                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rtcmontha")
    1239                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1240                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$113       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$113, DW_AT_name("rtcyeara")
    1244                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rtcyeara")
    1245                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1246                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$114       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$114, DW_AT_name("rtcintcr")
    1250                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rtcintcr")
    1251                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1252                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1253                      .dwendtag $C$DW$T$20
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   47

    1254              
    1255              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcConfig")
    1256                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    1257                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1258              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1259                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1260                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    1261              
    1262              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1263                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1264              $C$DW$115       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$115, DW_AT_name("hours")
    1267                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_hours")
    1268                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$116       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$116, DW_AT_name("mins")
    1273                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_mins")
    1274                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1275                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$117       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$117, DW_AT_name("secs")
    1279                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_secs")
    1280                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1281                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$118       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$118, DW_AT_name("mSecs")
    1285                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_mSecs")
    1286                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1287                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1288                      .dwendtag $C$DW$T$21
    1289              
    1290              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcTime")
    1291                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
    1292                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1293              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1294                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1295                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    1296              
    1297              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1298                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x03)
    1299              $C$DW$119       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$119, DW_AT_name("year")
    1302                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_year")
    1303                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$120       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$120, DW_AT_name("month")
    1308                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_month")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   48

    1309                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1310                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$121       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$121, DW_AT_name("day")
    1314                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_day")
    1315                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1316                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1317                      .dwendtag $C$DW$T$22
    1318              
    1319              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcDate")
    1320                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$22)
    1321                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1322              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1323                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1324                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    1325              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1326                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1327                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1328                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1329              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1330                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1331                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1332                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1333              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1334                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1335                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1336                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1337              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1338                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1339                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1340                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1341              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1342                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1343                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1344                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1345              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1346                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$8)
    1347                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1348              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1349                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1350                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1351              $C$DW$122       .dwtag  DW_TAG_TI_far_type
    1352                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
    1353              $C$DW$T$44      .dwtag  DW_TAG_volatile_type
    1354                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$122)
    1355              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1356                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1357                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1358                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1359              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1360                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1361                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1362              $C$DW$123       .dwtag  DW_TAG_TI_far_type
    1363                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_compensation_example.asm                                     PAGE   49

    1364              $C$DW$T$45      .dwtag  DW_TAG_volatile_type
    1365                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$123)
    1366              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1367                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
