TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE    1

    9475              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:30 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    6010              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    6011              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    6012              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    6013                      .dwendtag $C$DW$T$121
    6014              
    6015              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    6016                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    6017                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    6018              
    6019              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    6020                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    6021              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    6022              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    6023              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    6024              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    6025              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    6026                      .dwendtag $C$DW$T$123
    6027              
    6028              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    6029                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    6030                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    6031              
    6032              $C$DW$T$143     .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  150

    6033                      .dwattr $C$DW$T$143, DW_AT_byte_size(0x01)
    6034              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    6035              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    6036              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    6037              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    6038              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    6039              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    6040              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    6041                      .dwendtag $C$DW$T$143
    6042              
    6043              $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    6044                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
    6045                      .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    6046              $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    6047                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    6048                      .dwattr $C$DW$T$145, DW_AT_address_class(0x17)
    6049              
    6050              $C$DW$T$146     .dwtag  DW_TAG_enumeration_type
    6051                      .dwattr $C$DW$T$146, DW_AT_byte_size(0x01)
    6052              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
    6053              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    6054                      .dwendtag $C$DW$T$146
    6055              
    6056              $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    6057                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    6058                      .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    6059              
    6060              $C$DW$T$148     .dwtag  DW_TAG_enumeration_type
    6061                      .dwattr $C$DW$T$148, DW_AT_byte_size(0x01)
    6062              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    6063              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    6064              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    6065              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    6066              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    6067              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    6068              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    6069                      .dwendtag $C$DW$T$148
    6070              
    6071              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    6072                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    6073                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    6074              
    6075              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6076                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    6077              $C$DW$537       .dwtag  DW_TAG_member
    6078                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$21)
    6079                      .dwattr $C$DW$537, DW_AT_name("RSVD0")
    6080                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_RSVD0")
    6081                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6082                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6083              $C$DW$538       .dwtag  DW_TAG_member
    6084                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
    6085                      .dwattr $C$DW$538, DW_AT_name("USBLDOCNTL")
    6086                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_USBLDOCNTL")
    6087                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  151

    6088                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6089              $C$DW$539       .dwtag  DW_TAG_member
    6090                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    6091                      .dwattr $C$DW$539, DW_AT_name("RSVD1")
    6092                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_RSVD1")
    6093                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6094                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6095              $C$DW$540       .dwtag  DW_TAG_member
    6096                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
    6097                      .dwattr $C$DW$540, DW_AT_name("SARCTRL")
    6098                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_SARCTRL")
    6099                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6100                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6101              $C$DW$541       .dwtag  DW_TAG_member
    6102                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
    6103                      .dwattr $C$DW$541, DW_AT_name("RSVD2")
    6104                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_RSVD2")
    6105                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6106                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6107              $C$DW$542       .dwtag  DW_TAG_member
    6108                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$20)
    6109                      .dwattr $C$DW$542, DW_AT_name("SARDATA")
    6110                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_SARDATA")
    6111                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6112                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6113              $C$DW$543       .dwtag  DW_TAG_member
    6114                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
    6115                      .dwattr $C$DW$543, DW_AT_name("RSVD3")
    6116                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_RSVD3")
    6117                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6118                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6119              $C$DW$544       .dwtag  DW_TAG_member
    6120                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
    6121                      .dwattr $C$DW$544, DW_AT_name("SARCLKCTRL")
    6122                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_SARCLKCTRL")
    6123                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6124                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6125              $C$DW$545       .dwtag  DW_TAG_member
    6126                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
    6127                      .dwattr $C$DW$545, DW_AT_name("RSVD4")
    6128                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_RSVD4")
    6129                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6130                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6131              $C$DW$546       .dwtag  DW_TAG_member
    6132                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$20)
    6133                      .dwattr $C$DW$546, DW_AT_name("SARPINCTRL")
    6134                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_SARPINCTRL")
    6135                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6136                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6137              $C$DW$547       .dwtag  DW_TAG_member
    6138                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
    6139                      .dwattr $C$DW$547, DW_AT_name("RSVD5")
    6140                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_RSVD5")
    6141                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6142                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  152

    6143              $C$DW$548       .dwtag  DW_TAG_member
    6144                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$20)
    6145                      .dwattr $C$DW$548, DW_AT_name("SARGPOCTRL")
    6146                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_SARGPOCTRL")
    6147                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6148                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6149                      .dwendtag $C$DW$T$23
    6150              
    6151              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    6152                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    6153                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    6154              $C$DW$549       .dwtag  DW_TAG_TI_far_type
    6155                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$24)
    6156              $C$DW$550       .dwtag  DW_TAG_TI_ioport_type
    6157                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$549)
    6158              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    6159                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$550)
    6160              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    6161                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    6162                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    6163              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    6164                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    6165                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    6166              
    6167              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6168                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    6169              $C$DW$551       .dwtag  DW_TAG_member
    6170                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$27)
    6171                      .dwattr $C$DW$551, DW_AT_name("baseAddr")
    6172                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_baseAddr")
    6173                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6174                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6175              $C$DW$552       .dwtag  DW_TAG_member
    6176                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    6177                      .dwattr $C$DW$552, DW_AT_name("chanNo")
    6178                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_chanNo")
    6179                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6180                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6181              $C$DW$553       .dwtag  DW_TAG_member
    6182                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
    6183                      .dwattr $C$DW$553, DW_AT_name("status")
    6184                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_status")
    6185                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6186                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6187                      .dwendtag $C$DW$T$28
    6188              
    6189              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
    6190                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$28)
    6191                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    6192              $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    6193                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    6194                      .dwattr $C$DW$T$151, DW_AT_address_class(0x17)
    6195              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    6196                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    6197                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  153

    6198              
    6199              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6200                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    6201              $C$DW$554       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
    6203                      .dwattr $C$DW$554, DW_AT_name("SysClkDiv")
    6204                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_SysClkDiv")
    6205                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6206                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6207              $C$DW$555       .dwtag  DW_TAG_member
    6208                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$30)
    6209                      .dwattr $C$DW$555, DW_AT_name("OpMode")
    6210                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_OpMode")
    6211                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6212                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6213              $C$DW$556       .dwtag  DW_TAG_member
    6214                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$32)
    6215                      .dwattr $C$DW$556, DW_AT_name("MultiCh")
    6216                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_MultiCh")
    6217                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6218                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6219              $C$DW$557       .dwtag  DW_TAG_member
    6220                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$34)
    6221                      .dwattr $C$DW$557, DW_AT_name("RefVoltage")
    6222                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_RefVoltage")
    6223                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6224                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6225                      .dwendtag $C$DW$T$35
    6226              
    6227              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    6228                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$35)
    6229                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    6230              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    6231                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
    6232                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    6233              
    6234              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6235                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    6236              $C$DW$558       .dwtag  DW_TAG_member
    6237                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$20)
    6238                      .dwattr $C$DW$558, DW_AT_name("TXFUNCADDR")
    6239                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_TXFUNCADDR")
    6240                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6241                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6242              $C$DW$559       .dwtag  DW_TAG_member
    6243                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$20)
    6244                      .dwattr $C$DW$559, DW_AT_name("TXHUBADDR_TXHUBPORT")
    6245                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    6246                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6247                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6248              $C$DW$560       .dwtag  DW_TAG_member
    6249                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$36)
    6250                      .dwattr $C$DW$560, DW_AT_name("RSVD0")
    6251                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_RSVD0")
    6252                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  154

    6253                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6254              $C$DW$561       .dwtag  DW_TAG_member
    6255                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
    6256                      .dwattr $C$DW$561, DW_AT_name("RXFUNCADDR")
    6257                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_RXFUNCADDR")
    6258                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6259                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6260              $C$DW$562       .dwtag  DW_TAG_member
    6261                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$20)
    6262                      .dwattr $C$DW$562, DW_AT_name("RXHUBADDR_RXHUBPORT")
    6263                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    6264                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6265                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6266              $C$DW$563       .dwtag  DW_TAG_member
    6267                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$36)
    6268                      .dwattr $C$DW$563, DW_AT_name("RSVD36")
    6269                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_RSVD36")
    6270                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6271                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6272                      .dwendtag $C$DW$T$37
    6273              
    6274              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    6275                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$37)
    6276                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6277              
    6278              $C$DW$T$54      .dwtag  DW_TAG_array_type
    6279                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    6280                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    6281                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x28)
    6282              $C$DW$564       .dwtag  DW_TAG_subrange_type
    6283                      .dwattr $C$DW$564, DW_AT_upper_bound(0x04)
    6284                      .dwendtag $C$DW$T$54
    6285              
    6286              
    6287              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6288                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x10)
    6289              $C$DW$565       .dwtag  DW_TAG_member
    6290                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
    6291                      .dwattr $C$DW$565, DW_AT_name("TXMAXP")
    6292                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_TXMAXP")
    6293                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6294                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6295              $C$DW$566       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    6297                      .dwattr $C$DW$566, DW_AT_name("PERI_TXCSR")
    6298                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_PERI_TXCSR")
    6299                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6300                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6301              $C$DW$567       .dwtag  DW_TAG_member
    6302                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$36)
    6303                      .dwattr $C$DW$567, DW_AT_name("RSVD0")
    6304                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_RSVD0")
    6305                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6306                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6307              $C$DW$568       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  155

    6308                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
    6309                      .dwattr $C$DW$568, DW_AT_name("RXMAXP")
    6310                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_RXMAXP")
    6311                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6312                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6313              $C$DW$569       .dwtag  DW_TAG_member
    6314                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
    6315                      .dwattr $C$DW$569, DW_AT_name("PERI_RXCSR")
    6316                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_PERI_RXCSR")
    6317                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6318                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6319              $C$DW$570       .dwtag  DW_TAG_member
    6320                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$36)
    6321                      .dwattr $C$DW$570, DW_AT_name("RSVD1")
    6322                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_RSVD1")
    6323                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6324                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6325              $C$DW$571       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$20)
    6327                      .dwattr $C$DW$571, DW_AT_name("RXCOUNT")
    6328                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_RXCOUNT")
    6329                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6330                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6331              $C$DW$572       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$38)
    6333                      .dwattr $C$DW$572, DW_AT_name("RSVD41")
    6334                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_RSVD41")
    6335                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6336                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6337                      .dwendtag $C$DW$T$39
    6338              
    6339              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    6340                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$39)
    6341                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6342              
    6343              $C$DW$T$57      .dwtag  DW_TAG_array_type
    6344                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    6345                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6346                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x40)
    6347              $C$DW$573       .dwtag  DW_TAG_subrange_type
    6348                      .dwattr $C$DW$573, DW_AT_upper_bound(0x03)
    6349                      .dwendtag $C$DW$T$57
    6350              
    6351              
    6352              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6353                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x20)
    6354              $C$DW$574       .dwtag  DW_TAG_member
    6355                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$20)
    6356                      .dwattr $C$DW$574, DW_AT_name("TXGCR1")
    6357                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_TXGCR1")
    6358                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6359                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6360              $C$DW$575       .dwtag  DW_TAG_member
    6361                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    6362                      .dwattr $C$DW$575, DW_AT_name("TXGCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  156

    6363                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_TXGCR2")
    6364                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6365                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6366              $C$DW$576       .dwtag  DW_TAG_member
    6367                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$40)
    6368                      .dwattr $C$DW$576, DW_AT_name("RSVD0")
    6369                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD0")
    6370                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6371                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6372              $C$DW$577       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
    6374                      .dwattr $C$DW$577, DW_AT_name("RXGCR1")
    6375                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_RXGCR1")
    6376                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6377                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6378              $C$DW$578       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    6380                      .dwattr $C$DW$578, DW_AT_name("RXGCR2")
    6381                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_RXGCR2")
    6382                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6383                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6384              $C$DW$579       .dwtag  DW_TAG_member
    6385                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$36)
    6386                      .dwattr $C$DW$579, DW_AT_name("RSVD1")
    6387                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD1")
    6388                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6389                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6390              $C$DW$580       .dwtag  DW_TAG_member
    6391                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    6392                      .dwattr $C$DW$580, DW_AT_name("RXHPCR1A")
    6393                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_RXHPCR1A")
    6394                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6395                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6396              $C$DW$581       .dwtag  DW_TAG_member
    6397                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$20)
    6398                      .dwattr $C$DW$581, DW_AT_name("RXHPCR2A")
    6399                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_RXHPCR2A")
    6400                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6401                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6402              $C$DW$582       .dwtag  DW_TAG_member
    6403                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$36)
    6404                      .dwattr $C$DW$582, DW_AT_name("RSVD2")
    6405                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_RSVD2")
    6406                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6407                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6408              $C$DW$583       .dwtag  DW_TAG_member
    6409                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
    6410                      .dwattr $C$DW$583, DW_AT_name("RXHPCR1B")
    6411                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_RXHPCR1B")
    6412                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6413                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6414              $C$DW$584       .dwtag  DW_TAG_member
    6415                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    6416                      .dwattr $C$DW$584, DW_AT_name("RXHPCR2B")
    6417                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_RXHPCR2B")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  157

    6418                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6419                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6420              $C$DW$585       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$41)
    6422                      .dwattr $C$DW$585, DW_AT_name("RSVD46")
    6423                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD46")
    6424                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6425                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6426                      .dwendtag $C$DW$T$42
    6427              
    6428              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    6429                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$42)
    6430                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6431              
    6432              $C$DW$T$61      .dwtag  DW_TAG_array_type
    6433                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    6434                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    6435                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x80)
    6436              $C$DW$586       .dwtag  DW_TAG_subrange_type
    6437                      .dwattr $C$DW$586, DW_AT_upper_bound(0x03)
    6438                      .dwendtag $C$DW$T$61
    6439              
    6440              
    6441              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6442                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    6443              $C$DW$587       .dwtag  DW_TAG_member
    6444                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
    6445                      .dwattr $C$DW$587, DW_AT_name("ENTRYLSW")
    6446                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_ENTRYLSW")
    6447                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6448                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6449              $C$DW$588       .dwtag  DW_TAG_member
    6450                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$20)
    6451                      .dwattr $C$DW$588, DW_AT_name("ENTRYMSW")
    6452                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_ENTRYMSW")
    6453                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6454                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6455              $C$DW$589       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$36)
    6457                      .dwattr $C$DW$589, DW_AT_name("RSVD49")
    6458                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_RSVD49")
    6459                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6460                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6461                      .dwendtag $C$DW$T$43
    6462              
    6463              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    6464                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$43)
    6465                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    6466              
    6467              $C$DW$T$65      .dwtag  DW_TAG_array_type
    6468                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    6469                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    6470                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x100)
    6471              $C$DW$590       .dwtag  DW_TAG_subrange_type
    6472                      .dwattr $C$DW$590, DW_AT_upper_bound(0x3f)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  158

    6473                      .dwendtag $C$DW$T$65
    6474              
    6475              
    6476              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6477                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x10)
    6478              $C$DW$591       .dwtag  DW_TAG_member
    6479                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$20)
    6480                      .dwattr $C$DW$591, DW_AT_name("QMEMRBASE1")
    6481                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_QMEMRBASE1")
    6482                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6483                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6484              $C$DW$592       .dwtag  DW_TAG_member
    6485                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    6486                      .dwattr $C$DW$592, DW_AT_name("QMEMRBASE2")
    6487                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_QMEMRBASE2")
    6488                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6489                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6490              $C$DW$593       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$36)
    6492                      .dwattr $C$DW$593, DW_AT_name("RSVD0")
    6493                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_RSVD0")
    6494                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6495                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6496              $C$DW$594       .dwtag  DW_TAG_member
    6497                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
    6498                      .dwattr $C$DW$594, DW_AT_name("QMEMRCTRL1")
    6499                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    6500                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6501                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6502              $C$DW$595       .dwtag  DW_TAG_member
    6503                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
    6504                      .dwattr $C$DW$595, DW_AT_name("QMEMRCTRL2")
    6505                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    6506                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6507                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6508              $C$DW$596       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$44)
    6510                      .dwattr $C$DW$596, DW_AT_name("RSVD63")
    6511                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_RSVD63")
    6512                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6513                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6514                      .dwendtag $C$DW$T$45
    6515              
    6516              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    6517                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$45)
    6518                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    6519              
    6520              $C$DW$T$71      .dwtag  DW_TAG_array_type
    6521                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6522                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6523                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x100)
    6524              $C$DW$597       .dwtag  DW_TAG_subrange_type
    6525                      .dwattr $C$DW$597, DW_AT_upper_bound(0x0f)
    6526                      .dwendtag $C$DW$T$71
    6527              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  159

    6528              
    6529              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6530                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    6531              $C$DW$598       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$46)
    6533                      .dwattr $C$DW$598, DW_AT_name("RSVD0")
    6534                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_RSVD0")
    6535                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6536                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6537              $C$DW$599       .dwtag  DW_TAG_member
    6538                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    6539                      .dwattr $C$DW$599, DW_AT_name("CTRL1D")
    6540                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_CTRL1D")
    6541                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6542                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6543              $C$DW$600       .dwtag  DW_TAG_member
    6544                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$20)
    6545                      .dwattr $C$DW$600, DW_AT_name("CTRL2D")
    6546                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_CTRL2D")
    6547                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6548                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6549              $C$DW$601       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$36)
    6551                      .dwattr $C$DW$601, DW_AT_name("RSVD65")
    6552                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_RSVD65")
    6553                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6554                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6555                      .dwendtag $C$DW$T$47
    6556              
    6557              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    6558                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$47)
    6559                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6560              
    6561              $C$DW$T$74      .dwtag  DW_TAG_array_type
    6562                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    6563                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6564                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x400)
    6565              $C$DW$602       .dwtag  DW_TAG_subrange_type
    6566                      .dwattr $C$DW$602, DW_AT_upper_bound(0x3f)
    6567                      .dwendtag $C$DW$T$74
    6568              
    6569              
    6570              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    6571                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x10)
    6572              $C$DW$603       .dwtag  DW_TAG_member
    6573                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    6574                      .dwattr $C$DW$603, DW_AT_name("QSTATA")
    6575                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_QSTATA")
    6576                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6577                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6578              $C$DW$604       .dwtag  DW_TAG_member
    6579                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$48)
    6580                      .dwattr $C$DW$604, DW_AT_name("RSVD0")
    6581                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_RSVD0")
    6582                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  160

    6583                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6584              $C$DW$605       .dwtag  DW_TAG_member
    6585                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$20)
    6586                      .dwattr $C$DW$605, DW_AT_name("QSTAT1B")
    6587                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_QSTAT1B")
    6588                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6589                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6590              $C$DW$606       .dwtag  DW_TAG_member
    6591                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$20)
    6592                      .dwattr $C$DW$606, DW_AT_name("QSTAT2B")
    6593                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_QSTAT2B")
    6594                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6595                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6596              $C$DW$607       .dwtag  DW_TAG_member
    6597                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$36)
    6598                      .dwattr $C$DW$607, DW_AT_name("RSVD1")
    6599                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_RSVD1")
    6600                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6601                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6602              $C$DW$608       .dwtag  DW_TAG_member
    6603                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$20)
    6604                      .dwattr $C$DW$608, DW_AT_name("QSTAT1C")
    6605                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_QSTAT1C")
    6606                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6607                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6608              $C$DW$609       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$38)
    6610                      .dwattr $C$DW$609, DW_AT_name("RSVD67")
    6611                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_RSVD67")
    6612                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6613                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6614                      .dwendtag $C$DW$T$49
    6615              
    6616              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    6617                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$49)
    6618                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6619              
    6620              $C$DW$T$77      .dwtag  DW_TAG_array_type
    6621                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6622                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    6623                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x400)
    6624              $C$DW$610       .dwtag  DW_TAG_subrange_type
    6625                      .dwattr $C$DW$610, DW_AT_upper_bound(0x3f)
    6626                      .dwendtag $C$DW$T$77
    6627              
    6628              
    6629              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    6630                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x6c00)
    6631              $C$DW$611       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$20)
    6633                      .dwattr $C$DW$611, DW_AT_name("REVID1")
    6634                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_REVID1")
    6635                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6636                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6637              $C$DW$612       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  161

    6638                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$20)
    6639                      .dwattr $C$DW$612, DW_AT_name("REVID2")
    6640                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_REVID2")
    6641                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6642                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6643              $C$DW$613       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$36)
    6645                      .dwattr $C$DW$613, DW_AT_name("RSVD0")
    6646                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_RSVD0")
    6647                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6648                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6649              $C$DW$614       .dwtag  DW_TAG_member
    6650                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$20)
    6651                      .dwattr $C$DW$614, DW_AT_name("CTRLR")
    6652                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_CTRLR")
    6653                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6654                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6655              $C$DW$615       .dwtag  DW_TAG_member
    6656                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$48)
    6657                      .dwattr $C$DW$615, DW_AT_name("RSVD1")
    6658                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_RSVD1")
    6659                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6660                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6661              $C$DW$616       .dwtag  DW_TAG_member
    6662                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$20)
    6663                      .dwattr $C$DW$616, DW_AT_name("STATR")
    6664                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_STATR")
    6665                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6666                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6667              $C$DW$617       .dwtag  DW_TAG_member
    6668                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$48)
    6669                      .dwattr $C$DW$617, DW_AT_name("RSVD2")
    6670                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_RSVD2")
    6671                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6672                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6673              $C$DW$618       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$20)
    6675                      .dwattr $C$DW$618, DW_AT_name("EMUR")
    6676                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_EMUR")
    6677                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6678                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6679              $C$DW$619       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$48)
    6681                      .dwattr $C$DW$619, DW_AT_name("RSVD3")
    6682                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_RSVD3")
    6683                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6684                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6685              $C$DW$620       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$20)
    6687                      .dwattr $C$DW$620, DW_AT_name("MODE1")
    6688                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_MODE1")
    6689                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6690                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6691              $C$DW$621       .dwtag  DW_TAG_member
    6692                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  162

    6693                      .dwattr $C$DW$621, DW_AT_name("MODE2")
    6694                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_MODE2")
    6695                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6696                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6697              $C$DW$622       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$36)
    6699                      .dwattr $C$DW$622, DW_AT_name("RSVD4")
    6700                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_RSVD4")
    6701                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6702                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6703              $C$DW$623       .dwtag  DW_TAG_member
    6704                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$20)
    6705                      .dwattr $C$DW$623, DW_AT_name("AUTOREQ")
    6706                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_AUTOREQ")
    6707                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6708                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6709              $C$DW$624       .dwtag  DW_TAG_member
    6710                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$48)
    6711                      .dwattr $C$DW$624, DW_AT_name("RSVD5")
    6712                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_RSVD5")
    6713                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6714                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6715              $C$DW$625       .dwtag  DW_TAG_member
    6716                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
    6717                      .dwattr $C$DW$625, DW_AT_name("SPRFIXTIME1")
    6718                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    6719                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6720                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6721              $C$DW$626       .dwtag  DW_TAG_member
    6722                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
    6723                      .dwattr $C$DW$626, DW_AT_name("SPRFIXTIME2")
    6724                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    6725                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6726                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6727              $C$DW$627       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$36)
    6729                      .dwattr $C$DW$627, DW_AT_name("RSVD6")
    6730                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_RSVD6")
    6731                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6732                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6733              $C$DW$628       .dwtag  DW_TAG_member
    6734                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
    6735                      .dwattr $C$DW$628, DW_AT_name("TEARDOWN1")
    6736                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_TEARDOWN1")
    6737                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6738                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6739              $C$DW$629       .dwtag  DW_TAG_member
    6740                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$20)
    6741                      .dwattr $C$DW$629, DW_AT_name("TEARDOWN2")
    6742                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_TEARDOWN2")
    6743                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6744                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6745              $C$DW$630       .dwtag  DW_TAG_member
    6746                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$36)
    6747                      .dwattr $C$DW$630, DW_AT_name("RSVD7")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  163

    6748                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_RSVD7")
    6749                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6750                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6751              $C$DW$631       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$20)
    6753                      .dwattr $C$DW$631, DW_AT_name("INTSRCR1")
    6754                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_INTSRCR1")
    6755                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6756                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6757              $C$DW$632       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$20)
    6759                      .dwattr $C$DW$632, DW_AT_name("INTSRCR2")
    6760                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_INTSRCR2")
    6761                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6762                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6763              $C$DW$633       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$36)
    6765                      .dwattr $C$DW$633, DW_AT_name("RSVD8")
    6766                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_RSVD8")
    6767                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6768                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6769              $C$DW$634       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$20)
    6771                      .dwattr $C$DW$634, DW_AT_name("INTSETR1")
    6772                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_INTSETR1")
    6773                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6774                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6775              $C$DW$635       .dwtag  DW_TAG_member
    6776                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$20)
    6777                      .dwattr $C$DW$635, DW_AT_name("INTSETR2")
    6778                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_INTSETR2")
    6779                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6780                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6781              $C$DW$636       .dwtag  DW_TAG_member
    6782                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$36)
    6783                      .dwattr $C$DW$636, DW_AT_name("RSVD9")
    6784                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_RSVD9")
    6785                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6786                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6787              $C$DW$637       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$20)
    6789                      .dwattr $C$DW$637, DW_AT_name("INTCLRR1")
    6790                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_INTCLRR1")
    6791                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6792                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6793              $C$DW$638       .dwtag  DW_TAG_member
    6794                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$20)
    6795                      .dwattr $C$DW$638, DW_AT_name("INTCLRR2")
    6796                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_INTCLRR2")
    6797                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6798                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6799              $C$DW$639       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$36)
    6801                      .dwattr $C$DW$639, DW_AT_name("RSVD10")
    6802                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_RSVD10")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  164

    6803                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6804                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6805              $C$DW$640       .dwtag  DW_TAG_member
    6806                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$20)
    6807                      .dwattr $C$DW$640, DW_AT_name("INTMSKR1")
    6808                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_INTMSKR1")
    6809                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6810                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6811              $C$DW$641       .dwtag  DW_TAG_member
    6812                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$20)
    6813                      .dwattr $C$DW$641, DW_AT_name("INTMSKR2")
    6814                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_INTMSKR2")
    6815                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6816                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6817              $C$DW$642       .dwtag  DW_TAG_member
    6818                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$36)
    6819                      .dwattr $C$DW$642, DW_AT_name("RSVD11")
    6820                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_RSVD11")
    6821                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6822                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6823              $C$DW$643       .dwtag  DW_TAG_member
    6824                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$20)
    6825                      .dwattr $C$DW$643, DW_AT_name("INTMSKSETR1")
    6826                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_INTMSKSETR1")
    6827                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6828                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6829              $C$DW$644       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6831                      .dwattr $C$DW$644, DW_AT_name("INTMSKSETR2")
    6832                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_INTMSKSETR2")
    6833                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    6834                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$645       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$36)
    6837                      .dwattr $C$DW$645, DW_AT_name("RSVD12")
    6838                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_RSVD12")
    6839                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6840                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6841              $C$DW$646       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$20)
    6843                      .dwattr $C$DW$646, DW_AT_name("INTMSKCLRR1")
    6844                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    6845                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6846                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6847              $C$DW$647       .dwtag  DW_TAG_member
    6848                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
    6849                      .dwattr $C$DW$647, DW_AT_name("INTMSKCLRR2")
    6850                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    6851                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    6852                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6853              $C$DW$648       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$36)
    6855                      .dwattr $C$DW$648, DW_AT_name("RSVD13")
    6856                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_RSVD13")
    6857                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  165

    6858                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6859              $C$DW$649       .dwtag  DW_TAG_member
    6860                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
    6861                      .dwattr $C$DW$649, DW_AT_name("INTMASKEDR1")
    6862                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_INTMASKEDR1")
    6863                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6864                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6865              $C$DW$650       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$20)
    6867                      .dwattr $C$DW$650, DW_AT_name("INTMASKEDR2")
    6868                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_INTMASKEDR2")
    6869                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6870                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6871              $C$DW$651       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$36)
    6873                      .dwattr $C$DW$651, DW_AT_name("RSVD14")
    6874                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_RSVD14")
    6875                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6876                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6877              $C$DW$652       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$20)
    6879                      .dwattr $C$DW$652, DW_AT_name("EOIR")
    6880                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_EOIR")
    6881                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6882                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6883              $C$DW$653       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$48)
    6885                      .dwattr $C$DW$653, DW_AT_name("RSVD15")
    6886                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_RSVD15")
    6887                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    6888                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6889              $C$DW$654       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
    6891                      .dwattr $C$DW$654, DW_AT_name("INTVECTR1")
    6892                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_INTVECTR1")
    6893                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6894                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6895              $C$DW$655       .dwtag  DW_TAG_member
    6896                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
    6897                      .dwattr $C$DW$655, DW_AT_name("INTVECTR2")
    6898                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_INTVECTR2")
    6899                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6900                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6901              $C$DW$656       .dwtag  DW_TAG_member
    6902                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$41)
    6903                      .dwattr $C$DW$656, DW_AT_name("RSVD16")
    6904                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_RSVD16")
    6905                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6906                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6907              $C$DW$657       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$20)
    6909                      .dwattr $C$DW$657, DW_AT_name("GREP1SZR1")
    6910                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_GREP1SZR1")
    6911                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6912                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  166

    6913              $C$DW$658       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
    6915                      .dwattr $C$DW$658, DW_AT_name("GREP1SZR2")
    6916                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_GREP1SZR2")
    6917                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    6918                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6919              $C$DW$659       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$36)
    6921                      .dwattr $C$DW$659, DW_AT_name("RSVD17")
    6922                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_RSVD17")
    6923                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    6924                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6925              $C$DW$660       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$20)
    6927                      .dwattr $C$DW$660, DW_AT_name("GREP2SZR1")
    6928                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_GREP2SZR1")
    6929                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6930                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$661       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
    6933                      .dwattr $C$DW$661, DW_AT_name("GREP2SZR2")
    6934                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_GREP2SZR2")
    6935                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    6936                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6937              $C$DW$662       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$36)
    6939                      .dwattr $C$DW$662, DW_AT_name("RSVD18")
    6940                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_RSVD18")
    6941                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6942                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6943              $C$DW$663       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$20)
    6945                      .dwattr $C$DW$663, DW_AT_name("GREP3SZR1")
    6946                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_GREP3SZR1")
    6947                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6948                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6949              $C$DW$664       .dwtag  DW_TAG_member
    6950                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$20)
    6951                      .dwattr $C$DW$664, DW_AT_name("GREP3SZR2")
    6952                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_GREP3SZR2")
    6953                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    6954                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6955              $C$DW$665       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$36)
    6957                      .dwattr $C$DW$665, DW_AT_name("RSVD19")
    6958                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_RSVD19")
    6959                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6960                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6961              $C$DW$666       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
    6963                      .dwattr $C$DW$666, DW_AT_name("GREP4SZR1")
    6964                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_GREP4SZR1")
    6965                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6966                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6967              $C$DW$667       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  167

    6968                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    6969                      .dwattr $C$DW$667, DW_AT_name("GREP4SZR2")
    6970                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_GREP4SZR2")
    6971                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6972                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6973              $C$DW$668       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$50)
    6975                      .dwattr $C$DW$668, DW_AT_name("RSVD20")
    6976                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_RSVD20")
    6977                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6978                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6979              $C$DW$669       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    6981                      .dwattr $C$DW$669, DW_AT_name("FADDR_POWER")
    6982                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_FADDR_POWER")
    6983                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    6984                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6985              $C$DW$670       .dwtag  DW_TAG_member
    6986                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    6987                      .dwattr $C$DW$670, DW_AT_name("INTRTX")
    6988                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_INTRTX")
    6989                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    6990                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6991              $C$DW$671       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$36)
    6993                      .dwattr $C$DW$671, DW_AT_name("RSVD21")
    6994                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_RSVD21")
    6995                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    6996                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6997              $C$DW$672       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$20)
    6999                      .dwattr $C$DW$672, DW_AT_name("INTRRX")
    7000                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_INTRRX")
    7001                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    7002                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7003              $C$DW$673       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$20)
    7005                      .dwattr $C$DW$673, DW_AT_name("INTRTXE")
    7006                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_INTRTXE")
    7007                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    7008                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7009              $C$DW$674       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$36)
    7011                      .dwattr $C$DW$674, DW_AT_name("RSVD22")
    7012                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_RSVD22")
    7013                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    7014                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7015              $C$DW$675       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    7017                      .dwattr $C$DW$675, DW_AT_name("INTRRXE")
    7018                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_INTRRXE")
    7019                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    7020                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$676       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  168

    7023                      .dwattr $C$DW$676, DW_AT_name("INTRUSB_INTRUSBE")
    7024                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    7025                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    7026                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$677       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$36)
    7029                      .dwattr $C$DW$677, DW_AT_name("RSVD23")
    7030                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_RSVD23")
    7031                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    7032                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$678       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$20)
    7035                      .dwattr $C$DW$678, DW_AT_name("FRAME")
    7036                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_FRAME")
    7037                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    7038                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7039              $C$DW$679       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$20)
    7041                      .dwattr $C$DW$679, DW_AT_name("INDEX_TESTMODE")
    7042                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    7043                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    7044                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7045              $C$DW$680       .dwtag  DW_TAG_member
    7046                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$36)
    7047                      .dwattr $C$DW$680, DW_AT_name("RSVD24")
    7048                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_RSVD24")
    7049                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    7050                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7051              $C$DW$681       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$20)
    7053                      .dwattr $C$DW$681, DW_AT_name("TXMAXP_INDX")
    7054                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    7055                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    7056                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$682       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$20)
    7059                      .dwattr $C$DW$682, DW_AT_name("PERI_CSR0_INDX")
    7060                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    7061                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    7062                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$683       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$36)
    7065                      .dwattr $C$DW$683, DW_AT_name("RSVD25")
    7066                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_RSVD25")
    7067                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    7068                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$684       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
    7071                      .dwattr $C$DW$684, DW_AT_name("RXMAXP_INDX")
    7072                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    7073                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    7074                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$685       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$20)
    7077                      .dwattr $C$DW$685, DW_AT_name("PERI_RXCSR_INDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  169

    7078                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    7079                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    7080                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$686       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$36)
    7083                      .dwattr $C$DW$686, DW_AT_name("RSVD26")
    7084                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_RSVD26")
    7085                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    7086                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$687       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$20)
    7089                      .dwattr $C$DW$687, DW_AT_name("COUNT0_INDX")
    7090                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_COUNT0_INDX")
    7091                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    7092                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7093              $C$DW$688       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$21)
    7095                      .dwattr $C$DW$688, DW_AT_name("RSVD27")
    7096                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_RSVD27")
    7097                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    7098                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7099              $C$DW$689       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$20)
    7101                      .dwattr $C$DW$689, DW_AT_name("CONFIGDATA_INDX")
    7102                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    7103                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    7104                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7105              $C$DW$690       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$36)
    7107                      .dwattr $C$DW$690, DW_AT_name("RSVD28")
    7108                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_RSVD28")
    7109                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    7110                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7111              $C$DW$691       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$20)
    7113                      .dwattr $C$DW$691, DW_AT_name("FIFO0R1")
    7114                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_FIFO0R1")
    7115                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    7116                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7117              $C$DW$692       .dwtag  DW_TAG_member
    7118                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$20)
    7119                      .dwattr $C$DW$692, DW_AT_name("FIFO0R2")
    7120                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_FIFO0R2")
    7121                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    7122                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7123              $C$DW$693       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$36)
    7125                      .dwattr $C$DW$693, DW_AT_name("RSVD29")
    7126                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_RSVD29")
    7127                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    7128                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7129              $C$DW$694       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    7131                      .dwattr $C$DW$694, DW_AT_name("FIFO1R1")
    7132                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_FIFO1R1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  170

    7133                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    7134                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7135              $C$DW$695       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$20)
    7137                      .dwattr $C$DW$695, DW_AT_name("FIFO1R2")
    7138                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_FIFO1R2")
    7139                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    7140                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$696       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$36)
    7143                      .dwattr $C$DW$696, DW_AT_name("RSVD30")
    7144                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_RSVD30")
    7145                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    7146                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$697       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$20)
    7149                      .dwattr $C$DW$697, DW_AT_name("FIFO2R1")
    7150                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_FIFO2R1")
    7151                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    7152                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$698       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$20)
    7155                      .dwattr $C$DW$698, DW_AT_name("FIFO2R2")
    7156                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_FIFO2R2")
    7157                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    7158                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7159              $C$DW$699       .dwtag  DW_TAG_member
    7160                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$36)
    7161                      .dwattr $C$DW$699, DW_AT_name("RSVD31")
    7162                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_RSVD31")
    7163                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    7164                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7165              $C$DW$700       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
    7167                      .dwattr $C$DW$700, DW_AT_name("FIFO3R1")
    7168                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_FIFO3R1")
    7169                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    7170                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7171              $C$DW$701       .dwtag  DW_TAG_member
    7172                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
    7173                      .dwattr $C$DW$701, DW_AT_name("FIFO3R2")
    7174                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_FIFO3R2")
    7175                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    7176                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7177              $C$DW$702       .dwtag  DW_TAG_member
    7178                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$36)
    7179                      .dwattr $C$DW$702, DW_AT_name("RSVD32")
    7180                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_RSVD32")
    7181                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    7182                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7183              $C$DW$703       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
    7185                      .dwattr $C$DW$703, DW_AT_name("FIFO4R1")
    7186                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_FIFO4R1")
    7187                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb_poll_example.asm                                             PAGE  171

    7188                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7189              $C$DW$704       .dwtag  DW_TAG_member
    7190                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    7191                      .dwattr $C$DW$704, DW_AT_name("FIFO4R2")
    7192                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_FIFO4R2")
    7193                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    7194                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7195              $C$DW$705       .dwtag  DW_TAG_member
    7196                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$51)
    7197                      .dwattr $C$DW$705, DW_AT_name("RSVD33")
    7198                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_RSVD33")
    7199                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    7200                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7201              $C$DW$706       .dwtag  DW_TAG_member
    7202                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    7203                      .dwattr $C$DW$706, DW_AT_name("DEVCTL")
    7204                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_DEVCTL")
    7205                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    7206                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7207              $C$DW$707       .dwtag  DW_TAG_member
    7208                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    7209                      .dwattr $C$DW$707, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    7210                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    7211                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    7212                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7213              $C$DW$708       .dwtag  DW_TAG_member
    7214                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$36)
    7215                      .dwattr $C$DW$708, DW_AT_name("RSVD34")
    7216                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_RSVD34")
    7217                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    7218                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7219              $C$DW$709       .dwtag  DW_TAG_member
    7220                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    7221                      .dwattr $C$DW$709, DW_AT_name("TXFIFOADDR")
    7222                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_TXFIFOADDR")
    7223                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    7224                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7225              $C$DW$710       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    7227                      .dwattr $C$DW$710, DW_AT_name("RXFIFOADDR")
    7228                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_RXFIFOADDR")
    7229                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    7230                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7231              $C$DW$711       .dwtag  DW_TAG_member
    7232                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$40)
    7233                      .dwattr $C$DW$711, DW_AT_name("RSVD35")
    7234                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_RSVD35")
