TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE    1

    3282              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:37 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1675                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1676              
    1677              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1678                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1679              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   47

    1680              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
    1681                      .dwendtag $C$DW$T$43
    1682              
    1683              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
    1684                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1685                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1686              
    1687              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1688                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1689              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
    1690              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
    1691              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
    1692              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
    1693              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    1694                      .dwendtag $C$DW$T$45
    1695              
    1696              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    1697                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1698                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1699              
    1700              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1701                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1702              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    1703              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    1704              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    1705              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    1706              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    1707              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    1708              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    1709              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    1710              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    1711              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    1712              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    1713              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    1714              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    1715              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    1716              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    1717              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    1718              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    1719              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    1720              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    1721              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    1722              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    1723              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    1724                      .dwendtag $C$DW$T$47
    1725              
    1726              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    1727                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1728                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1729              
    1730              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1731                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    1732              $C$DW$174       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1734                      .dwattr $C$DW$174, DW_AT_name("DMACH0SSAL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   48

    1735                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_DMACH0SSAL")
    1736                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$175       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1740                      .dwattr $C$DW$175, DW_AT_name("DMACH0SSAU")
    1741                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DMACH0SSAU")
    1742                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1743                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$176       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1746                      .dwattr $C$DW$176, DW_AT_name("DMACH0DSAL")
    1747                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_DMACH0DSAL")
    1748                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1749                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$177       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1752                      .dwattr $C$DW$177, DW_AT_name("DMACH0DSAU")
    1753                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMACH0DSAU")
    1754                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1755                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$178       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1758                      .dwattr $C$DW$178, DW_AT_name("DMACH0TCR1")
    1759                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DMACH0TCR1")
    1760                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1761                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$179       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1764                      .dwattr $C$DW$179, DW_AT_name("DMACH0TCR2")
    1765                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DMACH0TCR2")
    1766                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1767                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$180       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1770                      .dwattr $C$DW$180, DW_AT_name("RSVD0")
    1771                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD0")
    1772                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1773                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1774              $C$DW$181       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1776                      .dwattr $C$DW$181, DW_AT_name("DMACH1SSAL")
    1777                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMACH1SSAL")
    1778                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1779                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$182       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1782                      .dwattr $C$DW$182, DW_AT_name("DMACH1SSAU")
    1783                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMACH1SSAU")
    1784                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1785                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$183       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1788                      .dwattr $C$DW$183, DW_AT_name("DMACH1DSAL")
    1789                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMACH1DSAL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   49

    1790                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1791                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$184       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1794                      .dwattr $C$DW$184, DW_AT_name("DMACH1DSAU")
    1795                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DMACH1DSAU")
    1796                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1797                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$185       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1800                      .dwattr $C$DW$185, DW_AT_name("DMACH1TCR1")
    1801                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DMACH1TCR1")
    1802                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1803                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1804              $C$DW$186       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1806                      .dwattr $C$DW$186, DW_AT_name("DMACH1TCR2")
    1807                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DMACH1TCR2")
    1808                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1809                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$187       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    1812                      .dwattr $C$DW$187, DW_AT_name("RSVD1")
    1813                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_RSVD1")
    1814                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1815                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$188       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1818                      .dwattr $C$DW$188, DW_AT_name("DMACH2SSAL")
    1819                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DMACH2SSAL")
    1820                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1821                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$189       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1824                      .dwattr $C$DW$189, DW_AT_name("DMACH2SSAU")
    1825                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DMACH2SSAU")
    1826                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1827                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$190       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1830                      .dwattr $C$DW$190, DW_AT_name("DMACH2DSAL")
    1831                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DMACH2DSAL")
    1832                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1833                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1834              $C$DW$191       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1836                      .dwattr $C$DW$191, DW_AT_name("DMACH2DSAU")
    1837                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DMACH2DSAU")
    1838                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1839                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1840              $C$DW$192       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1842                      .dwattr $C$DW$192, DW_AT_name("DMACH2TCR1")
    1843                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DMACH2TCR1")
    1844                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   50

    1845                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1846              $C$DW$193       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1848                      .dwattr $C$DW$193, DW_AT_name("DMACH2TCR2")
    1849                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DMACH2TCR2")
    1850                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1851                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1852              $C$DW$194       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    1854                      .dwattr $C$DW$194, DW_AT_name("RSVD2")
    1855                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD2")
    1856                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1857                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1858              $C$DW$195       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1860                      .dwattr $C$DW$195, DW_AT_name("DMACH3SSAL")
    1861                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DMACH3SSAL")
    1862                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1863                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1864              $C$DW$196       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1866                      .dwattr $C$DW$196, DW_AT_name("DMACH3SSAU")
    1867                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DMACH3SSAU")
    1868                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    1869                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$197       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1872                      .dwattr $C$DW$197, DW_AT_name("DMACH3DSAL")
    1873                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_DMACH3DSAL")
    1874                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1875                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1876              $C$DW$198       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    1878                      .dwattr $C$DW$198, DW_AT_name("DMACH3DSAU")
    1879                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DMACH3DSAU")
    1880                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1881                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1882              $C$DW$199       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1884                      .dwattr $C$DW$199, DW_AT_name("DMACH3TCR1")
    1885                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DMACH3TCR1")
    1886                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1887                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1888              $C$DW$200       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1890                      .dwattr $C$DW$200, DW_AT_name("DMACH3TCR2")
    1891                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_DMACH3TCR2")
    1892                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    1893                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1894                      .dwendtag $C$DW$T$22
    1895              
    1896              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    1897                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1898                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1899              $C$DW$201       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   51

    1900                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    1901              $C$DW$202       .dwtag  DW_TAG_TI_ioport_type
    1902                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$201)
    1903              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1904                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$202)
    1905              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1906                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1907                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    1908              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    1909                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1910                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1911              
    1912              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1913                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    1914              $C$DW$203       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$26)
    1916                      .dwattr $C$DW$203, DW_AT_name("dmaRegs")
    1917                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_dmaRegs")
    1918                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$204       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$28)
    1922                      .dwattr $C$DW$204, DW_AT_name("chanNum")
    1923                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_chanNum")
    1924                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1925                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$205       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$30)
    1928                      .dwattr $C$DW$205, DW_AT_name("dmaInstNum")
    1929                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_dmaInstNum")
    1930                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1931                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$206       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1934                      .dwattr $C$DW$206, DW_AT_name("isChanFree")
    1935                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_isChanFree")
    1936                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1937                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$207       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$33)
    1940                      .dwattr $C$DW$207, DW_AT_name("chanDir")
    1941                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_chanDir")
    1942                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1943                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$208       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$35)
    1946                      .dwattr $C$DW$208, DW_AT_name("trigger")
    1947                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_trigger")
    1948                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1949                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$209       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$37)
    1952                      .dwattr $C$DW$209, DW_AT_name("trfType")
    1953                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_trfType")
    1954                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   52

    1955                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$210       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$39)
    1958                      .dwattr $C$DW$210, DW_AT_name("dmaInt")
    1959                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_dmaInt")
    1960                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1961                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$211       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1964                      .dwattr $C$DW$211, DW_AT_name("pingPongEnabled")
    1965                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_pingPongEnabled")
    1966                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1967                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1968                      .dwendtag $C$DW$T$40
    1969              
    1970              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    1971                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    1972                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1973              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    1974                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    1975                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    1976              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    1977                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    1978                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1979              
    1980              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1981                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
    1982              $C$DW$212       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$42)
    1984                      .dwattr $C$DW$212, DW_AT_name("pingPongMode")
    1985                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_pingPongMode")
    1986                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$213       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$44)
    1990                      .dwattr $C$DW$213, DW_AT_name("autoMode")
    1991                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_autoMode")
    1992                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1993                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$214       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$46)
    1996                      .dwattr $C$DW$214, DW_AT_name("burstLen")
    1997                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_burstLen")
    1998                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1999                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$215       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$35)
    2002                      .dwattr $C$DW$215, DW_AT_name("trigger")
    2003                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_trigger")
    2004                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2005                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$216       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$48)
    2008                      .dwattr $C$DW$216, DW_AT_name("dmaEvt")
    2009                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_dmaEvt")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   53

    2010                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2011                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$217       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$39)
    2014                      .dwattr $C$DW$217, DW_AT_name("dmaInt")
    2015                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_dmaInt")
    2016                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2017                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$218       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$33)
    2020                      .dwattr $C$DW$218, DW_AT_name("chanDir")
    2021                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_chanDir")
    2022                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2023                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$219       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$37)
    2026                      .dwattr $C$DW$219, DW_AT_name("trfType")
    2027                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_trfType")
    2028                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2029                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$220       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$220, DW_AT_name("dataLen")
    2033                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_dataLen")
    2034                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2035                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$221       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$49)
    2038                      .dwattr $C$DW$221, DW_AT_name("srcAddr")
    2039                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_srcAddr")
    2040                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2041                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$222       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$49)
    2044                      .dwattr $C$DW$222, DW_AT_name("destAddr")
    2045                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_destAddr")
    2046                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2047                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2048                      .dwendtag $C$DW$T$50
    2049              
    2050              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2051                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    2052                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2053              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    2054                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2055                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    2056              
    2057              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2058                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x39)
    2059              $C$DW$223       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2061                      .dwattr $C$DW$223, DW_AT_name("ICOAR")
    2062                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_ICOAR")
    2063                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   54

    2065              $C$DW$224       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$51)
    2067                      .dwattr $C$DW$224, DW_AT_name("RSVD0")
    2068                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD0")
    2069                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2070                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$225       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2073                      .dwattr $C$DW$225, DW_AT_name("ICIMR")
    2074                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_ICIMR")
    2075                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2076                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$226       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$51)
    2079                      .dwattr $C$DW$226, DW_AT_name("RSVD1")
    2080                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD1")
    2081                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2082                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$227       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2085                      .dwattr $C$DW$227, DW_AT_name("ICSTR")
    2086                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ICSTR")
    2087                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2088                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$228       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$51)
    2091                      .dwattr $C$DW$228, DW_AT_name("RSVD2")
    2092                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD2")
    2093                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2094                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$229       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2097                      .dwattr $C$DW$229, DW_AT_name("ICCLKL")
    2098                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ICCLKL")
    2099                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2100                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$230       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$51)
    2103                      .dwattr $C$DW$230, DW_AT_name("RSVD3")
    2104                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RSVD3")
    2105                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2106                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$231       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2109                      .dwattr $C$DW$231, DW_AT_name("ICCLKH")
    2110                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_ICCLKH")
    2111                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2112                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2113              $C$DW$232       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$51)
    2115                      .dwattr $C$DW$232, DW_AT_name("RSVD4")
    2116                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RSVD4")
    2117                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2118                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2119              $C$DW$233       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   55

    2120                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2121                      .dwattr $C$DW$233, DW_AT_name("ICCNT")
    2122                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_ICCNT")
    2123                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2124                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2125              $C$DW$234       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$51)
    2127                      .dwattr $C$DW$234, DW_AT_name("RSVD5")
    2128                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RSVD5")
    2129                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2130                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2131              $C$DW$235       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2133                      .dwattr $C$DW$235, DW_AT_name("ICDRR")
    2134                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_ICDRR")
    2135                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2136                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2137              $C$DW$236       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$51)
    2139                      .dwattr $C$DW$236, DW_AT_name("RSVD6")
    2140                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD6")
    2141                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2142                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2143              $C$DW$237       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    2145                      .dwattr $C$DW$237, DW_AT_name("ICSAR")
    2146                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ICSAR")
    2147                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2148                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2149              $C$DW$238       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$51)
    2151                      .dwattr $C$DW$238, DW_AT_name("RSVD7")
    2152                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSVD7")
    2153                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2154                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2155              $C$DW$239       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2157                      .dwattr $C$DW$239, DW_AT_name("ICDXR")
    2158                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_ICDXR")
    2159                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2160                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2161              $C$DW$240       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$51)
    2163                      .dwattr $C$DW$240, DW_AT_name("RSVD8")
    2164                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_RSVD8")
    2165                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2166                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2167              $C$DW$241       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2169                      .dwattr $C$DW$241, DW_AT_name("ICMDR")
    2170                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_ICMDR")
    2171                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2172                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$242       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$51)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   56

    2175                      .dwattr $C$DW$242, DW_AT_name("RSVD9")
    2176                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD9")
    2177                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2178                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2179              $C$DW$243       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2181                      .dwattr $C$DW$243, DW_AT_name("ICIVR")
    2182                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_ICIVR")
    2183                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2184                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$244       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$51)
    2187                      .dwattr $C$DW$244, DW_AT_name("RSVD10")
    2188                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD10")
    2189                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2190                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2191              $C$DW$245       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2193                      .dwattr $C$DW$245, DW_AT_name("ICEMDR")
    2194                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ICEMDR")
    2195                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2196                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2197              $C$DW$246       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$51)
    2199                      .dwattr $C$DW$246, DW_AT_name("RSVD11")
    2200                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD11")
    2201                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2202                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2203              $C$DW$247       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2205                      .dwattr $C$DW$247, DW_AT_name("ICPSC")
    2206                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_ICPSC")
    2207                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2208                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$248       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$51)
    2211                      .dwattr $C$DW$248, DW_AT_name("RSVD12")
    2212                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_RSVD12")
    2213                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2214                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$249       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2217                      .dwattr $C$DW$249, DW_AT_name("ICPID1")
    2218                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_ICPID1")
    2219                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2220                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$250       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$51)
    2223                      .dwattr $C$DW$250, DW_AT_name("RSVD13")
    2224                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_RSVD13")
    2225                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2226                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$251       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2229                      .dwattr $C$DW$251, DW_AT_name("ICPID2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   57

    2230                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_ICPID2")
    2231                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2232                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2233                      .dwendtag $C$DW$T$52
    2234              
    2235              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
    2236                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$52)
    2237                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2238              $C$DW$252       .dwtag  DW_TAG_TI_far_type
    2239                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$58)
    2240              $C$DW$253       .dwtag  DW_TAG_TI_ioport_type
    2241                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$252)
    2242              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    2243                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$253)
    2244              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2245                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2246                      .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    2247              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
    2248                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2249                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2250              
    2251              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2252                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x48)
    2253              $C$DW$254       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2255                      .dwattr $C$DW$254, DW_AT_name("EBSR")
    2256                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_EBSR")
    2257                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$255       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2261                      .dwattr $C$DW$255, DW_AT_name("RSVD0")
    2262                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RSVD0")
    2263                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2264                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$256       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2267                      .dwattr $C$DW$256, DW_AT_name("PCGCR1")
    2268                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_PCGCR1")
    2269                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2270                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$257       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2273                      .dwattr $C$DW$257, DW_AT_name("PCGCR2")
    2274                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_PCGCR2")
    2275                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2276                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$258       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2279                      .dwattr $C$DW$258, DW_AT_name("PSRCR")
    2280                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_PSRCR")
    2281                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2282                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$259       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   58

    2285                      .dwattr $C$DW$259, DW_AT_name("PRCR")
    2286                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_PRCR")
    2287                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2288                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$260       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$53)
    2291                      .dwattr $C$DW$260, DW_AT_name("RSVD1")
    2292                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_RSVD1")
    2293                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2294                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$261       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2297                      .dwattr $C$DW$261, DW_AT_name("TIAFR")
    2298                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_TIAFR")
    2299                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2300                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$262       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2303                      .dwattr $C$DW$262, DW_AT_name("RSVD2")
    2304                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_RSVD2")
    2305                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2306                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$263       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2309                      .dwattr $C$DW$263, DW_AT_name("ODSCR")
    2310                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_ODSCR")
    2311                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2312                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$264       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2315                      .dwattr $C$DW$264, DW_AT_name("PDINHIBR1")
    2316                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_PDINHIBR1")
    2317                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2318                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$265       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2321                      .dwattr $C$DW$265, DW_AT_name("PDINHIBR2")
    2322                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_PDINHIBR2")
    2323                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2324                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$266       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2327                      .dwattr $C$DW$266, DW_AT_name("PDINHIBR3")
    2328                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PDINHIBR3")
    2329                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2330                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$267       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2333                      .dwattr $C$DW$267, DW_AT_name("DMA0CESR1")
    2334                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_DMA0CESR1")
    2335                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2336                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$268       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2339                      .dwattr $C$DW$268, DW_AT_name("DMA0CESR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   59

    2340                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_DMA0CESR2")
    2341                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2342                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$269       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2345                      .dwattr $C$DW$269, DW_AT_name("DMA1CESR1")
    2346                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DMA1CESR1")
    2347                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2348                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$270       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    2351                      .dwattr $C$DW$270, DW_AT_name("DMA1CESR2")
    2352                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_DMA1CESR2")
    2353                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2354                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$271       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2357                      .dwattr $C$DW$271, DW_AT_name("SDRAMCCR")
    2358                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_SDRAMCCR")
    2359                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2360                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$272       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2363                      .dwattr $C$DW$272, DW_AT_name("CCR2")
    2364                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_CCR2")
    2365                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2366                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$273       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2369                      .dwattr $C$DW$273, DW_AT_name("CGCR1")
    2370                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_CGCR1")
    2371                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2372                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$274       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2375                      .dwattr $C$DW$274, DW_AT_name("CGICR")
    2376                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_CGICR")
    2377                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2378                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$275       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2381                      .dwattr $C$DW$275, DW_AT_name("CGCR2")
    2382                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_CGCR2")
    2383                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2384                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$276       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2387                      .dwattr $C$DW$276, DW_AT_name("CGOCR")
    2388                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_CGOCR")
    2389                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2390                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$277       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2393                      .dwattr $C$DW$277, DW_AT_name("CCSSR")
    2394                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_CCSSR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   60

    2395                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2396                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$278       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2399                      .dwattr $C$DW$278, DW_AT_name("RSVD3")
    2400                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_RSVD3")
    2401                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2402                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$279       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2405                      .dwattr $C$DW$279, DW_AT_name("ECDR")
    2406                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_ECDR")
    2407                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2408                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$280       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2411                      .dwattr $C$DW$280, DW_AT_name("RSVD4")
    2412                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_RSVD4")
    2413                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2414                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$281       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2417                      .dwattr $C$DW$281, DW_AT_name("RAMSLPMDCNTLR1")
    2418                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2419                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2420                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$282       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2423                      .dwattr $C$DW$282, DW_AT_name("RSVD5")
    2424                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_RSVD5")
    2425                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2426                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$283       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2429                      .dwattr $C$DW$283, DW_AT_name("RAMSLPMDCNTLR2")
    2430                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2431                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2432                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$284       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2435                      .dwattr $C$DW$284, DW_AT_name("RAMSLPMDCNTLR3")
    2436                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2437                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2438                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$285       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    2441                      .dwattr $C$DW$285, DW_AT_name("RAMSLPMDCNTLR4")
    2442                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2443                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2444                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$286       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2447                      .dwattr $C$DW$286, DW_AT_name("RAMSLPMDCNTLR5")
    2448                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2449                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   61

    2450                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$287       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$54)
    2453                      .dwattr $C$DW$287, DW_AT_name("RSVD6")
    2454                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD6")
    2455                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2456                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$288       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2459                      .dwattr $C$DW$288, DW_AT_name("DMAIFR")
    2460                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_DMAIFR")
    2461                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2462                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$289       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2465                      .dwattr $C$DW$289, DW_AT_name("DMAIER")
    2466                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_DMAIER")
    2467                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2468                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2469              $C$DW$290       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2471                      .dwattr $C$DW$290, DW_AT_name("USBSCR")
    2472                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_USBSCR")
    2473                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2474                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$291       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    2477                      .dwattr $C$DW$291, DW_AT_name("ESCR")
    2478                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_ESCR")
    2479                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2480                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2481              $C$DW$292       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$54)
    2483                      .dwattr $C$DW$292, DW_AT_name("RSVD7")
    2484                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_RSVD7")
    2485                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2486                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2487              $C$DW$293       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    2489                      .dwattr $C$DW$293, DW_AT_name("DMA2CESR1")
    2490                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_DMA2CESR1")
    2491                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2492                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2493              $C$DW$294       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2495                      .dwattr $C$DW$294, DW_AT_name("DMA2CESR2")
    2496                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_DMA2CESR2")
    2497                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2498                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2499              $C$DW$295       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    2501                      .dwattr $C$DW$295, DW_AT_name("DMA3CESR1")
    2502                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_DMA3CESR1")
    2503                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2504                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   62

    2505              $C$DW$296       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2507                      .dwattr $C$DW$296, DW_AT_name("DMA3CESR2")
    2508                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_DMA3CESR2")
    2509                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2510                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2511              $C$DW$297       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2513                      .dwattr $C$DW$297, DW_AT_name("CLKSTOP")
    2514                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_CLKSTOP")
    2515                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2516                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$298       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$55)
    2519                      .dwattr $C$DW$298, DW_AT_name("RSVD8")
    2520                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_RSVD8")
    2521                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2522                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$299       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    2525                      .dwattr $C$DW$299, DW_AT_name("DIEIDR0")
    2526                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_DIEIDR0")
    2527                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2528                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$300       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2531                      .dwattr $C$DW$300, DW_AT_name("DIEIDR1")
    2532                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_DIEIDR1")
    2533                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2534                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$301       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    2537                      .dwattr $C$DW$301, DW_AT_name("DIEIDR2")
    2538                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_DIEIDR2")
    2539                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2540                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$302       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    2543                      .dwattr $C$DW$302, DW_AT_name("DIEIDR3")
    2544                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_DIEIDR3")
    2545                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2546                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$303       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    2549                      .dwattr $C$DW$303, DW_AT_name("DIEIDR4")
    2550                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_DIEIDR4")
    2551                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2552                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$304       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2555                      .dwattr $C$DW$304, DW_AT_name("DIEIDR5")
    2556                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_DIEIDR5")
    2557                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2558                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$305       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   63

    2560                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    2561                      .dwattr $C$DW$305, DW_AT_name("DIEIDR6")
    2562                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_DIEIDR6")
    2563                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2564                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$306       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2567                      .dwattr $C$DW$306, DW_AT_name("DIEIDR7")
    2568                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_DIEIDR7")
    2569                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2570                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2571                      .dwendtag $C$DW$T$56
    2572              
    2573              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2574                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$56)
    2575                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2576              $C$DW$307       .dwtag  DW_TAG_TI_far_type
    2577                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$62)
    2578              $C$DW$308       .dwtag  DW_TAG_TI_ioport_type
    2579                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$307)
    2580              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    2581                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$308)
    2582              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2583                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2584                      .dwattr $C$DW$T$64, DW_AT_address_class(0x10)
    2585              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2586                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2587                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2588              
    2589              $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    2590                      .dwattr $C$DW$T$71, DW_AT_name("CSL_I2cAddrMode")
    2591                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x01)
    2592              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
    2593              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
    2594                      .dwendtag $C$DW$T$71
    2595              
    2596              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
    2597                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2598                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2599              
    2600              $C$DW$T$73      .dwtag  DW_TAG_enumeration_type
    2601                      .dwattr $C$DW$T$73, DW_AT_name("CSL_I2cBitCount")
    2602                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    2603              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
    2604              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
    2605              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
    2606              $C$DW$314       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
    2607              $C$DW$315       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
    2608              $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
    2609              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
    2610              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
    2611                      .dwendtag $C$DW$T$73
    2612              
    2613              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
    2614                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   64

    2615                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2616              
    2617              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2618                      .dwattr $C$DW$T$57, DW_AT_name("CSL_I2cConfig")
    2619                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x09)
    2620              $C$DW$319       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$319, DW_AT_name("icoar")
    2623                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_icoar")
    2624                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$320       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$320, DW_AT_name("icimr")
    2629                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_icimr")
    2630                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2631                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$321       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$321, DW_AT_name("icclkl")
    2635                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_icclkl")
    2636                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2637                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$322       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$322, DW_AT_name("icclkh")
    2641                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_icclkh")
    2642                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2643                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$323       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$323, DW_AT_name("iccnt")
    2647                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_iccnt")
    2648                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2649                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$324       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    2652                      .dwattr $C$DW$324, DW_AT_name("icsar")
    2653                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_icsar")
    2654                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2655                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$325       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    2658                      .dwattr $C$DW$325, DW_AT_name("icmdr")
    2659                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_icmdr")
    2660                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2661                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$326       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    2664                      .dwattr $C$DW$326, DW_AT_name("icemdr")
    2665                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_icemdr")
    2666                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2667                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$327       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   65

    2670                      .dwattr $C$DW$327, DW_AT_name("icpsc")
    2671                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_icpsc")
    2672                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2673                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2674                      .dwendtag $C$DW$T$57
    2675              
    2676              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
    2677                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$57)
    2678                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2679              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    2680                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    2681                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    2682              
    2683              $C$DW$T$77      .dwtag  DW_TAG_enumeration_type
    2684                      .dwattr $C$DW$T$77, DW_AT_name("CSL_I2cFreeMode")
    2685                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x01)
    2686              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
    2687              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
    2688                      .dwendtag $C$DW$T$77
    2689              
    2690              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
    2691                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    2692                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2693              
    2694              $C$DW$T$75      .dwtag  DW_TAG_enumeration_type
    2695                      .dwattr $C$DW$T$75, DW_AT_name("CSL_I2cLoopback")
    2696                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    2697              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
    2698              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
    2699                      .dwendtag $C$DW$T$75
    2700              
    2701              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
    2702                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2703                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2704              
    2705              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    2706                      .dwattr $C$DW$T$70, DW_AT_name("CSL_I2cObj")
    2707                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x10)
    2708              $C$DW$332       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$61)
    2710                      .dwattr $C$DW$332, DW_AT_name("i2cRegs")
    2711                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_i2cRegs")
    2712                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$333       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$65)
    2716                      .dwattr $C$DW$333, DW_AT_name("sysCtrlRegs")
    2717                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_sysCtrlRegs")
    2718                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2719                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$334       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$69)
    2722                      .dwattr $C$DW$334, DW_AT_name("I2C_isrDispatchTable")
    2723                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_I2C_isrDispatchTable")
    2724                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   66

    2725                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2726                      .dwendtag $C$DW$T$70
    2727              
    2728              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cObj")
    2729                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$70)
    2730                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2731              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2732                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2733                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    2734              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("pI2cHandle")
    2735                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2736                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2737              
    2738              $C$DW$T$79      .dwtag  DW_TAG_enumeration_type
    2739                      .dwattr $C$DW$T$79, DW_AT_name("CSL_I2cRepeatMode")
    2740                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
    2741              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
    2742              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
    2743                      .dwendtag $C$DW$T$79
    2744              
    2745              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
    2746                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    2747                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2748              
    2749              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    2750                      .dwattr $C$DW$T$81, DW_AT_name("CSL_I2cSetup")
    2751                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    2752              $C$DW$337       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$72)
    2754                      .dwattr $C$DW$337, DW_AT_name("addrMode")
    2755                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_addrMode")
    2756                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$338       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$74)
    2760                      .dwattr $C$DW$338, DW_AT_name("bitCount")
    2761                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_bitCount")
    2762                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2763                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$339       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$76)
    2766                      .dwattr $C$DW$339, DW_AT_name("loopBack")
    2767                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_loopBack")
    2768                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2769                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$340       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$78)
    2772                      .dwattr $C$DW$340, DW_AT_name("freeMode")
    2773                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_freeMode")
    2774                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2775                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$341       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$80)
    2778                      .dwattr $C$DW$341, DW_AT_name("repeatMode")
    2779                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_repeatMode")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   67

    2780                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2781                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$342       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$342, DW_AT_name("ownAddr")
    2785                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_ownAddr")
    2786                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2787                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$343       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$49)
    2790                      .dwattr $C$DW$343, DW_AT_name("sysInputClk")
    2791                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_sysInputClk")
    2792                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2793                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2794              $C$DW$344       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$49)
    2796                      .dwattr $C$DW$344, DW_AT_name("i2cBusFreq")
    2797                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_i2cBusFreq")
    2798                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2799                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2800                      .dwendtag $C$DW$T$81
    2801              
    2802              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
    2803                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$81)
    2804                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2805              
    2806              $C$DW$T$66      .dwtag  DW_TAG_subroutine_type
    2807                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2808              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    2809                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2810                      .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    2811              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2C_EVENT_ISR")
    2812                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2813                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2814              
    2815              $C$DW$T$69      .dwtag  DW_TAG_array_type
    2816                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2817                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2818                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x0e)
    2819              $C$DW$345       .dwtag  DW_TAG_subrange_type
    2820                      .dwattr $C$DW$345, DW_AT_upper_bound(0x06)
    2821                      .dwendtag $C$DW$T$69
    2822              
    2823              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2824                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2825                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2826                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2827              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2828                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2829                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2830                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2831              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2832                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2833                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2834                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c_dma_example.asm                                              PAGE   68

    2835              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2836                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2837                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2838                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2839              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2840                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2841                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2842                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2843              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2844                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    2845                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2846              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2847                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2848                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2849              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    2850                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2851                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    2852              $C$DW$346       .dwtag  DW_TAG_TI_far_type
