TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE    1

    4340              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:02 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2077              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    2078              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    2079              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    2080              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    2081              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    2082              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    2083              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    2084              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   67

    2085              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    2086              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    2087              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    2088              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    2089              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    2090              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    2091              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    2092              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    2093              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    2094              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    2095                      .dwendtag $C$DW$T$72
    2096              
    2097              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    2098                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2099                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2100              
    2101              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    2102                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    2103              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    2104              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    2105              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    2106              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    2107                      .dwendtag $C$DW$T$85
    2108              
    2109              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    2110                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2111                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2112              
    2113              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    2114                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    2115              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    2116              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    2117                      .dwendtag $C$DW$T$96
    2118              
    2119              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    2120                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2121                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2122              
    2123              $C$DW$T$102     .dwtag  DW_TAG_enumeration_type
    2124                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
    2125              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
    2126              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
    2127              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
    2128                      .dwendtag $C$DW$T$102
    2129              
    2130              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
    2131                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    2132                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2133              
    2134              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2135                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    2136              $C$DW$262       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2138                      .dwattr $C$DW$262, DW_AT_name("MMCCTL")
    2139                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_MMCCTL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   68

    2140                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$263       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    2144                      .dwattr $C$DW$263, DW_AT_name("RSVD0")
    2145                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_RSVD0")
    2146                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2147                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$264       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2150                      .dwattr $C$DW$264, DW_AT_name("MMCCLK")
    2151                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_MMCCLK")
    2152                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2153                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$265       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    2156                      .dwattr $C$DW$265, DW_AT_name("RSVD1")
    2157                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_RSVD1")
    2158                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2159                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$266       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2162                      .dwattr $C$DW$266, DW_AT_name("MMCST0")
    2163                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_MMCST0")
    2164                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2165                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$267       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    2168                      .dwattr $C$DW$267, DW_AT_name("RSVD2")
    2169                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RSVD2")
    2170                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2171                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2172              $C$DW$268       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2174                      .dwattr $C$DW$268, DW_AT_name("MMCST1")
    2175                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_MMCST1")
    2176                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2177                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$269       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    2180                      .dwattr $C$DW$269, DW_AT_name("RSVD3")
    2181                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_RSVD3")
    2182                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2183                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$270       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    2186                      .dwattr $C$DW$270, DW_AT_name("MMCIM")
    2187                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_MMCIM")
    2188                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2189                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$271       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    2192                      .dwattr $C$DW$271, DW_AT_name("RSVD4")
    2193                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_RSVD4")
    2194                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   69

    2195                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2196              $C$DW$272       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2198                      .dwattr $C$DW$272, DW_AT_name("MMCTOR")
    2199                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_MMCTOR")
    2200                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2201                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$273       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    2204                      .dwattr $C$DW$273, DW_AT_name("RSVD5")
    2205                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_RSVD5")
    2206                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2207                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$274       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2210                      .dwattr $C$DW$274, DW_AT_name("MMCTOD")
    2211                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_MMCTOD")
    2212                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2213                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$275       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    2216                      .dwattr $C$DW$275, DW_AT_name("RSVD6")
    2217                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_RSVD6")
    2218                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2219                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$276       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2222                      .dwattr $C$DW$276, DW_AT_name("MMCBLEN")
    2223                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_MMCBLEN")
    2224                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2225                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2226              $C$DW$277       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    2228                      .dwattr $C$DW$277, DW_AT_name("RSVD7")
    2229                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_RSVD7")
    2230                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2231                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2232              $C$DW$278       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2234                      .dwattr $C$DW$278, DW_AT_name("MMCNBLK")
    2235                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_MMCNBLK")
    2236                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2237                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2238              $C$DW$279       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    2240                      .dwattr $C$DW$279, DW_AT_name("RSVD8")
    2241                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD8")
    2242                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2243                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$280       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2246                      .dwattr $C$DW$280, DW_AT_name("MMCNBLC")
    2247                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_MMCNBLC")
    2248                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2249                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   70

    2250              $C$DW$281       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    2252                      .dwattr $C$DW$281, DW_AT_name("RSVD9")
    2253                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_RSVD9")
    2254                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2255                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$282       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2258                      .dwattr $C$DW$282, DW_AT_name("MMCDRR1")
    2259                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_MMCDRR1")
    2260                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2261                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$283       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2264                      .dwattr $C$DW$283, DW_AT_name("MMCDRR2")
    2265                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_MMCDRR2")
    2266                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2267                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$284       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    2270                      .dwattr $C$DW$284, DW_AT_name("RSVD10")
    2271                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RSVD10")
    2272                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2273                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$285       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    2276                      .dwattr $C$DW$285, DW_AT_name("MMCDXR1")
    2277                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_MMCDXR1")
    2278                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2279                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2280              $C$DW$286       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2282                      .dwattr $C$DW$286, DW_AT_name("MMCDXR2")
    2283                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_MMCDXR2")
    2284                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2285                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$287       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$22)
    2288                      .dwattr $C$DW$287, DW_AT_name("RSVD11")
    2289                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD11")
    2290                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2291                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$288       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2294                      .dwattr $C$DW$288, DW_AT_name("MMCCMD1")
    2295                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_MMCCMD1")
    2296                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2297                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$289       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2300                      .dwattr $C$DW$289, DW_AT_name("MMCCMD2")
    2301                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_MMCCMD2")
    2302                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2303                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$290       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   71

    2305                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$22)
    2306                      .dwattr $C$DW$290, DW_AT_name("RSVD12")
    2307                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_RSVD12")
    2308                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2309                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$291       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    2312                      .dwattr $C$DW$291, DW_AT_name("MMCARG1")
    2313                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_MMCARG1")
    2314                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2315                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$292       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2318                      .dwattr $C$DW$292, DW_AT_name("MMCARG2")
    2319                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_MMCARG2")
    2320                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2321                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$293       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$22)
    2324                      .dwattr $C$DW$293, DW_AT_name("RSVD13")
    2325                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD13")
    2326                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2327                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$294       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2330                      .dwattr $C$DW$294, DW_AT_name("MMCRSP0")
    2331                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_MMCRSP0")
    2332                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2333                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$295       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    2336                      .dwattr $C$DW$295, DW_AT_name("MMCRSP1")
    2337                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_MMCRSP1")
    2338                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2339                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$296       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
    2342                      .dwattr $C$DW$296, DW_AT_name("RSVD14")
    2343                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_RSVD14")
    2344                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2345                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$297       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2348                      .dwattr $C$DW$297, DW_AT_name("MMCRSP2")
    2349                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_MMCRSP2")
    2350                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2351                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$298       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2354                      .dwattr $C$DW$298, DW_AT_name("MMCRSP3")
    2355                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_MMCRSP3")
    2356                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    2357                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$299       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   72

    2360                      .dwattr $C$DW$299, DW_AT_name("RSVD15")
    2361                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD15")
    2362                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2363                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$300       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    2366                      .dwattr $C$DW$300, DW_AT_name("MMCRSP4")
    2367                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_MMCRSP4")
    2368                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2369                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$301       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    2372                      .dwattr $C$DW$301, DW_AT_name("MMCRSP5")
    2373                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_MMCRSP5")
    2374                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2375                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$302       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$22)
    2378                      .dwattr $C$DW$302, DW_AT_name("RSVD16")
    2379                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_RSVD16")
    2380                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2381                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$303       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    2384                      .dwattr $C$DW$303, DW_AT_name("MMCRSP6")
    2385                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_MMCRSP6")
    2386                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2387                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$304       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    2390                      .dwattr $C$DW$304, DW_AT_name("MMCRSP7")
    2391                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_MMCRSP7")
    2392                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2393                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$305       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    2396                      .dwattr $C$DW$305, DW_AT_name("RSVD17")
    2397                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD17")
    2398                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2399                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$306       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2402                      .dwattr $C$DW$306, DW_AT_name("MMCDRSP")
    2403                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_MMCDRSP")
    2404                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2405                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$307       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$23)
    2408                      .dwattr $C$DW$307, DW_AT_name("RSVD18")
    2409                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD18")
    2410                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2411                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$308       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2414                      .dwattr $C$DW$308, DW_AT_name("MMCCIDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   73

    2415                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_MMCCIDX")
    2416                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2417                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$309       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    2420                      .dwattr $C$DW$309, DW_AT_name("RSVD19")
    2421                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD19")
    2422                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    2423                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$310       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2426                      .dwattr $C$DW$310, DW_AT_name("SDIOCTL")
    2427                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_SDIOCTL")
    2428                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2429                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$311       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    2432                      .dwattr $C$DW$311, DW_AT_name("RSVD20")
    2433                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD20")
    2434                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2435                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$312       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    2438                      .dwattr $C$DW$312, DW_AT_name("SDIOST0")
    2439                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_SDIOST0")
    2440                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2441                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$313       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    2444                      .dwattr $C$DW$313, DW_AT_name("RSVD21")
    2445                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_RSVD21")
    2446                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    2447                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$314       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    2450                      .dwattr $C$DW$314, DW_AT_name("SDIOIEN")
    2451                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_SDIOIEN")
    2452                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2453                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$315       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    2456                      .dwattr $C$DW$315, DW_AT_name("RSVD22")
    2457                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD22")
    2458                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    2459                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$316       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2462                      .dwattr $C$DW$316, DW_AT_name("SDIOIST")
    2463                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_SDIOIST")
    2464                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2465                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$317       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    2468                      .dwattr $C$DW$317, DW_AT_name("RSVD23")
    2469                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD23")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   74

    2470                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    2471                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$318       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    2474                      .dwattr $C$DW$318, DW_AT_name("MMCFIFOCTL")
    2475                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    2476                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2477                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2478                      .dwendtag $C$DW$T$25
    2479              
    2480              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    2481                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
    2482                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2483              $C$DW$319       .dwtag  DW_TAG_TI_far_type
    2484                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$77)
    2485              $C$DW$320       .dwtag  DW_TAG_TI_ioport_type
    2486                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$319)
    2487              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    2488                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$320)
    2489              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    2490                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    2491                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    2492              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    2493                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    2494                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2495              
    2496              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2497                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2498              $C$DW$321       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    2500                      .dwattr $C$DW$321, DW_AT_name("mfgId")
    2501                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_mfgId")
    2502                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$322       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    2506                      .dwattr $C$DW$322, DW_AT_name("oemAppId")
    2507                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_oemAppId")
    2508                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2509                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$323       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    2512                      .dwattr $C$DW$323, DW_AT_name("productName")
    2513                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_productName")
    2514                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2515                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$324       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    2518                      .dwattr $C$DW$324, DW_AT_name("productRev")
    2519                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_productRev")
    2520                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2521                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2522              $C$DW$325       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$28)
    2524                      .dwattr $C$DW$325, DW_AT_name("serialNumber")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   75

    2525                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_serialNumber")
    2526                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2527                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2528              $C$DW$326       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$326, DW_AT_name("month")
    2531                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_month")
    2532                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2533                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$327       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$327, DW_AT_name("year")
    2537                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_year")
    2538                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2539                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2540              $C$DW$328       .dwtag  DW_TAG_member
    2541                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    2542                      .dwattr $C$DW$328, DW_AT_name("checksum")
    2543                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_checksum")
    2544                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2545                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2546                      .dwendtag $C$DW$T$29
    2547              
    2548              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    2549                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    2550                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2551              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2552                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2553                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    2554              
    2555              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2556                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
    2557              $C$DW$329       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$329, DW_AT_name("csdStruct")
    2560                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_csdStruct")
    2561                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2563              $C$DW$330       .dwtag  DW_TAG_member
    2564                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    2565                      .dwattr $C$DW$330, DW_AT_name("mmcProt")
    2566                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_mmcProt")
    2567                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2568                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2569              $C$DW$331       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    2571                      .dwattr $C$DW$331, DW_AT_name("taac")
    2572                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_taac")
    2573                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2574                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2575              $C$DW$332       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    2577                      .dwattr $C$DW$332, DW_AT_name("nsac")
    2578                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_nsac")
    2579                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   76

    2580                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2581              $C$DW$333       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    2583                      .dwattr $C$DW$333, DW_AT_name("tranSpeed")
    2584                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_tranSpeed")
    2585                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2586                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2587              $C$DW$334       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    2589                      .dwattr $C$DW$334, DW_AT_name("ccc")
    2590                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_ccc")
    2591                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2592                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2593              $C$DW$335       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    2595                      .dwattr $C$DW$335, DW_AT_name("readBlLen")
    2596                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_readBlLen")
    2597                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2598                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2599              $C$DW$336       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$336, DW_AT_name("readBlPartial")
    2602                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_readBlPartial")
    2603                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2604                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2605              $C$DW$337       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    2607                      .dwattr $C$DW$337, DW_AT_name("writeBlkMisalign")
    2608                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_writeBlkMisalign")
    2609                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2610                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2611              $C$DW$338       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    2613                      .dwattr $C$DW$338, DW_AT_name("readBlkMisalign")
    2614                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_readBlkMisalign")
    2615                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2616                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2617              $C$DW$339       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$339, DW_AT_name("dsrImp")
    2620                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_dsrImp")
    2621                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2622                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$340       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    2625                      .dwattr $C$DW$340, DW_AT_name("cSize")
    2626                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_cSize")
    2627                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2628                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2629              $C$DW$341       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$341, DW_AT_name("vddRCurrMin")
    2632                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_vddRCurrMin")
    2633                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2634                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   77

    2635              $C$DW$342       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$342, DW_AT_name("vddRCurrMax")
    2638                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_vddRCurrMax")
    2639                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2640                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$343       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    2643                      .dwattr $C$DW$343, DW_AT_name("vddWCurrMin")
    2644                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_vddWCurrMin")
    2645                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2646                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2647              $C$DW$344       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$344, DW_AT_name("vddWCurrMax")
    2650                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_vddWCurrMax")
    2651                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2652                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$345       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$345, DW_AT_name("cSizeMult")
    2656                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_cSizeMult")
    2657                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2658                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$346       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    2661                      .dwattr $C$DW$346, DW_AT_name("eraseBlkEnable")
    2662                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_eraseBlkEnable")
    2663                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2664                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$347       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    2667                      .dwattr $C$DW$347, DW_AT_name("eraseGrpSize")
    2668                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_eraseGrpSize")
    2669                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2670                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2671              $C$DW$348       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    2673                      .dwattr $C$DW$348, DW_AT_name("eraseGrpMult")
    2674                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_eraseGrpMult")
    2675                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2676                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2677              $C$DW$349       .dwtag  DW_TAG_member
    2678                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    2679                      .dwattr $C$DW$349, DW_AT_name("wpGrpSize")
    2680                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_wpGrpSize")
    2681                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2682                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$350       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$350, DW_AT_name("wpGrpEnable")
    2686                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_wpGrpEnable")
    2687                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2688                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2689              $C$DW$351       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   78

    2690                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$351, DW_AT_name("defaultEcc")
    2692                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_defaultEcc")
    2693                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2694                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$352       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$352, DW_AT_name("r2wFactor")
    2698                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_r2wFactor")
    2699                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2700                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2701              $C$DW$353       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    2703                      .dwattr $C$DW$353, DW_AT_name("writeBlLen")
    2704                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_writeBlLen")
    2705                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2706                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2707              $C$DW$354       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$354, DW_AT_name("writeBlPartial")
    2710                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_writeBlPartial")
    2711                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2712                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2713              $C$DW$355       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    2715                      .dwattr $C$DW$355, DW_AT_name("contProtApp")
    2716                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_contProtApp")
    2717                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2718                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2719              $C$DW$356       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    2721                      .dwattr $C$DW$356, DW_AT_name("fileFmtGrp")
    2722                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_fileFmtGrp")
    2723                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2724                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2725              $C$DW$357       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$357, DW_AT_name("copyFlag")
    2728                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_copyFlag")
    2729                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2730                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2731              $C$DW$358       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    2733                      .dwattr $C$DW$358, DW_AT_name("permWriteProtect")
    2734                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_permWriteProtect")
    2735                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2736                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2737              $C$DW$359       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    2739                      .dwattr $C$DW$359, DW_AT_name("tmpWriteProtect")
    2740                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_tmpWriteProtect")
    2741                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2742                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2743              $C$DW$360       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   79

    2745                      .dwattr $C$DW$360, DW_AT_name("fileFmt")
    2746                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_fileFmt")
    2747                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2748                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2749              $C$DW$361       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    2751                      .dwattr $C$DW$361, DW_AT_name("ecc")
    2752                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ecc")
    2753                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2754                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2755              $C$DW$362       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$362, DW_AT_name("crc")
    2758                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_crc")
    2759                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2760                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2761                      .dwendtag $C$DW$T$30
    2762              
    2763              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    2764                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    2765                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2766              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2767                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2768                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2769              
    2770              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2771                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    2772              $C$DW$363       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    2774                      .dwattr $C$DW$363, DW_AT_name("securitySysId")
    2775                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_securitySysId")
    2776                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$364       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$364, DW_AT_name("securitySysVers")
    2781                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_securitySysVers")
    2782                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2783                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$365       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    2786                      .dwattr $C$DW$365, DW_AT_name("maxLicenses")
    2787                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_maxLicenses")
    2788                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2789                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2790              $C$DW$366       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$28)
    2792                      .dwattr $C$DW$366, DW_AT_name("xStatus")
    2793                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_xStatus")
    2794                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2795                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2796                      .dwendtag $C$DW$T$31
    2797              
    2798              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    2799                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   80

    2800                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2801              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2802                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2803                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    2804              
    2805              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2806                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    2807              $C$DW$367       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    2809                      .dwattr $C$DW$367, DW_AT_name("rca")
    2810                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rca")
    2811                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2813              $C$DW$368       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    2815                      .dwattr $C$DW$368, DW_AT_name("ST0")
    2816                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ST0")
    2817                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2818                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2819              $C$DW$369       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    2821                      .dwattr $C$DW$369, DW_AT_name("ST1")
    2822                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ST1")
    2823                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2824                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$370       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    2827                      .dwattr $C$DW$370, DW_AT_name("cardIndex")
    2828                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_cardIndex")
    2829                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2830                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$371       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$28)
    2833                      .dwattr $C$DW$371, DW_AT_name("maxXfrRate")
    2834                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_maxXfrRate")
    2835                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2836                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2837              $C$DW$372       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
    2839                      .dwattr $C$DW$372, DW_AT_name("readAccessTime")
    2840                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_readAccessTime")
    2841                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2842                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2843              $C$DW$373       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$28)
    2845                      .dwattr $C$DW$373, DW_AT_name("cardCapacity")
    2846                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_cardCapacity")
    2847                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2848                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2849              $C$DW$374       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$28)
    2851                      .dwattr $C$DW$374, DW_AT_name("blockLength")
    2852                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_blockLength")
    2853                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2854                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   81

    2855              $C$DW$375       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$28)
    2857                      .dwattr $C$DW$375, DW_AT_name("totalSectors")
    2858                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_totalSectors")
    2859                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2860                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2861              $C$DW$376       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$28)
    2863                      .dwattr $C$DW$376, DW_AT_name("lastAddrRead")
    2864                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_lastAddrRead")
    2865                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2866                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2867              $C$DW$377       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$28)
    2869                      .dwattr $C$DW$377, DW_AT_name("lastAddrWritten")
    2870                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_lastAddrWritten")
    2871                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2872                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2873              $C$DW$378       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$33)
    2875                      .dwattr $C$DW$378, DW_AT_name("cardType")
    2876                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_cardType")
    2877                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2878                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$379       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$35)
    2881                      .dwattr $C$DW$379, DW_AT_name("cid")
    2882                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_cid")
    2883                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2884                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$380       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$37)
    2887                      .dwattr $C$DW$380, DW_AT_name("csd")
    2888                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_csd")
    2889                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2890                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$381       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
    2893                      .dwattr $C$DW$381, DW_AT_name("xcsd")
    2894                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_xcsd")
    2895                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2896                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2897              $C$DW$382       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$40)
    2899                      .dwattr $C$DW$382, DW_AT_name("sdHcDetected")
    2900                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_sdHcDetected")
    2901                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2902                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2903              $C$DW$383       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$40)
    2905                      .dwattr $C$DW$383, DW_AT_name("cardAtaFsOpen")
    2906                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    2907                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2908                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2909              $C$DW$384       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   82

    2910                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    2911                      .dwattr $C$DW$384, DW_AT_name("cardMscStatus")
    2912                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_cardMscStatus")
    2913                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2914                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2915                      .dwendtag $C$DW$T$41
    2916              
    2917              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    2918                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    2919                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2920              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    2921                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2922                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    2923              
    2924              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2925                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2926              $C$DW$385       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$45)
    2928                      .dwattr $C$DW$385, DW_AT_name("isr")
    2929                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_isr")
    2930                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2932                      .dwendtag $C$DW$T$46
    2933              
    2934              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    2935                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    2936                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2937              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    2938                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2939                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    2940              
    2941              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2942                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
    2943              $C$DW$386       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    2945                      .dwattr $C$DW$386, DW_AT_name("DMACH0SSAL")
    2946                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2947                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2948                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$387       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    2951                      .dwattr $C$DW$387, DW_AT_name("DMACH0SSAU")
    2952                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2953                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2954                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2955              $C$DW$388       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    2957                      .dwattr $C$DW$388, DW_AT_name("DMACH0DSAL")
    2958                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2959                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2960                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2961              $C$DW$389       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    2963                      .dwattr $C$DW$389, DW_AT_name("DMACH0DSAU")
    2964                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_DMACH0DSAU")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   83

    2965                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2966                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$390       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    2969                      .dwattr $C$DW$390, DW_AT_name("DMACH0TCR1")
    2970                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2971                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2972                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$391       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    2975                      .dwattr $C$DW$391, DW_AT_name("DMACH0TCR2")
    2976                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2977                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2978                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2979              $C$DW$392       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    2981                      .dwattr $C$DW$392, DW_AT_name("RSVD0")
    2982                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_RSVD0")
    2983                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2984                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2985              $C$DW$393       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    2987                      .dwattr $C$DW$393, DW_AT_name("DMACH1SSAL")
    2988                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2989                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2990                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2991              $C$DW$394       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    2993                      .dwattr $C$DW$394, DW_AT_name("DMACH1SSAU")
    2994                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2995                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2996                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2997              $C$DW$395       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    2999                      .dwattr $C$DW$395, DW_AT_name("DMACH1DSAL")
    3000                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DMACH1DSAL")
    3001                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3002                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3003              $C$DW$396       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3005                      .dwattr $C$DW$396, DW_AT_name("DMACH1DSAU")
    3006                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DMACH1DSAU")
    3007                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3008                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3009              $C$DW$397       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3011                      .dwattr $C$DW$397, DW_AT_name("DMACH1TCR1")
    3012                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DMACH1TCR1")
    3013                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3014                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$398       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3017                      .dwattr $C$DW$398, DW_AT_name("DMACH1TCR2")
    3018                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DMACH1TCR2")
    3019                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   84

    3020                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3021              $C$DW$399       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$47)
    3023                      .dwattr $C$DW$399, DW_AT_name("RSVD1")
    3024                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RSVD1")
    3025                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3026                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3027              $C$DW$400       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3029                      .dwattr $C$DW$400, DW_AT_name("DMACH2SSAL")
    3030                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_DMACH2SSAL")
    3031                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3032                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$401       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3035                      .dwattr $C$DW$401, DW_AT_name("DMACH2SSAU")
    3036                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_DMACH2SSAU")
    3037                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3038                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3039              $C$DW$402       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3041                      .dwattr $C$DW$402, DW_AT_name("DMACH2DSAL")
    3042                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_DMACH2DSAL")
    3043                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3044                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3045              $C$DW$403       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3047                      .dwattr $C$DW$403, DW_AT_name("DMACH2DSAU")
    3048                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_DMACH2DSAU")
    3049                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3050                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3051              $C$DW$404       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3053                      .dwattr $C$DW$404, DW_AT_name("DMACH2TCR1")
    3054                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DMACH2TCR1")
    3055                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3056                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$405       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3059                      .dwattr $C$DW$405, DW_AT_name("DMACH2TCR2")
    3060                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DMACH2TCR2")
    3061                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3062                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3063              $C$DW$406       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$47)
    3065                      .dwattr $C$DW$406, DW_AT_name("RSVD2")
    3066                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD2")
    3067                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3068                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$407       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3071                      .dwattr $C$DW$407, DW_AT_name("DMACH3SSAL")
    3072                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_DMACH3SSAL")
    3073                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3074                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   85

    3075              $C$DW$408       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3077                      .dwattr $C$DW$408, DW_AT_name("DMACH3SSAU")
    3078                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_DMACH3SSAU")
    3079                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3080                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3081              $C$DW$409       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3083                      .dwattr $C$DW$409, DW_AT_name("DMACH3DSAL")
    3084                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_DMACH3DSAL")
    3085                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3086                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$410       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3089                      .dwattr $C$DW$410, DW_AT_name("DMACH3DSAU")
    3090                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_DMACH3DSAU")
    3091                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3092                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$411       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3095                      .dwattr $C$DW$411, DW_AT_name("DMACH3TCR1")
    3096                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_DMACH3TCR1")
    3097                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3098                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$412       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3101                      .dwattr $C$DW$412, DW_AT_name("DMACH3TCR2")
    3102                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_DMACH3TCR2")
    3103                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3104                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3105                      .dwendtag $C$DW$T$48
    3106              
    3107              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    3108                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3109                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3110              $C$DW$413       .dwtag  DW_TAG_TI_far_type
    3111                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$49)
    3112              $C$DW$414       .dwtag  DW_TAG_TI_ioport_type
    3113                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$413)
    3114              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    3115                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$414)
    3116              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3117                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3118                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    3119              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    3120                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3121                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3122              
    3123              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3124                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
    3125              $C$DW$415       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$52)
    3127                      .dwattr $C$DW$415, DW_AT_name("dmaRegs")
    3128                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_dmaRegs")
    3129                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   86

    3130                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$416       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$54)
    3133                      .dwattr $C$DW$416, DW_AT_name("chanNum")
    3134                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_chanNum")
    3135                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3136                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$417       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$56)
    3139                      .dwattr $C$DW$417, DW_AT_name("dmaInstNum")
    3140                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_dmaInstNum")
    3141                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3142                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$418       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$40)
    3145                      .dwattr $C$DW$418, DW_AT_name("isChanFree")
    3146                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_isChanFree")
    3147                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3148                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$419       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$58)
    3151                      .dwattr $C$DW$419, DW_AT_name("chanDir")
    3152                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_chanDir")
    3153                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3154                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$420       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$60)
    3157                      .dwattr $C$DW$420, DW_AT_name("trigger")
    3158                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_trigger")
    3159                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3160                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$421       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$62)
    3163                      .dwattr $C$DW$421, DW_AT_name("trfType")
    3164                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_trfType")
    3165                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3166                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$422       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$64)
    3169                      .dwattr $C$DW$422, DW_AT_name("dmaInt")
    3170                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_dmaInt")
    3171                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3172                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$423       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$40)
    3175                      .dwattr $C$DW$423, DW_AT_name("pingPongEnabled")
    3176                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_pingPongEnabled")
    3177                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3178                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3179                      .dwendtag $C$DW$T$65
    3180              
    3181              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    3182                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
    3183                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3184              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   87

    3185                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3186                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    3187              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    3188                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3189                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3190              
    3191              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3192                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    3193              $C$DW$424       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$67)
    3195                      .dwattr $C$DW$424, DW_AT_name("pingPongMode")
    3196                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_pingPongMode")
    3197                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3198                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$425       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$69)
    3201                      .dwattr $C$DW$425, DW_AT_name("autoMode")
    3202                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_autoMode")
    3203                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3204                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3205              $C$DW$426       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$71)
    3207                      .dwattr $C$DW$426, DW_AT_name("burstLen")
    3208                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_burstLen")
    3209                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3210                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$427       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$60)
    3213                      .dwattr $C$DW$427, DW_AT_name("trigger")
    3214                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_trigger")
    3215                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3216                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$428       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$73)
    3219                      .dwattr $C$DW$428, DW_AT_name("dmaEvt")
    3220                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_dmaEvt")
    3221                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3222                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3223              $C$DW$429       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$64)
    3225                      .dwattr $C$DW$429, DW_AT_name("dmaInt")
    3226                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_dmaInt")
    3227                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3228                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3229              $C$DW$430       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$58)
    3231                      .dwattr $C$DW$430, DW_AT_name("chanDir")
    3232                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_chanDir")
    3233                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3234                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3235              $C$DW$431       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$62)
    3237                      .dwattr $C$DW$431, DW_AT_name("trfType")
    3238                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_trfType")
    3239                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_SdCardExample.asm                                          PAGE   88

    3240                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3241              $C$DW$432       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    3243                      .dwattr $C$DW$432, DW_AT_name("dataLen")
    3244                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_dataLen")
    3245                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3246                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3247              $C$DW$433       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$28)
    3249                      .dwattr $C$DW$433, DW_AT_name("srcAddr")
    3250                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_srcAddr")
    3251                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3252                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$434       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$28)
    3255                      .dwattr $C$DW$434, DW_AT_name("destAddr")
    3256                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_destAddr")
    3257                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3258                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3259                      .dwendtag $C$DW$T$74
    3260              
    3261              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    3262                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    3263                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3264              
    3265              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3266                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    3267              $C$DW$435       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    3269                      .dwattr $C$DW$435, DW_AT_name("slice127_112")
    3270                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_slice127_112")
    3271                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3272                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$436       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    3275                      .dwattr $C$DW$436, DW_AT_name("slice111_96")
    3276                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_slice111_96")
    3277                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3278                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
