TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE    1

    2122              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:39 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1100              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN3"), DW_AT_const_value(0x03)
    1101              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN4"), DW_AT_const_value(0x04)
    1102              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN5"), DW_AT_const_value(0x05)
    1103              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN6"), DW_AT_const_value(0x06)
    1104              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN7"), DW_AT_const_value(0x07)
    1105              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN8"), DW_AT_const_value(0x08)
    1106              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN9"), DW_AT_const_value(0x09)
    1107              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN10"), DW_AT_const_value(0x0a)
    1108              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN11"), DW_AT_const_value(0x0b)
    1109              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN12"), DW_AT_const_value(0x0c)
    1110              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN13"), DW_AT_const_value(0x0d)
    1111              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN14"), DW_AT_const_value(0x0e)
    1112              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN15"), DW_AT_const_value(0x0f)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   37

    1113              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN16"), DW_AT_const_value(0x10)
    1114              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN17"), DW_AT_const_value(0x11)
    1115              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN18"), DW_AT_const_value(0x12)
    1116              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN19"), DW_AT_const_value(0x13)
    1117              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN20"), DW_AT_const_value(0x14)
    1118              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN21"), DW_AT_const_value(0x15)
    1119              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN22"), DW_AT_const_value(0x16)
    1120              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN23"), DW_AT_const_value(0x17)
    1121              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN24"), DW_AT_const_value(0x18)
    1122              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN25"), DW_AT_const_value(0x19)
    1123              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN26"), DW_AT_const_value(0x1a)
    1124              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN27"), DW_AT_const_value(0x1b)
    1125              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN28"), DW_AT_const_value(0x1c)
    1126              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN29"), DW_AT_const_value(0x1d)
    1127              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN30"), DW_AT_const_value(0x1e)
    1128              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN31"), DW_AT_const_value(0x1f)
    1129                      .dwendtag $C$DW$T$30
    1130              
    1131              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinNum")
    1132                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1133                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1134              
    1135              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1136                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1137              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_INPUT"), DW_AT_const_value(0x00)
    1138              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_OUTPUT"), DW_AT_const_value(0x01)
    1139                      .dwendtag $C$DW$T$32
    1140              
    1141              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioDirection")
    1142                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1143                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1144              
    1145              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    1146                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1147              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_RISING_EDGE"), DW_AT_const_value(0x00)
    1148              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_FALLING_EDGE"), DW_AT_const_value(0x01)
    1149              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_CLEAR_EDGE"), DW_AT_const_value(0x02)
    1150                      .dwendtag $C$DW$T$34
    1151              
    1152              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioTriggerType")
    1153                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1154                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1155              
    1156              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1157                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x12)
    1158              $C$DW$123       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1160                      .dwattr $C$DW$123, DW_AT_name("RSVD0")
    1161                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RSVD0")
    1162                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$124       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1166                      .dwattr $C$DW$124, DW_AT_name("IODIR1")
    1167                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IODIR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   38

    1168                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1169                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$125       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1172                      .dwattr $C$DW$125, DW_AT_name("IODIR2")
    1173                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IODIR2")
    1174                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1175                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$126       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1178                      .dwattr $C$DW$126, DW_AT_name("IOINDATA1")
    1179                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IOINDATA1")
    1180                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1181                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$127       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1184                      .dwattr $C$DW$127, DW_AT_name("IOINDATA2")
    1185                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IOINDATA2")
    1186                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1187                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$128       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1190                      .dwattr $C$DW$128, DW_AT_name("IOOUTDATA1")
    1191                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IOOUTDATA1")
    1192                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1193                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$129       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1196                      .dwattr $C$DW$129, DW_AT_name("IOOUTDATA2")
    1197                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IOOUTDATA2")
    1198                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1199                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$130       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1202                      .dwattr $C$DW$130, DW_AT_name("IOINTEDG1")
    1203                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IOINTEDG1")
    1204                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1205                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1206              $C$DW$131       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1208                      .dwattr $C$DW$131, DW_AT_name("IOINTEDG2")
    1209                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IOINTEDG2")
    1210                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1211                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$132       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1214                      .dwattr $C$DW$132, DW_AT_name("IOINTEN1")
    1215                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_IOINTEN1")
    1216                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1217                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1218              $C$DW$133       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1220                      .dwattr $C$DW$133, DW_AT_name("IOINTEN2")
    1221                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IOINTEN2")
    1222                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   39

    1223                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$134       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1226                      .dwattr $C$DW$134, DW_AT_name("IOINTFLG1")
    1227                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IOINTFLG1")
    1228                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1229                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$135       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1232                      .dwattr $C$DW$135, DW_AT_name("IOINTFLG2")
    1233                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_IOINTFLG2")
    1234                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1235                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1236                      .dwendtag $C$DW$T$22
    1237              
    1238              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    1239                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1240                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1241              $C$DW$136       .dwtag  DW_TAG_TI_far_type
    1242                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$23)
    1243              $C$DW$137       .dwtag  DW_TAG_TI_ioport_type
    1244                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$136)
    1245              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1246                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$137)
    1247              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1248                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1249                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    1250              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    1251                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1252                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1253              
    1254              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1255                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1256              $C$DW$138       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$26)
    1258                      .dwattr $C$DW$138, DW_AT_name("baseAddr")
    1259                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_baseAddr")
    1260                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$139       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    1264                      .dwattr $C$DW$139, DW_AT_name("numPins")
    1265                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_numPins")
    1266                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1268                      .dwendtag $C$DW$T$28
    1269              
    1270              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioObj")
    1271                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    1272                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1273              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1274                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1275                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1276              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1277                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   40

    1278                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1279              
    1280              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1281                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
    1282              $C$DW$140       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1284                      .dwattr $C$DW$140, DW_AT_name("GPIODIRL")
    1285                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIODIRL")
    1286                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$141       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1290                      .dwattr $C$DW$141, DW_AT_name("GPIODIRH")
    1291                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIODIRH")
    1292                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1293                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$142       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1296                      .dwattr $C$DW$142, DW_AT_name("GPIOINTTRIGL")
    1297                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIOINTTRIGL")
    1298                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1299                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$143       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1302                      .dwattr $C$DW$143, DW_AT_name("GPIOINTTRIGH")
    1303                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIOINTTRIGH")
    1304                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1305                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$144       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1308                      .dwattr $C$DW$144, DW_AT_name("GPIOINTENAL")
    1309                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIOINTENAL")
    1310                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1311                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$145       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1314                      .dwattr $C$DW$145, DW_AT_name("GPIOINTENAH")
    1315                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIOINTENAH")
    1316                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1317                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1318                      .dwendtag $C$DW$T$29
    1319              
    1320              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioConfig")
    1321                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$29)
    1322                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1323              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1324                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1325                      .dwattr $C$DW$T$50, DW_AT_address_class(0x17)
    1326              
    1327              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1328                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    1329              $C$DW$146       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
    1331                      .dwattr $C$DW$146, DW_AT_name("pinNum")
    1332                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_pinNum")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   41

    1333                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$147       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$33)
    1337                      .dwattr $C$DW$147, DW_AT_name("direction")
    1338                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_direction")
    1339                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$148       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$35)
    1343                      .dwattr $C$DW$148, DW_AT_name("trigger")
    1344                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_trigger")
    1345                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1346                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1347                      .dwendtag $C$DW$T$36
    1348              
    1349              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinConfig")
    1350                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$36)
    1351                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1352              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1353                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1354                      .dwattr $C$DW$T$52, DW_AT_address_class(0x17)
    1355              
    1356              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1357                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x48)
    1358              $C$DW$149       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1360                      .dwattr $C$DW$149, DW_AT_name("EBSR")
    1361                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_EBSR")
    1362                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$150       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    1366                      .dwattr $C$DW$150, DW_AT_name("RSVD0")
    1367                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_RSVD0")
    1368                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1369                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$151       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    1372                      .dwattr $C$DW$151, DW_AT_name("PCGCR1")
    1373                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PCGCR1")
    1374                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1375                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$152       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    1378                      .dwattr $C$DW$152, DW_AT_name("PCGCR2")
    1379                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PCGCR2")
    1380                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1381                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$153       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    1384                      .dwattr $C$DW$153, DW_AT_name("PSRCR")
    1385                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PSRCR")
    1386                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1387                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   42

    1388              $C$DW$154       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1390                      .dwattr $C$DW$154, DW_AT_name("PRCR")
    1391                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PRCR")
    1392                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1393                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$155       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$37)
    1396                      .dwattr $C$DW$155, DW_AT_name("RSVD1")
    1397                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_RSVD1")
    1398                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1399                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$156       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    1402                      .dwattr $C$DW$156, DW_AT_name("TIAFR")
    1403                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_TIAFR")
    1404                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1405                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$157       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1408                      .dwattr $C$DW$157, DW_AT_name("RSVD2")
    1409                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RSVD2")
    1410                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1411                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$158       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1414                      .dwattr $C$DW$158, DW_AT_name("ODSCR")
    1415                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ODSCR")
    1416                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1417                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$159       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1420                      .dwattr $C$DW$159, DW_AT_name("PDINHIBR1")
    1421                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PDINHIBR1")
    1422                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1423                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$160       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1426                      .dwattr $C$DW$160, DW_AT_name("PDINHIBR2")
    1427                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PDINHIBR2")
    1428                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1429                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$161       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1432                      .dwattr $C$DW$161, DW_AT_name("PDINHIBR3")
    1433                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PDINHIBR3")
    1434                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1435                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$162       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1438                      .dwattr $C$DW$162, DW_AT_name("DMA0CESR1")
    1439                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DMA0CESR1")
    1440                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1441                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$163       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   43

    1443                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    1444                      .dwattr $C$DW$163, DW_AT_name("DMA0CESR2")
    1445                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMA0CESR2")
    1446                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1447                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$164       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    1450                      .dwattr $C$DW$164, DW_AT_name("DMA1CESR1")
    1451                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_DMA1CESR1")
    1452                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1453                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$165       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1456                      .dwattr $C$DW$165, DW_AT_name("DMA1CESR2")
    1457                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DMA1CESR2")
    1458                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1459                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$166       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1462                      .dwattr $C$DW$166, DW_AT_name("SDRAMCCR")
    1463                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SDRAMCCR")
    1464                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1465                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$167       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1468                      .dwattr $C$DW$167, DW_AT_name("CCR2")
    1469                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_CCR2")
    1470                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1471                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$168       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1474                      .dwattr $C$DW$168, DW_AT_name("CGCR1")
    1475                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CGCR1")
    1476                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1477                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$169       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1480                      .dwattr $C$DW$169, DW_AT_name("CGICR")
    1481                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CGICR")
    1482                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1483                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$170       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1486                      .dwattr $C$DW$170, DW_AT_name("CGCR2")
    1487                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_CGCR2")
    1488                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1489                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$171       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1492                      .dwattr $C$DW$171, DW_AT_name("CGOCR")
    1493                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_CGOCR")
    1494                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1495                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$172       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   44

    1498                      .dwattr $C$DW$172, DW_AT_name("CCSSR")
    1499                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_CCSSR")
    1500                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1501                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$173       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1504                      .dwattr $C$DW$173, DW_AT_name("RSVD3")
    1505                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD3")
    1506                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1507                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$174       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$174, DW_AT_name("ECDR")
    1511                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ECDR")
    1512                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1513                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$175       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1516                      .dwattr $C$DW$175, DW_AT_name("RSVD4")
    1517                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD4")
    1518                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1519                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$176       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1522                      .dwattr $C$DW$176, DW_AT_name("RAMSLPMDCNTLR1")
    1523                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1524                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1525                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$177       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1528                      .dwattr $C$DW$177, DW_AT_name("RSVD5")
    1529                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_RSVD5")
    1530                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1531                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$178       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1534                      .dwattr $C$DW$178, DW_AT_name("RAMSLPMDCNTLR2")
    1535                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1536                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1537                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$179       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1540                      .dwattr $C$DW$179, DW_AT_name("RAMSLPMDCNTLR3")
    1541                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1542                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1543                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$180       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1546                      .dwattr $C$DW$180, DW_AT_name("RAMSLPMDCNTLR4")
    1547                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1548                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1549                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$181       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1552                      .dwattr $C$DW$181, DW_AT_name("RAMSLPMDCNTLR5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   45

    1553                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1554                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1555                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$182       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$38)
    1558                      .dwattr $C$DW$182, DW_AT_name("RSVD6")
    1559                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD6")
    1560                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1561                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$183       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1564                      .dwattr $C$DW$183, DW_AT_name("DMAIFR")
    1565                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMAIFR")
    1566                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1567                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$184       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1570                      .dwattr $C$DW$184, DW_AT_name("DMAIER")
    1571                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DMAIER")
    1572                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1573                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$185       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1576                      .dwattr $C$DW$185, DW_AT_name("USBSCR")
    1577                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_USBSCR")
    1578                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1579                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$186       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1582                      .dwattr $C$DW$186, DW_AT_name("ESCR")
    1583                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ESCR")
    1584                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1585                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$187       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$38)
    1588                      .dwattr $C$DW$187, DW_AT_name("RSVD7")
    1589                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_RSVD7")
    1590                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1591                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$188       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1594                      .dwattr $C$DW$188, DW_AT_name("DMA2CESR1")
    1595                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DMA2CESR1")
    1596                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1597                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$189       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1600                      .dwattr $C$DW$189, DW_AT_name("DMA2CESR2")
    1601                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DMA2CESR2")
    1602                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1603                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$190       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1606                      .dwattr $C$DW$190, DW_AT_name("DMA3CESR1")
    1607                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DMA3CESR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   46

    1608                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1609                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$191       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1612                      .dwattr $C$DW$191, DW_AT_name("DMA3CESR2")
    1613                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DMA3CESR2")
    1614                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1615                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$192       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1618                      .dwattr $C$DW$192, DW_AT_name("CLKSTOP")
    1619                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CLKSTOP")
    1620                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1621                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$193       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$39)
    1624                      .dwattr $C$DW$193, DW_AT_name("RSVD8")
    1625                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD8")
    1626                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1627                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$194       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    1630                      .dwattr $C$DW$194, DW_AT_name("DIEIDR0")
    1631                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DIEIDR0")
    1632                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1633                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$195       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1636                      .dwattr $C$DW$195, DW_AT_name("DIEIDR1")
    1637                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DIEIDR1")
    1638                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1639                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$196       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1642                      .dwattr $C$DW$196, DW_AT_name("DIEIDR2")
    1643                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DIEIDR2")
    1644                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1645                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$197       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1648                      .dwattr $C$DW$197, DW_AT_name("DIEIDR3")
    1649                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_DIEIDR3")
    1650                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1651                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$198       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    1654                      .dwattr $C$DW$198, DW_AT_name("DIEIDR4")
    1655                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DIEIDR4")
    1656                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1657                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$199       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1660                      .dwattr $C$DW$199, DW_AT_name("DIEIDR5")
    1661                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DIEIDR5")
    1662                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   47

    1663                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$200       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1666                      .dwattr $C$DW$200, DW_AT_name("DIEIDR6")
    1667                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_DIEIDR6")
    1668                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1669                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$201       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1672                      .dwattr $C$DW$201, DW_AT_name("DIEIDR7")
    1673                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DIEIDR7")
    1674                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1675                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1676                      .dwendtag $C$DW$T$40
    1677              
    1678              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1679                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
    1680                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1681              $C$DW$202       .dwtag  DW_TAG_TI_far_type
    1682                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$53)
    1683              $C$DW$203       .dwtag  DW_TAG_TI_ioport_type
    1684                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$202)
    1685              $C$DW$T$54      .dwtag  DW_TAG_volatile_type
    1686                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$203)
    1687              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1688                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1689                      .dwattr $C$DW$T$55, DW_AT_address_class(0x10)
    1690              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1691                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1692                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1693              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1694                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1695                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1696                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1697              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1698                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1699                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1700                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1701              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1702                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1703                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1704                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1705              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    1706                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    1707                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1708              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1709                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1710                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1711                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1712              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1713                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1714                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1715                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1716              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1717                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Output_Pin_Example.asm                                          PAGE   48

    1718                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1719              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1720                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1721                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1722              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1723                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1724                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    1725              $C$DW$204       .dwtag  DW_TAG_TI_far_type
