TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE    1

    2288              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:31 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1567                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1568                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1569              
    1570              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1571                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1572              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_DISCHARGE"), DW_AT_const_value(0x00)
    1573              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_DISCHARGE_ARRAY"), DW_AT_const_value(0x01)
    1574                      .dwendtag $C$DW$T$31
    1575              
    1576              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarMultiCh")
    1577                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1578                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1579              
    1580              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1581                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1582              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_0_8v"), DW_AT_const_value(0x00)
    1583              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_1v"), DW_AT_const_value(0x01)
    1584              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_VIN"), DW_AT_const_value(0x02)
    1585                      .dwendtag $C$DW$T$33
    1586              
    1587              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RefVoltage")
    1588                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1589                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1590              
    1591              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    1592                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1593              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    1594              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    1595              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    1596              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    1597              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    1598              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    1599              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    1600                      .dwendtag $C$DW$T$42
    1601              
    1602              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    1603                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1604                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1605              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1606                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1607                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    1608              
    1609              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1610                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1611              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   45

    1612              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    1613                      .dwendtag $C$DW$T$45
    1614              
    1615              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    1616                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1617                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1618              
    1619              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1620                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1621              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    1622              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    1623              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    1624              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    1625              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    1626              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    1627              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    1628                      .dwendtag $C$DW$T$47
    1629              
    1630              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    1631                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1632                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1633              
    1634              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1635                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    1636              $C$DW$161       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    1638                      .dwattr $C$DW$161, DW_AT_name("RSVD0")
    1639                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_RSVD0")
    1640                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$162       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1644                      .dwattr $C$DW$162, DW_AT_name("USBLDOCNTL")
    1645                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_USBLDOCNTL")
    1646                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1647                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$163       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1650                      .dwattr $C$DW$163, DW_AT_name("RSVD1")
    1651                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RSVD1")
    1652                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1653                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1654              $C$DW$164       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    1656                      .dwattr $C$DW$164, DW_AT_name("SARCTRL")
    1657                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_SARCTRL")
    1658                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1659                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$165       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1662                      .dwattr $C$DW$165, DW_AT_name("RSVD2")
    1663                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD2")
    1664                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1665                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$166       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   46

    1667                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1668                      .dwattr $C$DW$166, DW_AT_name("SARDATA")
    1669                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SARDATA")
    1670                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1671                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$167       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1674                      .dwattr $C$DW$167, DW_AT_name("RSVD3")
    1675                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_RSVD3")
    1676                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1677                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$168       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1680                      .dwattr $C$DW$168, DW_AT_name("SARCLKCTRL")
    1681                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_SARCLKCTRL")
    1682                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1683                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$169       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1686                      .dwattr $C$DW$169, DW_AT_name("RSVD4")
    1687                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RSVD4")
    1688                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1689                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$170       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1692                      .dwattr $C$DW$170, DW_AT_name("SARPINCTRL")
    1693                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SARPINCTRL")
    1694                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1695                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$171       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1698                      .dwattr $C$DW$171, DW_AT_name("RSVD5")
    1699                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD5")
    1700                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1701                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$172       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1704                      .dwattr $C$DW$172, DW_AT_name("SARGPOCTRL")
    1705                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SARGPOCTRL")
    1706                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1707                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1708                      .dwendtag $C$DW$T$23
    1709              
    1710              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    1711                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1712                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1713              $C$DW$173       .dwtag  DW_TAG_TI_far_type
    1714                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$24)
    1715              $C$DW$174       .dwtag  DW_TAG_TI_ioport_type
    1716                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$173)
    1717              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1718                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$174)
    1719              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1720                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1721                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   47

    1722              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    1723                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1724                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1725              
    1726              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1727                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    1728              $C$DW$175       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    1730                      .dwattr $C$DW$175, DW_AT_name("baseAddr")
    1731                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_baseAddr")
    1732                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1734              $C$DW$176       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$176, DW_AT_name("chanNo")
    1737                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_chanNo")
    1738                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1739                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$177       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$177, DW_AT_name("status")
    1743                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_status")
    1744                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1745                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1746                      .dwendtag $C$DW$T$28
    1747              
    1748              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
    1749                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$28)
    1750                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1751              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1752                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1753                      .dwattr $C$DW$T$50, DW_AT_address_class(0x17)
    1754              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    1755                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1756                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1757              
    1758              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1759                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1760              $C$DW$178       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$178, DW_AT_name("SysClkDiv")
    1763                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SysClkDiv")
    1764                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1766              $C$DW$179       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$30)
    1768                      .dwattr $C$DW$179, DW_AT_name("OpMode")
    1769                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_OpMode")
    1770                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1771                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$180       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$32)
    1774                      .dwattr $C$DW$180, DW_AT_name("MultiCh")
    1775                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_MultiCh")
    1776                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   48

    1777                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1778              $C$DW$181       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$34)
    1780                      .dwattr $C$DW$181, DW_AT_name("RefVoltage")
    1781                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RefVoltage")
    1782                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1783                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1784                      .dwendtag $C$DW$T$35
    1785              
    1786              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    1787                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$35)
    1788                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1789              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1790                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1791                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
    1792              
    1793              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1794                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    1795              $C$DW$182       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$38)
    1797                      .dwattr $C$DW$182, DW_AT_name("funcAddr")
    1798                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_funcAddr")
    1799                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$183       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$39)
    1803                      .dwattr $C$DW$183, DW_AT_name("funcArg")
    1804                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_funcArg")
    1805                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1806                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$184       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$39)
    1809                      .dwattr $C$DW$184, DW_AT_name("ierMask")
    1810                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ierMask")
    1811                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1812                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$185       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$39)
    1815                      .dwattr $C$DW$185, DW_AT_name("cacheCtrl")
    1816                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_cacheCtrl")
    1817                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1818                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1819                      .dwendtag $C$DW$T$40
    1820              
    1821              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Dispatch")
    1822                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$40)
    1823                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1824              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1825                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1826                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    1827              
    1828              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1829                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    1830              $C$DW$186       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   49

    1832                      .dwattr $C$DW$186, DW_AT_name("funcAddr")
    1833                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_funcAddr")
    1834                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$187       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$39)
    1838                      .dwattr $C$DW$187, DW_AT_name("funcArg")
    1839                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_funcArg")
    1840                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1841                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$188       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$39)
    1844                      .dwattr $C$DW$188, DW_AT_name("ierMask")
    1845                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ierMask")
    1846                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1847                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1848              $C$DW$189       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$39)
    1850                      .dwattr $C$DW$189, DW_AT_name("cacheCtrl")
    1851                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_cacheCtrl")
    1852                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1853                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1854                      .dwendtag $C$DW$T$41
    1855              
    1856              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Config")
    1857                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$41)
    1858                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1859              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1860                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1861                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    1862              
    1863              $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1864                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1865              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1866                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1867                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1868              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    1869                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1870                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1871              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1872                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1873                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1874                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1875              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1876                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1877                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1878                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1879              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1880                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1881                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1882                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1883              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1884                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1885                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1886                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:31 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
intc_example.asm                                                     PAGE   50

    1887              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1888                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1889                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1890                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1891              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1892                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
    1893                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1894              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1895                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1896                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1897              $C$DW$190       .dwtag  DW_TAG_TI_far_type
    1898                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$58)
    1899              $C$DW$T$94      .dwtag  DW_TAG_volatile_type
    1900                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$190)
    1901              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1902                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1903                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1904                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
