TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE    1

    2005              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:47 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1360              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1361                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1362              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_DISCHARGE"), DW_AT_const_value(0x00)
    1363              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_DISCHARGE_ARRAY"), DW_AT_const_value(0x01)
    1364                      .dwendtag $C$DW$T$31
    1365              
    1366              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarMultiCh")
    1367                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1368                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1369              
    1370              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1371                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1372              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_0_8v"), DW_AT_const_value(0x00)
    1373              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_1v"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE   38

    1374              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_VIN"), DW_AT_const_value(0x02)
    1375                      .dwendtag $C$DW$T$33
    1376              
    1377              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RefVoltage")
    1378                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1379                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1380              
    1381              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    1382                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1383              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    1384              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    1385              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    1386              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    1387              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    1388              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    1389              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    1390                      .dwendtag $C$DW$T$36
    1391              
    1392              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    1393                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1394                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1395              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    1396                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1397                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    1398              
    1399              $C$DW$T$39      .dwtag  DW_TAG_enumeration_type
    1400                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1401              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
    1402              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    1403                      .dwendtag $C$DW$T$39
    1404              
    1405              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    1406                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1407                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1408              
    1409              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1410                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1411              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    1412              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    1413              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    1414              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    1415              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    1416              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    1417              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    1418                      .dwendtag $C$DW$T$41
    1419              
    1420              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    1421                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1422                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1423              
    1424              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1425                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    1426              $C$DW$134       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1428                      .dwattr $C$DW$134, DW_AT_name("RSVD0")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE   39

    1429                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_RSVD0")
    1430                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$135       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1434                      .dwattr $C$DW$135, DW_AT_name("USBLDOCNTL")
    1435                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_USBLDOCNTL")
    1436                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1437                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$136       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1440                      .dwattr $C$DW$136, DW_AT_name("RSVD1")
    1441                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RSVD1")
    1442                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1443                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$137       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1446                      .dwattr $C$DW$137, DW_AT_name("SARCTRL")
    1447                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_SARCTRL")
    1448                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1449                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$138       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1452                      .dwattr $C$DW$138, DW_AT_name("RSVD2")
    1453                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RSVD2")
    1454                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1455                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$139       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1458                      .dwattr $C$DW$139, DW_AT_name("SARDATA")
    1459                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SARDATA")
    1460                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1461                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$140       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1464                      .dwattr $C$DW$140, DW_AT_name("RSVD3")
    1465                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RSVD3")
    1466                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1467                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$141       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1470                      .dwattr $C$DW$141, DW_AT_name("SARCLKCTRL")
    1471                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SARCLKCTRL")
    1472                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1473                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$142       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1476                      .dwattr $C$DW$142, DW_AT_name("RSVD4")
    1477                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RSVD4")
    1478                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1479                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$143       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1482                      .dwattr $C$DW$143, DW_AT_name("SARPINCTRL")
    1483                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SARPINCTRL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE   40

    1484                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1485                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$144       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1488                      .dwattr $C$DW$144, DW_AT_name("RSVD5")
    1489                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RSVD5")
    1490                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1491                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1492              $C$DW$145       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1494                      .dwattr $C$DW$145, DW_AT_name("SARGPOCTRL")
    1495                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SARGPOCTRL")
    1496                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1497                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1498                      .dwendtag $C$DW$T$23
    1499              
    1500              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    1501                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1502                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1503              $C$DW$146       .dwtag  DW_TAG_TI_far_type
    1504                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$24)
    1505              $C$DW$147       .dwtag  DW_TAG_TI_ioport_type
    1506                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$146)
    1507              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1508                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$147)
    1509              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1510                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1511                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1512              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    1513                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1514                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1515              
    1516              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1517                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    1518              $C$DW$148       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    1520                      .dwattr $C$DW$148, DW_AT_name("baseAddr")
    1521                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_baseAddr")
    1522                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$149       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$149, DW_AT_name("chanNo")
    1527                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_chanNo")
    1528                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1529                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1530              $C$DW$150       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1532                      .dwattr $C$DW$150, DW_AT_name("status")
    1533                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_status")
    1534                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1535                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1536                      .dwendtag $C$DW$T$28
    1537              
    1538              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE   41

    1539                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$28)
    1540                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1541              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1542                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1543                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    1544              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    1545                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1546                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1547              
    1548              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1549                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1550              $C$DW$151       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$151, DW_AT_name("SysClkDiv")
    1553                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SysClkDiv")
    1554                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$152       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$30)
    1558                      .dwattr $C$DW$152, DW_AT_name("OpMode")
    1559                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_OpMode")
    1560                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1561                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$153       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
    1564                      .dwattr $C$DW$153, DW_AT_name("MultiCh")
    1565                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_MultiCh")
    1566                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1567                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$154       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$34)
    1570                      .dwattr $C$DW$154, DW_AT_name("RefVoltage")
    1571                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_RefVoltage")
    1572                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1573                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1574                      .dwendtag $C$DW$T$35
    1575              
    1576              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    1577                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    1578                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1579              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1580                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1581                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1582              
    1583              $C$DW$T$48      .dwtag  DW_TAG_subroutine_type
    1584                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1585              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    1586                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1587                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    1588              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    1589                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1590                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1591              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1592                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1593                      .dwattr $C$DW$T$4, DW_AT_name("bool")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_IntcExample.asm                                              PAGE   42

    1594                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1595              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1596                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1597                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1598                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1599              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1600                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1601                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1602                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1603              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1604                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1605                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1606                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1607              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1608                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1609                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1610                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1611              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1612                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    1613                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1614              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1615                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1616                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1617              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1618                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$51)
    1619              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    1620                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$155)
    1621              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1622                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1623                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1624                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
