TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE    1

    2928              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:48 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   59

         00039f 0000 
    1876                      .align  2
    1877 0003a0 000A  $C$FSL31:       .string 10,"RTC Alarm Interrupt",10,10,0
         0003a1 0052 
         0003a2 0054 
         0003a3 0043 
         0003a4 0020 
         0003a5 0041 
         0003a6 006C 
         0003a7 0061 
         0003a8 0072 
         0003a9 006D 
         0003aa 0020 
         0003ab 0049 
         0003ac 006E 
         0003ad 0074 
         0003ae 0065 
         0003af 0072 
         0003b0 0072 
         0003b1 0075 
         0003b2 0070 
         0003b3 0074 
         0003b4 000A 
         0003b5 000A 
         0003b6 0000 
    1878              ;******************************************************************************
    1879              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1880              ;******************************************************************************
    1881                      .global _printf
    1882                      .global _RTC_reset
    1883                      .global _RTC_start
    1884                      .global _RTC_stop
    1885                      .global _RTC_config
    1886                      .global _RTC_getConfig
    1887                      .global _RTC_setTime
    1888                      .global _RTC_getTime
    1889                      .global _RTC_setDate
    1890                      .global _RTC_getDate
    1891                      .global _RTC_setAlarm
    1892                      .global _RTC_setPeriodicInterval
    1893                      .global _RTC_eventEnable
    1894                      .global _RTC_getEventId
    1895                      .global _RTC_setCallback
    1896                      .global _IRQ_plug
    1897                      .global _IRQ_clear
    1898                      .global _IRQ_clearAll
    1899                      .global _IRQ_disableAll
    1900                      .global _IRQ_enable
    1901                      .global _IRQ_setVecs
    1902                      .global _IRQ_globalDisable
    1903                      .global _IRQ_globalEnable
    1904                      .global _VECSTART
    1905              
    1906              ;*******************************************************************************
    1907              ;* TYPE INFORMATION                                                            *
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   60

    1908              ;*******************************************************************************
    1909              
    1910              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1911                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1912              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_DAY_PERIODIC_INTERRUPT"), DW_AT_const_value(0x
    1913              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_HR_PERIODIC_INTERRUPT"), DW_AT_const_value(0x0
    1914              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MINS_PERIODIC_INTERRUPT"), DW_AT_const_value(0
    1915              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_SEC_PERIODIC_INTERRUPT"), DW_AT_const_value(0x
    1916              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MS_PERIODIC_INTERRUPT"), DW_AT_const_value(0x0
    1917                      .dwendtag $C$DW$T$35
    1918              
    1919              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCPeriodicInterruptType")
    1920                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1921                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1922              
    1923              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1924                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1925              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MSEVENT_INTERRUPT"), DW_AT_const_value(0x00)
    1926              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_SECEVENT_INTERRUPT"), DW_AT_const_value(0x01)
    1927              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MINSEVENT_INTERRUPT"), DW_AT_const_value(0x02)
    1928              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_HREVENT_INTERRUPT"), DW_AT_const_value(0x03)
    1929              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_DAYEVENT_INTERRUPT"), DW_AT_const_value(0x04)
    1930              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_EXTEVENT_INTERRUPT"), DW_AT_const_value(0x05)
    1931              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_ALARM_INTERRUPT"), DW_AT_const_value(0x06)
    1932              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_INTERRUPT_NONE"), DW_AT_const_value(0x07)
    1933                      .dwendtag $C$DW$T$37
    1934              
    1935              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCEventType")
    1936                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1937                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1938              
    1939              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1940                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0f)
    1941              $C$DW$152       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1943                      .dwattr $C$DW$152, DW_AT_name("rtcmSec")
    1944                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rtcmSec")
    1945                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$153       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$153, DW_AT_name("rtcsec")
    1950                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rtcsec")
    1951                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1952                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$154       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$154, DW_AT_name("rtcmin")
    1956                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rtcmin")
    1957                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1958                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$155       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$155, DW_AT_name("rtchour")
    1962                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rtchour")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   61

    1963                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1964                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$156       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$156, DW_AT_name("rtcday")
    1968                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rtcday")
    1969                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1970                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$157       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$157, DW_AT_name("rtcmonth")
    1974                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rtcmonth")
    1975                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1976                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$158       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1979                      .dwattr $C$DW$158, DW_AT_name("rtcyear")
    1980                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rtcyear")
    1981                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1982                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$159       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$159, DW_AT_name("rtcmSeca")
    1986                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rtcmSeca")
    1987                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1988                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$160       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1991                      .dwattr $C$DW$160, DW_AT_name("rtcseca")
    1992                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rtcseca")
    1993                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1994                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$161       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$161, DW_AT_name("rtcmina")
    1998                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rtcmina")
    1999                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2000                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$162       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2003                      .dwattr $C$DW$162, DW_AT_name("rtchoura")
    2004                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rtchoura")
    2005                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2006                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$163       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$163, DW_AT_name("rtcdaya")
    2010                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rtcdaya")
    2011                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2012                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$164       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$164, DW_AT_name("rtcmontha")
    2016                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rtcmontha")
    2017                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   62

    2018                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$165       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2021                      .dwattr $C$DW$165, DW_AT_name("rtcyeara")
    2022                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rtcyeara")
    2023                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2024                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$166       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$166, DW_AT_name("rtcintcr")
    2028                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rtcintcr")
    2029                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2030                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2031                      .dwendtag $C$DW$T$20
    2032              
    2033              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcConfig")
    2034                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$20)
    2035                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2036              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2037                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2038                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    2039              
    2040              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2041                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2042              $C$DW$167       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$167, DW_AT_name("hours")
    2045                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_hours")
    2046                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$168       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$168, DW_AT_name("mins")
    2051                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_mins")
    2052                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2053                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$169       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2056                      .dwattr $C$DW$169, DW_AT_name("secs")
    2057                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_secs")
    2058                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2059                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$170       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$170, DW_AT_name("mSecs")
    2063                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_mSecs")
    2064                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2065                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2066                      .dwendtag $C$DW$T$21
    2067              
    2068              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcTime")
    2069                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$21)
    2070                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2071              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    2072                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   63

    2073                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    2074              
    2075              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2076                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x03)
    2077              $C$DW$171       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$171, DW_AT_name("year")
    2080                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_year")
    2081                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$172       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$172, DW_AT_name("month")
    2086                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_month")
    2087                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2088                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$173       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$173, DW_AT_name("day")
    2092                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_day")
    2093                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2094                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2095                      .dwendtag $C$DW$T$22
    2096              
    2097              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcDate")
    2098                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$22)
    2099                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2100              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    2101                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2102                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    2103              
    2104              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2105                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x07)
    2106              $C$DW$174       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2108                      .dwattr $C$DW$174, DW_AT_name("year")
    2109                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_year")
    2110                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$175       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2114                      .dwattr $C$DW$175, DW_AT_name("month")
    2115                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_month")
    2116                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2117                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2118              $C$DW$176       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2120                      .dwattr $C$DW$176, DW_AT_name("day")
    2121                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_day")
    2122                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2123                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$177       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2126                      .dwattr $C$DW$177, DW_AT_name("hours")
    2127                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_hours")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   64

    2128                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2129                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2130              $C$DW$178       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2132                      .dwattr $C$DW$178, DW_AT_name("mins")
    2133                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_mins")
    2134                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2135                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$179       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$179, DW_AT_name("secs")
    2139                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_secs")
    2140                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2141                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$180       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2144                      .dwattr $C$DW$180, DW_AT_name("mSecs")
    2145                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_mSecs")
    2146                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2147                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2148                      .dwendtag $C$DW$T$23
    2149              
    2150              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcAlarm")
    2151                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$23)
    2152                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2153              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2154                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2155                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    2156              
    2157              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2158                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2159              $C$DW$181       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    2161                      .dwattr $C$DW$181, DW_AT_name("isr")
    2162                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_isr")
    2163                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2165                      .dwendtag $C$DW$T$28
    2166              
    2167              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcIsrDispatchTable")
    2168                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$28)
    2169                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2170              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2171                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2172                      .dwattr $C$DW$T$50, DW_AT_address_class(0x17)
    2173              
    2174              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2175                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    2176              $C$DW$182       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$25)
    2178                      .dwattr $C$DW$182, DW_AT_name("MilEvtAddr")
    2179                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_MilEvtAddr")
    2180                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2181                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$183       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   65

    2183                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$25)
    2184                      .dwattr $C$DW$183, DW_AT_name("SecEvtAddr")
    2185                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SecEvtAddr")
    2186                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2187                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$184       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$25)
    2190                      .dwattr $C$DW$184, DW_AT_name("MinEvtAddr")
    2191                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_MinEvtAddr")
    2192                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2193                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$185       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$25)
    2196                      .dwattr $C$DW$185, DW_AT_name("HourEvtAddr")
    2197                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_HourEvtAddr")
    2198                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2199                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$186       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$25)
    2202                      .dwattr $C$DW$186, DW_AT_name("DayEvtAddr")
    2203                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DayEvtAddr")
    2204                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2205                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$187       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$25)
    2208                      .dwattr $C$DW$187, DW_AT_name("ExtEvtAddr")
    2209                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ExtEvtAddr")
    2210                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2211                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$188       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    2214                      .dwattr $C$DW$188, DW_AT_name("AlarmEvtAddr")
    2215                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_AlarmEvtAddr")
    2216                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2217                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2218                      .dwendtag $C$DW$T$29
    2219              
    2220              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcIsrAddr")
    2221                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    2222                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2223              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2224                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2225                      .dwattr $C$DW$T$52, DW_AT_address_class(0x17)
    2226              
    2227              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2228                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x66)
    2229              $C$DW$189       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$30)
    2231                      .dwattr $C$DW$189, DW_AT_name("RTCINTEN")
    2232                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RTCINTEN")
    2233                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2235              $C$DW$190       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$30)
    2237                      .dwattr $C$DW$190, DW_AT_name("RTCUPDATE")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   66

    2238                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_RTCUPDATE")
    2239                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2240                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2241              $C$DW$191       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    2243                      .dwattr $C$DW$191, DW_AT_name("RSVD0")
    2244                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD0")
    2245                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2246                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2247              $C$DW$192       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$30)
    2249                      .dwattr $C$DW$192, DW_AT_name("RTCMIL")
    2250                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_RTCMIL")
    2251                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2252                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2253              $C$DW$193       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$30)
    2255                      .dwattr $C$DW$193, DW_AT_name("RTCMILA")
    2256                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RTCMILA")
    2257                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2258                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$194       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    2261                      .dwattr $C$DW$194, DW_AT_name("RSVD1")
    2262                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD1")
    2263                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2264                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$195       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$30)
    2267                      .dwattr $C$DW$195, DW_AT_name("RTCSEC")
    2268                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RTCSEC")
    2269                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2270                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$196       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$30)
    2273                      .dwattr $C$DW$196, DW_AT_name("RTCSECA")
    2274                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RTCSECA")
    2275                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2276                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$197       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
    2279                      .dwattr $C$DW$197, DW_AT_name("RSVD2")
    2280                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RSVD2")
    2281                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2282                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$198       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$30)
    2285                      .dwattr $C$DW$198, DW_AT_name("RTCMIN")
    2286                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RTCMIN")
    2287                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2288                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$199       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$30)
    2291                      .dwattr $C$DW$199, DW_AT_name("RTCMINA")
    2292                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RTCMINA")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   67

    2293                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2294                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$200       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
    2297                      .dwattr $C$DW$200, DW_AT_name("RSVD3")
    2298                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD3")
    2299                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2300                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$201       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$30)
    2303                      .dwattr $C$DW$201, DW_AT_name("RTCHOUR")
    2304                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RTCHOUR")
    2305                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2306                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$202       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$30)
    2309                      .dwattr $C$DW$202, DW_AT_name("RTCHOURA")
    2310                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_RTCHOURA")
    2311                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2312                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$203       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    2315                      .dwattr $C$DW$203, DW_AT_name("RSVD4")
    2316                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RSVD4")
    2317                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2318                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$204       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$30)
    2321                      .dwattr $C$DW$204, DW_AT_name("RTCDAY")
    2322                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_RTCDAY")
    2323                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2324                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$205       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$30)
    2327                      .dwattr $C$DW$205, DW_AT_name("RTCDAYA")
    2328                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RTCDAYA")
    2329                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2330                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$206       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    2333                      .dwattr $C$DW$206, DW_AT_name("RSVD5")
    2334                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD5")
    2335                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2336                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$207       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$30)
    2339                      .dwattr $C$DW$207, DW_AT_name("RTCMONTH")
    2340                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_RTCMONTH")
    2341                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2342                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$208       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$30)
    2345                      .dwattr $C$DW$208, DW_AT_name("RTCMONTHA")
    2346                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RTCMONTHA")
    2347                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   68

    2348                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$209       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    2351                      .dwattr $C$DW$209, DW_AT_name("RSVD6")
    2352                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD6")
    2353                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2354                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$210       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$30)
    2357                      .dwattr $C$DW$210, DW_AT_name("RTCYEAR")
    2358                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_RTCYEAR")
    2359                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2360                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$211       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$30)
    2363                      .dwattr $C$DW$211, DW_AT_name("RTCYEARA")
    2364                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RTCYEARA")
    2365                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2366                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$212       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    2369                      .dwattr $C$DW$212, DW_AT_name("RSVD7")
    2370                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_RSVD7")
    2371                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2372                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$213       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$30)
    2375                      .dwattr $C$DW$213, DW_AT_name("RTCINTFL")
    2376                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RTCINTFL")
    2377                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2378                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$214       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$30)
    2381                      .dwattr $C$DW$214, DW_AT_name("RTCNOPWR")
    2382                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RTCNOPWR")
    2383                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2384                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$215       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
    2387                      .dwattr $C$DW$215, DW_AT_name("RSVD8")
    2388                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_RSVD8")
    2389                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2390                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$216       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$30)
    2393                      .dwattr $C$DW$216, DW_AT_name("RTCINTREG")
    2394                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RTCINTREG")
    2395                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2396                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$217       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$32)
    2399                      .dwattr $C$DW$217, DW_AT_name("RSVD9")
    2400                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_RSVD9")
    2401                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2402                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   69

    2403              $C$DW$218       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$30)
    2405                      .dwattr $C$DW$218, DW_AT_name("RTCDRIFT")
    2406                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RTCDRIFT")
    2407                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2408                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$219       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$32)
    2411                      .dwattr $C$DW$219, DW_AT_name("RSVD10")
    2412                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RSVD10")
    2413                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2414                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$220       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$30)
    2417                      .dwattr $C$DW$220, DW_AT_name("RTCOSC")
    2418                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RTCOSC")
    2419                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2420                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$221       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$32)
    2423                      .dwattr $C$DW$221, DW_AT_name("RSVD11")
    2424                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_RSVD11")
    2425                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2426                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$222       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$30)
    2429                      .dwattr $C$DW$222, DW_AT_name("RTCPMGT")
    2430                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_RTCPMGT")
    2431                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2432                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$223       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$33)
    2435                      .dwattr $C$DW$223, DW_AT_name("RSVD12")
    2436                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RSVD12")
    2437                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2438                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$224       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$30)
    2441                      .dwattr $C$DW$224, DW_AT_name("RTCSCR1")
    2442                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RTCSCR1")
    2443                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2444                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$225       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$30)
    2447                      .dwattr $C$DW$225, DW_AT_name("RTCSCR2")
    2448                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RTCSCR2")
    2449                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2450                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$226       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
    2453                      .dwattr $C$DW$226, DW_AT_name("RSVD13")
    2454                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD13")
    2455                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2456                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$227       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   70

    2458                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$30)
    2459                      .dwattr $C$DW$227, DW_AT_name("RTCSCR3")
    2460                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RTCSCR3")
    2461                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2462                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$228       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$30)
    2465                      .dwattr $C$DW$228, DW_AT_name("RTCSCR4")
    2466                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RTCSCR4")
    2467                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2468                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2469                      .dwendtag $C$DW$T$34
    2470              
    2471              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcRegs")
    2472                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$34)
    2473                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2474              $C$DW$229       .dwtag  DW_TAG_TI_far_type
    2475                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$53)
    2476              $C$DW$230       .dwtag  DW_TAG_TI_ioport_type
    2477                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$229)
    2478              $C$DW$T$54      .dwtag  DW_TAG_volatile_type
    2479                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$230)
    2480              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    2481                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2482                      .dwattr $C$DW$T$55, DW_AT_address_class(0x10)
    2483              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcRegsOvly")
    2484                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2485                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2486              
    2487              $C$DW$T$24      .dwtag  DW_TAG_subroutine_type
    2488                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2489              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2490                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2491                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    2492              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCCallBackPtr")
    2493                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2494                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2495              
    2496              $C$DW$T$27      .dwtag  DW_TAG_array_type
    2497                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2498                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2499                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    2500              $C$DW$231       .dwtag  DW_TAG_subrange_type
    2501                      .dwattr $C$DW$231, DW_AT_upper_bound(0x06)
    2502                      .dwendtag $C$DW$T$27
    2503              
    2504              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2505                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$25)
    2506                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2507              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2508                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2509                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2510                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2511              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2512                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc_example.asm                                                  PAGE   71

    2513                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2514                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2515              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2516                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2517                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2518                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2519              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2520                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
