TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE    1

    3055              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:38 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2089                      .global _IRQ_clearAll
    2090                      .global _IRQ_disableAll
    2091                      .global _IRQ_enable
    2092                      .global _IRQ_setVecs
    2093                      .global _IRQ_globalDisable
    2094                      .global _IRQ_globalEnable
    2095                      .global _VECSTART
    2096                      .global __divul
    2097                      .global __mpyli
    2098              
    2099              ;*******************************************************************************
    2100              ;* TYPE INFORMATION                                                            *
    2101              ;*******************************************************************************
    2102              
    2103              $C$DW$T$22      .dwtag  DW_TAG_enumeration_type
    2104                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2105              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_0"), DW_AT_const_value(0x00)
    2106              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_1"), DW_AT_const_value(0x01)
    2107              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_2"), DW_AT_const_value(0x02)
    2108              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_INVALID"), DW_AT_const_value(0x03)
    2109                      .dwendtag $C$DW$T$22
    2110              
    2111              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Instance")
    2112                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    2113                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2114              
    2115              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    2116                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   71

    2117              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_AUTO_DISABLE"), DW_AT_const_value(0x00)
    2118              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_AUTO_ENABLE"), DW_AT_const_value(0x01)
    2119                      .dwendtag $C$DW$T$29
    2120              
    2121              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AutoReLoad")
    2122                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2123                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2124              
    2125              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    2126                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2127              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_0"), DW_AT_const_value(0x00)
    2128              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_1"), DW_AT_const_value(0x01)
    2129              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_2"), DW_AT_const_value(0x02)
    2130              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_3"), DW_AT_const_value(0x03)
    2131              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_4"), DW_AT_const_value(0x04)
    2132              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_5"), DW_AT_const_value(0x05)
    2133              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_6"), DW_AT_const_value(0x06)
    2134              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_7"), DW_AT_const_value(0x07)
    2135              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_8"), DW_AT_const_value(0x08)
    2136              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_9"), DW_AT_const_value(0x09)
    2137              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_10"), DW_AT_const_value(0x0a)
    2138              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_11"), DW_AT_const_value(0x0b)
    2139              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_12"), DW_AT_const_value(0x0c)
    2140              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_RESERVE"), DW_AT_const_value(0x0d)
    2141                      .dwendtag $C$DW$T$31
    2142              
    2143              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_PreScale")
    2144                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2145                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2146              
    2147              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    2148                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2149              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_TIMER_DISABLE"), DW_AT_const_value(0x00)
    2150              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_TIMER_ENABLE"), DW_AT_const_value(0x01)
    2151                      .dwendtag $C$DW$T$33
    2152              
    2153              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CtrlTimer")
    2154                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2155                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2156              
    2157              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2158                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
    2159              $C$DW$177       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2161                      .dwattr $C$DW$177, DW_AT_name("TCR")
    2162                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_TCR")
    2163                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2165              $C$DW$178       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2167                      .dwattr $C$DW$178, DW_AT_name("RSVD0")
    2168                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD0")
    2169                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2170                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$179       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   72

    2172                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2173                      .dwattr $C$DW$179, DW_AT_name("TIMPRD1")
    2174                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_TIMPRD1")
    2175                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2176                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2177              $C$DW$180       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2179                      .dwattr $C$DW$180, DW_AT_name("TIMPRD2")
    2180                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_TIMPRD2")
    2181                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2182                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2183              $C$DW$181       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2185                      .dwattr $C$DW$181, DW_AT_name("TIMCNT1")
    2186                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_TIMCNT1")
    2187                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2188                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2189              $C$DW$182       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2191                      .dwattr $C$DW$182, DW_AT_name("TIMCNT2")
    2192                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_TIMCNT2")
    2193                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2194                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2195                      .dwendtag $C$DW$T$21
    2196              
    2197              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_TimRegs")
    2198                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    2199                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2200              $C$DW$183       .dwtag  DW_TAG_TI_far_type
    2201                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    2202              $C$DW$184       .dwtag  DW_TAG_TI_ioport_type
    2203                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$183)
    2204              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    2205                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$184)
    2206              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2207                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2208                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    2209              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_TimRegsOvly")
    2210                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2211                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2212              
    2213              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2214                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    2215              $C$DW$185       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    2217                      .dwattr $C$DW$185, DW_AT_name("Instance")
    2218                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_Instance")
    2219                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$186       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$186, DW_AT_name("EventId")
    2224                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_EventId")
    2225                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2226                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   73

    2227              $C$DW$187       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    2229                      .dwattr $C$DW$187, DW_AT_name("regs")
    2230                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_regs")
    2231                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2232                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2233                      .dwendtag $C$DW$T$28
    2234              
    2235              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GptObj")
    2236                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
    2237                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2238              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    2239                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2240                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    2241              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Handle")
    2242                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2243                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2244              
    2245              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2246                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x05)
    2247              $C$DW$188       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$30)
    2249                      .dwattr $C$DW$188, DW_AT_name("autoLoad")
    2250                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_autoLoad")
    2251                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2253              $C$DW$189       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    2255                      .dwattr $C$DW$189, DW_AT_name("preScaleDiv")
    2256                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_preScaleDiv")
    2257                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2258                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$190       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$34)
    2261                      .dwattr $C$DW$190, DW_AT_name("ctrlTim")
    2262                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ctrlTim")
    2263                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2264                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$191       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$191, DW_AT_name("prdLow")
    2268                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_prdLow")
    2269                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2270                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$192       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$192, DW_AT_name("prdHigh")
    2274                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_prdHigh")
    2275                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2276                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2277                      .dwendtag $C$DW$T$35
    2278              
    2279              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Config")
    2280                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$35)
    2281                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   74

    2282              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    2283                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2284                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    2285              
    2286              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2287                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x48)
    2288              $C$DW$193       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2290                      .dwattr $C$DW$193, DW_AT_name("EBSR")
    2291                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_EBSR")
    2292                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2294              $C$DW$194       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2296                      .dwattr $C$DW$194, DW_AT_name("RSVD0")
    2297                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD0")
    2298                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2299                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2300              $C$DW$195       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2302                      .dwattr $C$DW$195, DW_AT_name("PCGCR1")
    2303                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PCGCR1")
    2304                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2305                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$196       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2308                      .dwattr $C$DW$196, DW_AT_name("PCGCR2")
    2309                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PCGCR2")
    2310                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2311                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2312              $C$DW$197       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    2314                      .dwattr $C$DW$197, DW_AT_name("PSRCR")
    2315                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PSRCR")
    2316                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2317                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2318              $C$DW$198       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    2320                      .dwattr $C$DW$198, DW_AT_name("PRCR")
    2321                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PRCR")
    2322                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2323                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2324              $C$DW$199       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$36)
    2326                      .dwattr $C$DW$199, DW_AT_name("RSVD1")
    2327                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RSVD1")
    2328                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2329                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2330              $C$DW$200       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2332                      .dwattr $C$DW$200, DW_AT_name("TIAFR")
    2333                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_TIAFR")
    2334                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2335                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$201       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   75

    2337                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2338                      .dwattr $C$DW$201, DW_AT_name("RSVD2")
    2339                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD2")
    2340                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2341                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2342              $C$DW$202       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2344                      .dwattr $C$DW$202, DW_AT_name("ODSCR")
    2345                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ODSCR")
    2346                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2347                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2348              $C$DW$203       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    2350                      .dwattr $C$DW$203, DW_AT_name("PDINHIBR1")
    2351                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PDINHIBR1")
    2352                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2353                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2354              $C$DW$204       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2356                      .dwattr $C$DW$204, DW_AT_name("PDINHIBR2")
    2357                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PDINHIBR2")
    2358                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2359                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2360              $C$DW$205       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    2362                      .dwattr $C$DW$205, DW_AT_name("PDINHIBR3")
    2363                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PDINHIBR3")
    2364                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2365                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2366              $C$DW$206       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    2368                      .dwattr $C$DW$206, DW_AT_name("DMA0CESR1")
    2369                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA0CESR1")
    2370                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2371                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2372              $C$DW$207       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    2374                      .dwattr $C$DW$207, DW_AT_name("DMA0CESR2")
    2375                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DMA0CESR2")
    2376                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2377                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2378              $C$DW$208       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2380                      .dwattr $C$DW$208, DW_AT_name("DMA1CESR1")
    2381                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMA1CESR1")
    2382                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2383                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2384              $C$DW$209       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2386                      .dwattr $C$DW$209, DW_AT_name("DMA1CESR2")
    2387                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA1CESR2")
    2388                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2389                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2390              $C$DW$210       .dwtag  DW_TAG_member
    2391                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   76

    2392                      .dwattr $C$DW$210, DW_AT_name("SDRAMCCR")
    2393                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SDRAMCCR")
    2394                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2395                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2396              $C$DW$211       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2398                      .dwattr $C$DW$211, DW_AT_name("CCR2")
    2399                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_CCR2")
    2400                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2401                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$212       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2404                      .dwattr $C$DW$212, DW_AT_name("CGCR1")
    2405                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_CGCR1")
    2406                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2407                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2408              $C$DW$213       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    2410                      .dwattr $C$DW$213, DW_AT_name("CGICR")
    2411                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CGICR")
    2412                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2413                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$214       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    2416                      .dwattr $C$DW$214, DW_AT_name("CGCR2")
    2417                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CGCR2")
    2418                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2419                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2420              $C$DW$215       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2422                      .dwattr $C$DW$215, DW_AT_name("CGOCR")
    2423                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_CGOCR")
    2424                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2425                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$216       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2428                      .dwattr $C$DW$216, DW_AT_name("CCSSR")
    2429                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_CCSSR")
    2430                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2431                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$217       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2434                      .dwattr $C$DW$217, DW_AT_name("RSVD3")
    2435                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_RSVD3")
    2436                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2437                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2438              $C$DW$218       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2440                      .dwattr $C$DW$218, DW_AT_name("ECDR")
    2441                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_ECDR")
    2442                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2443                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2444              $C$DW$219       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2446                      .dwattr $C$DW$219, DW_AT_name("RSVD4")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   77

    2447                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RSVD4")
    2448                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2449                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2450              $C$DW$220       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2452                      .dwattr $C$DW$220, DW_AT_name("RAMSLPMDCNTLR1")
    2453                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2454                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2455                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$221       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2458                      .dwattr $C$DW$221, DW_AT_name("RSVD5")
    2459                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_RSVD5")
    2460                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2461                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$222       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2464                      .dwattr $C$DW$222, DW_AT_name("RAMSLPMDCNTLR2")
    2465                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2466                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2467                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$223       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2470                      .dwattr $C$DW$223, DW_AT_name("RAMSLPMDCNTLR3")
    2471                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2472                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2473                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2474              $C$DW$224       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    2476                      .dwattr $C$DW$224, DW_AT_name("RAMSLPMDCNTLR4")
    2477                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2478                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2479                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2480              $C$DW$225       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2482                      .dwattr $C$DW$225, DW_AT_name("RAMSLPMDCNTLR5")
    2483                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2484                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2485                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2486              $C$DW$226       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$37)
    2488                      .dwattr $C$DW$226, DW_AT_name("RSVD6")
    2489                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD6")
    2490                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2491                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2492              $C$DW$227       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2494                      .dwattr $C$DW$227, DW_AT_name("DMAIFR")
    2495                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_DMAIFR")
    2496                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2497                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$228       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2500                      .dwattr $C$DW$228, DW_AT_name("DMAIER")
    2501                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_DMAIER")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   78

    2502                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2503                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$229       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2506                      .dwattr $C$DW$229, DW_AT_name("USBSCR")
    2507                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_USBSCR")
    2508                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2509                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$230       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2512                      .dwattr $C$DW$230, DW_AT_name("ESCR")
    2513                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_ESCR")
    2514                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2515                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$231       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$37)
    2518                      .dwattr $C$DW$231, DW_AT_name("RSVD7")
    2519                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RSVD7")
    2520                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2521                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2522              $C$DW$232       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2524                      .dwattr $C$DW$232, DW_AT_name("DMA2CESR1")
    2525                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_DMA2CESR1")
    2526                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2527                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2528              $C$DW$233       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2530                      .dwattr $C$DW$233, DW_AT_name("DMA2CESR2")
    2531                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_DMA2CESR2")
    2532                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2533                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$234       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2536                      .dwattr $C$DW$234, DW_AT_name("DMA3CESR1")
    2537                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMA3CESR1")
    2538                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2539                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2540              $C$DW$235       .dwtag  DW_TAG_member
    2541                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2542                      .dwattr $C$DW$235, DW_AT_name("DMA3CESR2")
    2543                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMA3CESR2")
    2544                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2545                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2546              $C$DW$236       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2548                      .dwattr $C$DW$236, DW_AT_name("CLKSTOP")
    2549                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_CLKSTOP")
    2550                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2551                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2552              $C$DW$237       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$38)
    2554                      .dwattr $C$DW$237, DW_AT_name("RSVD8")
    2555                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_RSVD8")
    2556                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   79

    2557                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2558              $C$DW$238       .dwtag  DW_TAG_member
    2559                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2560                      .dwattr $C$DW$238, DW_AT_name("DIEIDR0")
    2561                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DIEIDR0")
    2562                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2563                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2564              $C$DW$239       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2566                      .dwattr $C$DW$239, DW_AT_name("DIEIDR1")
    2567                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DIEIDR1")
    2568                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2569                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2570              $C$DW$240       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2572                      .dwattr $C$DW$240, DW_AT_name("DIEIDR2")
    2573                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DIEIDR2")
    2574                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2575                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2576              $C$DW$241       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2578                      .dwattr $C$DW$241, DW_AT_name("DIEIDR3")
    2579                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DIEIDR3")
    2580                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2581                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2582              $C$DW$242       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2584                      .dwattr $C$DW$242, DW_AT_name("DIEIDR4")
    2585                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DIEIDR4")
    2586                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2587                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$243       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2590                      .dwattr $C$DW$243, DW_AT_name("DIEIDR5")
    2591                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DIEIDR5")
    2592                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2593                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$244       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2596                      .dwattr $C$DW$244, DW_AT_name("DIEIDR6")
    2597                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DIEIDR6")
    2598                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2599                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2600              $C$DW$245       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2602                      .dwattr $C$DW$245, DW_AT_name("DIEIDR7")
    2603                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DIEIDR7")
    2604                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2605                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2606                      .dwendtag $C$DW$T$39
    2607              
    2608              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2609                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    2610                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2611              $C$DW$246       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt_example.asm                                                  PAGE   80

    2612                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$50)
    2613              $C$DW$247       .dwtag  DW_TAG_TI_ioport_type
    2614                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$246)
    2615              $C$DW$T$51      .dwtag  DW_TAG_volatile_type
    2616                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$247)
    2617              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2618                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2619                      .dwattr $C$DW$T$52, DW_AT_address_class(0x10)
    2620              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2621                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2622                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2623              
    2624              $C$DW$T$54      .dwtag  DW_TAG_subroutine_type
    2625                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2626              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    2627                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2628                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    2629              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2630                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2631                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2632              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2633                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2634                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2635                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2636              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2637                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2638                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2639                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2640              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2641                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2642                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2643                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2644              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2645                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2646                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2647                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2648              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2649                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2650                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2651                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2652              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2653                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
    2654                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2655              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2656                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
