TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE    1

    5413              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:52 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3639              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
    3640              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
    3641              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    3642                      .dwendtag $C$DW$T$45
    3643              
    3644              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    3645                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3646                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3647              
    3648              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3649                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3650              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    3651              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    3652              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
    3653              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    3654              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    3655                      .dwendtag $C$DW$T$47
    3656              
    3657              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    3658                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3659                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3660              
    3661              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    3662                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3663              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    3664              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    3665              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  107

    3666                      .dwendtag $C$DW$T$49
    3667              
    3668              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    3669                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3670                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3671              
    3672              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    3673                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3674              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    3675              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    3676              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    3677                      .dwendtag $C$DW$T$51
    3678              
    3679              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    3680                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3681                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3682              
    3683              $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    3684                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3685              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    3686              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    3687              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    3688              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    3689                      .dwendtag $C$DW$T$53
    3690              
    3691              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    3692                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3693                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3694              
    3695              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    3696                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    3697              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    3698              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    3699              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    3700              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    3701                      .dwendtag $C$DW$T$55
    3702              
    3703              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    3704                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3705                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3706              
    3707              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3708                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    3709              $C$DW$296       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    3711                      .dwattr $C$DW$296, DW_AT_name("REV")
    3712                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_REV")
    3713                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3714                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3715              $C$DW$297       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    3717                      .dwattr $C$DW$297, DW_AT_name("STATUS")
    3718                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_STATUS")
    3719                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3720                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  108

    3721              $C$DW$298       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    3723                      .dwattr $C$DW$298, DW_AT_name("RSVD0")
    3724                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_RSVD0")
    3725                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3726                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3727              $C$DW$299       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    3729                      .dwattr $C$DW$299, DW_AT_name("AWCCR1")
    3730                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_AWCCR1")
    3731                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3732                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3733              $C$DW$300       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    3735                      .dwattr $C$DW$300, DW_AT_name("AWCCR2")
    3736                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_AWCCR2")
    3737                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3738                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3739              $C$DW$301       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    3741                      .dwattr $C$DW$301, DW_AT_name("RSVD1")
    3742                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD1")
    3743                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3744                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$302       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    3747                      .dwattr $C$DW$302, DW_AT_name("SDCR1")
    3748                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_SDCR1")
    3749                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3750                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$303       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    3753                      .dwattr $C$DW$303, DW_AT_name("SDCR2")
    3754                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_SDCR2")
    3755                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3756                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$304       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    3759                      .dwattr $C$DW$304, DW_AT_name("RSVD2")
    3760                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_RSVD2")
    3761                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3762                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$305       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    3765                      .dwattr $C$DW$305, DW_AT_name("SDRCR")
    3766                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_SDRCR")
    3767                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3768                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$306       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$22)
    3771                      .dwattr $C$DW$306, DW_AT_name("RSVD3")
    3772                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_RSVD3")
    3773                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3774                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$307       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  109

    3776                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    3777                      .dwattr $C$DW$307, DW_AT_name("ACS2CR1")
    3778                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_ACS2CR1")
    3779                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3780                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$308       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    3783                      .dwattr $C$DW$308, DW_AT_name("ACS2CR2")
    3784                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_ACS2CR2")
    3785                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3786                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$309       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    3789                      .dwattr $C$DW$309, DW_AT_name("RSVD4")
    3790                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD4")
    3791                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3792                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$310       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    3795                      .dwattr $C$DW$310, DW_AT_name("ACS3CR1")
    3796                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_ACS3CR1")
    3797                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3798                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$311       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    3801                      .dwattr $C$DW$311, DW_AT_name("ACS3CR2")
    3802                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_ACS3CR2")
    3803                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3804                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$312       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    3807                      .dwattr $C$DW$312, DW_AT_name("RSVD5")
    3808                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD5")
    3809                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3810                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$313       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    3813                      .dwattr $C$DW$313, DW_AT_name("ACS4CR1")
    3814                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_ACS4CR1")
    3815                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3816                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$314       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    3819                      .dwattr $C$DW$314, DW_AT_name("ACS4CR2")
    3820                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_ACS4CR2")
    3821                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3822                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$315       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    3825                      .dwattr $C$DW$315, DW_AT_name("RSVD6")
    3826                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD6")
    3827                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3828                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$316       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  110

    3831                      .dwattr $C$DW$316, DW_AT_name("ACS5CR1")
    3832                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_ACS5CR1")
    3833                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3834                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$317       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    3837                      .dwattr $C$DW$317, DW_AT_name("ACS5CR2")
    3838                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_ACS5CR2")
    3839                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3840                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$318       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    3843                      .dwattr $C$DW$318, DW_AT_name("RSVD7")
    3844                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_RSVD7")
    3845                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3846                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$319       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    3849                      .dwattr $C$DW$319, DW_AT_name("SDTIMR1")
    3850                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_SDTIMR1")
    3851                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3852                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$320       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$23)
    3855                      .dwattr $C$DW$320, DW_AT_name("RSVD8")
    3856                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD8")
    3857                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3858                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$321       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    3861                      .dwattr $C$DW$321, DW_AT_name("SDSRETR")
    3862                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_SDSRETR")
    3863                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3864                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$322       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    3867                      .dwattr $C$DW$322, DW_AT_name("RSVD9")
    3868                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_RSVD9")
    3869                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    3870                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$323       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    3873                      .dwattr $C$DW$323, DW_AT_name("EIRR")
    3874                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_EIRR")
    3875                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3876                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$324       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    3879                      .dwattr $C$DW$324, DW_AT_name("RSVD10")
    3880                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_RSVD10")
    3881                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3882                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$325       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    3885                      .dwattr $C$DW$325, DW_AT_name("EIMR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  111

    3886                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_EIMR")
    3887                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3888                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$326       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$22)
    3891                      .dwattr $C$DW$326, DW_AT_name("RSVD11")
    3892                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_RSVD11")
    3893                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3894                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$327       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    3897                      .dwattr $C$DW$327, DW_AT_name("EIMSR")
    3898                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_EIMSR")
    3899                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3900                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$328       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
    3903                      .dwattr $C$DW$328, DW_AT_name("RSVD12")
    3904                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD12")
    3905                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    3906                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$329       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    3909                      .dwattr $C$DW$329, DW_AT_name("EIMCR")
    3910                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_EIMCR")
    3911                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3912                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$330       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$24)
    3915                      .dwattr $C$DW$330, DW_AT_name("RSVD13")
    3916                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_RSVD13")
    3917                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    3918                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3919              $C$DW$331       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    3921                      .dwattr $C$DW$331, DW_AT_name("NANDFCR")
    3922                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_NANDFCR")
    3923                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3924                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$332       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
    3927                      .dwattr $C$DW$332, DW_AT_name("RSVD14")
    3928                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_RSVD14")
    3929                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3930                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$333       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    3933                      .dwattr $C$DW$333, DW_AT_name("NANDFSR1")
    3934                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_NANDFSR1")
    3935                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3936                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$334       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
    3939                      .dwattr $C$DW$334, DW_AT_name("NANDFSR2")
    3940                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_NANDFSR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  112

    3941                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3942                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3943              $C$DW$335       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    3945                      .dwattr $C$DW$335, DW_AT_name("RSVD15")
    3946                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD15")
    3947                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    3948                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$336       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    3951                      .dwattr $C$DW$336, DW_AT_name("PAGEMODCTRL1")
    3952                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    3953                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3954                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$337       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$20)
    3957                      .dwattr $C$DW$337, DW_AT_name("PAGEMODCTRL2")
    3958                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    3959                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    3960                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3961              $C$DW$338       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$25)
    3963                      .dwattr $C$DW$338, DW_AT_name("RSVD16")
    3964                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD16")
    3965                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    3966                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$339       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    3969                      .dwattr $C$DW$339, DW_AT_name("NCS2ECC1")
    3970                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_NCS2ECC1")
    3971                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3972                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$340       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
    3975                      .dwattr $C$DW$340, DW_AT_name("NCS2ECC2")
    3976                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_NCS2ECC2")
    3977                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    3978                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$341       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$21)
    3981                      .dwattr $C$DW$341, DW_AT_name("RSVD17")
    3982                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_RSVD17")
    3983                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    3984                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$342       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    3987                      .dwattr $C$DW$342, DW_AT_name("NCS3ECC1")
    3988                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_NCS3ECC1")
    3989                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3990                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$343       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    3993                      .dwattr $C$DW$343, DW_AT_name("NCS3ECC2")
    3994                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_NCS3ECC2")
    3995                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  113

    3996                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$344       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$21)
    3999                      .dwattr $C$DW$344, DW_AT_name("RSVD18")
    4000                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_RSVD18")
    4001                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    4002                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$345       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    4005                      .dwattr $C$DW$345, DW_AT_name("NCS4ECC1")
    4006                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_NCS4ECC1")
    4007                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4008                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$346       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    4011                      .dwattr $C$DW$346, DW_AT_name("NCS4ECC2")
    4012                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_NCS4ECC2")
    4013                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    4014                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$347       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$21)
    4017                      .dwattr $C$DW$347, DW_AT_name("RSVD19")
    4018                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_RSVD19")
    4019                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4020                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$348       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    4023                      .dwattr $C$DW$348, DW_AT_name("NCS5ECC1")
    4024                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_NCS5ECC1")
    4025                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4026                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$349       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    4029                      .dwattr $C$DW$349, DW_AT_name("NCS5ECC2")
    4030                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_NCS5ECC2")
    4031                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    4032                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$350       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$26)
    4035                      .dwattr $C$DW$350, DW_AT_name("RSVD20")
    4036                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_RSVD20")
    4037                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    4038                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$351       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    4041                      .dwattr $C$DW$351, DW_AT_name("NAND4BITECCLOAD")
    4042                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    4043                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4044                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$352       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$22)
    4047                      .dwattr $C$DW$352, DW_AT_name("RSVD21")
    4048                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD21")
    4049                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    4050                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  114

    4051              $C$DW$353       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    4053                      .dwattr $C$DW$353, DW_AT_name("NAND4BITECC1")
    4054                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_NAND4BITECC1")
    4055                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4056                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$354       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    4059                      .dwattr $C$DW$354, DW_AT_name("NAND4BITECC2")
    4060                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_NAND4BITECC2")
    4061                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    4062                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$355       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    4065                      .dwattr $C$DW$355, DW_AT_name("RSVD22")
    4066                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD22")
    4067                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    4068                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$356       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    4071                      .dwattr $C$DW$356, DW_AT_name("NAND4BITECC3")
    4072                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_NAND4BITECC3")
    4073                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4074                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$357       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    4077                      .dwattr $C$DW$357, DW_AT_name("NAND4BITECC4")
    4078                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_NAND4BITECC4")
    4079                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4080                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$358       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
    4083                      .dwattr $C$DW$358, DW_AT_name("RSVD23")
    4084                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD23")
    4085                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4086                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$359       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    4089                      .dwattr $C$DW$359, DW_AT_name("NAND4BITECC5")
    4090                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_NAND4BITECC5")
    4091                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4092                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$360       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    4095                      .dwattr $C$DW$360, DW_AT_name("NAND4BITECC6")
    4096                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_NAND4BITECC6")
    4097                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    4098                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$361       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
    4101                      .dwattr $C$DW$361, DW_AT_name("RSVD24")
    4102                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD24")
    4103                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4104                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$362       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  115

    4106                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    4107                      .dwattr $C$DW$362, DW_AT_name("NAND4BITECC7")
    4108                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_NAND4BITECC7")
    4109                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4110                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$363       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    4113                      .dwattr $C$DW$363, DW_AT_name("NAND4BITECC8")
    4114                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_NAND4BITECC8")
    4115                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    4116                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$364       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$21)
    4119                      .dwattr $C$DW$364, DW_AT_name("RSVD25")
    4120                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD25")
    4121                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4122                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$365       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    4125                      .dwattr $C$DW$365, DW_AT_name("NANDERRADD1")
    4126                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_NANDERRADD1")
    4127                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4128                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$366       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$366, DW_AT_name("NANDERRADD2")
    4132                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_NANDERRADD2")
    4133                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    4134                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$367       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    4137                      .dwattr $C$DW$367, DW_AT_name("RSVD26")
    4138                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RSVD26")
    4139                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4140                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$368       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    4143                      .dwattr $C$DW$368, DW_AT_name("NANDERRADD3")
    4144                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_NANDERRADD3")
    4145                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4146                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$369       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    4149                      .dwattr $C$DW$369, DW_AT_name("NANDERRADD4")
    4150                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_NANDERRADD4")
    4151                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    4152                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$370       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    4155                      .dwattr $C$DW$370, DW_AT_name("RSVD27")
    4156                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_RSVD27")
    4157                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4158                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$371       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  116

    4161                      .dwattr $C$DW$371, DW_AT_name("NANDERRVAL1")
    4162                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_NANDERRVAL1")
    4163                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4164                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$372       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    4167                      .dwattr $C$DW$372, DW_AT_name("NANDERRVAL2")
    4168                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_NANDERRVAL2")
    4169                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    4170                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$373       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
    4173                      .dwattr $C$DW$373, DW_AT_name("RSVD28")
    4174                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RSVD28")
    4175                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4176                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$374       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    4179                      .dwattr $C$DW$374, DW_AT_name("NANDERRVAL3")
    4180                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_NANDERRVAL3")
    4181                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4182                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$375       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    4185                      .dwattr $C$DW$375, DW_AT_name("NANDERRVAL4")
    4186                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_NANDERRVAL4")
    4187                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    4188                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwendtag $C$DW$T$27
    4190              
    4191              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    4192                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$27)
    4193                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4194              $C$DW$376       .dwtag  DW_TAG_TI_far_type
    4195                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$62)
    4196              $C$DW$377       .dwtag  DW_TAG_TI_ioport_type
    4197                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$376)
    4198              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    4199                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$377)
    4200              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    4201                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    4202                      .dwattr $C$DW$T$64, DW_AT_address_class(0x10)
    4203              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    4204                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4205                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4206              
    4207              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4208                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    4209              $C$DW$378       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    4211                      .dwattr $C$DW$378, DW_AT_name("EBSR")
    4212                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_EBSR")
    4213                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4214                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$379       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  117

    4216                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    4217                      .dwattr $C$DW$379, DW_AT_name("RSVD0")
    4218                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RSVD0")
    4219                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4220                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$380       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    4223                      .dwattr $C$DW$380, DW_AT_name("PCGCR1")
    4224                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_PCGCR1")
    4225                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4226                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$381       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    4229                      .dwattr $C$DW$381, DW_AT_name("PCGCR2")
    4230                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_PCGCR2")
    4231                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4232                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$382       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    4235                      .dwattr $C$DW$382, DW_AT_name("PSRCR")
    4236                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_PSRCR")
    4237                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4238                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$383       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    4241                      .dwattr $C$DW$383, DW_AT_name("PRCR")
    4242                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_PRCR")
    4243                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4244                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$384       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$28)
    4247                      .dwattr $C$DW$384, DW_AT_name("RSVD1")
    4248                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD1")
    4249                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4250                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$385       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    4253                      .dwattr $C$DW$385, DW_AT_name("TIAFR")
    4254                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_TIAFR")
    4255                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4256                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$386       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    4259                      .dwattr $C$DW$386, DW_AT_name("RSVD2")
    4260                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD2")
    4261                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4262                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$387       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    4265                      .dwattr $C$DW$387, DW_AT_name("ODSCR")
    4266                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ODSCR")
    4267                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4268                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$388       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  118

    4271                      .dwattr $C$DW$388, DW_AT_name("PDINHIBR1")
    4272                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_PDINHIBR1")
    4273                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4274                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$389       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    4277                      .dwattr $C$DW$389, DW_AT_name("PDINHIBR2")
    4278                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_PDINHIBR2")
    4279                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4280                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$390       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    4283                      .dwattr $C$DW$390, DW_AT_name("PDINHIBR3")
    4284                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_PDINHIBR3")
    4285                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4286                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$391       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    4289                      .dwattr $C$DW$391, DW_AT_name("DMA0CESR1")
    4290                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DMA0CESR1")
    4291                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4292                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$392       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    4295                      .dwattr $C$DW$392, DW_AT_name("DMA0CESR2")
    4296                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DMA0CESR2")
    4297                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4298                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$393       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    4301                      .dwattr $C$DW$393, DW_AT_name("DMA1CESR1")
    4302                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DMA1CESR1")
    4303                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4304                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$394       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    4307                      .dwattr $C$DW$394, DW_AT_name("DMA1CESR2")
    4308                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DMA1CESR2")
    4309                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4310                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$395       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    4313                      .dwattr $C$DW$395, DW_AT_name("SDRAMCCR")
    4314                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_SDRAMCCR")
    4315                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4316                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$396       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    4319                      .dwattr $C$DW$396, DW_AT_name("CCR2")
    4320                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_CCR2")
    4321                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4322                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$397       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    4325                      .dwattr $C$DW$397, DW_AT_name("CGCR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  119

    4326                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_CGCR1")
    4327                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4328                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$398       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    4331                      .dwattr $C$DW$398, DW_AT_name("CGICR")
    4332                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_CGICR")
    4333                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4334                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$399       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    4337                      .dwattr $C$DW$399, DW_AT_name("CGCR2")
    4338                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_CGCR2")
    4339                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4340                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$400       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    4343                      .dwattr $C$DW$400, DW_AT_name("CGOCR")
    4344                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CGOCR")
    4345                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4346                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$401       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    4349                      .dwattr $C$DW$401, DW_AT_name("CCSSR")
    4350                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_CCSSR")
    4351                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4352                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$402       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    4355                      .dwattr $C$DW$402, DW_AT_name("RSVD3")
    4356                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_RSVD3")
    4357                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4358                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$403       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    4361                      .dwattr $C$DW$403, DW_AT_name("ECDR")
    4362                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_ECDR")
    4363                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4364                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$404       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    4367                      .dwattr $C$DW$404, DW_AT_name("RSVD4")
    4368                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_RSVD4")
    4369                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4370                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$405       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    4373                      .dwattr $C$DW$405, DW_AT_name("RAMSLPMDCNTLR1")
    4374                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4375                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4376                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$406       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    4379                      .dwattr $C$DW$406, DW_AT_name("RSVD5")
    4380                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  120

    4381                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4382                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$407       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    4385                      .dwattr $C$DW$407, DW_AT_name("RAMSLPMDCNTLR2")
    4386                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4387                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4388                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$408       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    4391                      .dwattr $C$DW$408, DW_AT_name("RAMSLPMDCNTLR3")
    4392                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4393                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4394                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4395              $C$DW$409       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    4397                      .dwattr $C$DW$409, DW_AT_name("RAMSLPMDCNTLR4")
    4398                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4399                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4400                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4401              $C$DW$410       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    4403                      .dwattr $C$DW$410, DW_AT_name("RAMSLPMDCNTLR5")
    4404                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4405                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4406                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$411       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$21)
    4409                      .dwattr $C$DW$411, DW_AT_name("RSVD6")
    4410                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_RSVD6")
    4411                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4412                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$412       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    4415                      .dwattr $C$DW$412, DW_AT_name("DMAIFR")
    4416                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_DMAIFR")
    4417                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4418                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4419              $C$DW$413       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    4421                      .dwattr $C$DW$413, DW_AT_name("DMAIER")
    4422                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_DMAIER")
    4423                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4424                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$414       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    4427                      .dwattr $C$DW$414, DW_AT_name("USBSCR")
    4428                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_USBSCR")
    4429                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4430                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$415       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    4433                      .dwattr $C$DW$415, DW_AT_name("ESCR")
    4434                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ESCR")
    4435                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  121

    4436                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$416       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    4439                      .dwattr $C$DW$416, DW_AT_name("RSVD7")
    4440                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_RSVD7")
    4441                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4442                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$417       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    4445                      .dwattr $C$DW$417, DW_AT_name("DMA2CESR1")
    4446                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_DMA2CESR1")
    4447                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4448                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$418       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    4451                      .dwattr $C$DW$418, DW_AT_name("DMA2CESR2")
    4452                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_DMA2CESR2")
    4453                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4454                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$419       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    4457                      .dwattr $C$DW$419, DW_AT_name("DMA3CESR1")
    4458                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_DMA3CESR1")
    4459                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4460                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$420       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    4463                      .dwattr $C$DW$420, DW_AT_name("DMA3CESR2")
    4464                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_DMA3CESR2")
    4465                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4466                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$421       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    4469                      .dwattr $C$DW$421, DW_AT_name("CLKSTOP")
    4470                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_CLKSTOP")
    4471                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4472                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$422       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$29)
    4475                      .dwattr $C$DW$422, DW_AT_name("RSVD8")
    4476                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RSVD8")
    4477                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4478                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$423       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    4481                      .dwattr $C$DW$423, DW_AT_name("DIEIDR0")
    4482                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_DIEIDR0")
    4483                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4484                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$424       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    4487                      .dwattr $C$DW$424, DW_AT_name("DIEIDR1")
    4488                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DIEIDR1")
    4489                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4490                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  122

    4491              $C$DW$425       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    4493                      .dwattr $C$DW$425, DW_AT_name("DIEIDR2")
    4494                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DIEIDR2")
    4495                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4496                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$426       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    4499                      .dwattr $C$DW$426, DW_AT_name("DIEIDR3")
    4500                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_DIEIDR3")
    4501                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4502                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4503              $C$DW$427       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4505                      .dwattr $C$DW$427, DW_AT_name("DIEIDR4")
    4506                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_DIEIDR4")
    4507                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4508                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$428       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4511                      .dwattr $C$DW$428, DW_AT_name("DIEIDR5")
    4512                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_DIEIDR5")
    4513                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4514                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4515              $C$DW$429       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4517                      .dwattr $C$DW$429, DW_AT_name("DIEIDR6")
    4518                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_DIEIDR6")
    4519                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4520                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$430       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4523                      .dwattr $C$DW$430, DW_AT_name("DIEIDR7")
    4524                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DIEIDR7")
    4525                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4526                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4527                      .dwendtag $C$DW$T$30
    4528              
    4529              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4530                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$30)
    4531                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4532              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    4533                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$66)
    4534              $C$DW$432       .dwtag  DW_TAG_TI_ioport_type
    4535                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$431)
    4536              $C$DW$T$67      .dwtag  DW_TAG_volatile_type
    4537                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$432)
    4538              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    4539                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    4540                      .dwattr $C$DW$T$68, DW_AT_address_class(0x10)
    4541              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4542                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4543                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4544              
    4545              $C$DW$T$36      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  123

    4546                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    4547              $C$DW$433       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$32)
    4549                      .dwattr $C$DW$433, DW_AT_name("name")
    4550                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_name")
    4551                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4552                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$434       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$33)
    4555                      .dwattr $C$DW$434, DW_AT_name("id")
    4556                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_id")
    4557                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4558                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$435       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$33)
    4561                      .dwattr $C$DW$435, DW_AT_name("bytesPerPage")
    4562                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_bytesPerPage")
    4563                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4564                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$436       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$33)
    4567                      .dwattr $C$DW$436, DW_AT_name("chipSize")
    4568                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_chipSize")
    4569                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4570                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$437       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$33)
    4573                      .dwattr $C$DW$437, DW_AT_name("eraseSize")
    4574                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_eraseSize")
    4575                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4576                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$438       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$35)
    4579                      .dwattr $C$DW$438, DW_AT_name("nand8Bit")
    4580                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_nand8Bit")
    4581                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4582                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$439       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$33)
    4585                      .dwattr $C$DW$439, DW_AT_name("nandOptions")
    4586                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_nandOptions")
    4587                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4588                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4589                      .dwendtag $C$DW$T$36
    4590              
    4591              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandFlashDev")
    4592                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    4593                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4594              
    4595              $C$DW$T$75      .dwtag  DW_TAG_array_type
    4596                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4597                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4598                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x348)
    4599              $C$DW$440       .dwtag  DW_TAG_subrange_type
    4600                      .dwattr $C$DW$440, DW_AT_upper_bound(0x3b)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  124

    4601                      .dwendtag $C$DW$T$75
    4602              
    4603              
    4604              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4605                      .dwattr $C$DW$T$38, DW_AT_name("CSL_NandAsyncBank")
    4606                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    4607              $C$DW$441       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$37)
    4609                      .dwattr $C$DW$441, DW_AT_name("CExDATA")
    4610                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_CExDATA")
    4611                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4612                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$442       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$37)
    4615                      .dwattr $C$DW$442, DW_AT_name("CExALE")
    4616                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_CExALE")
    4617                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4618                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$443       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$37)
    4621                      .dwattr $C$DW$443, DW_AT_name("CExCLE")
    4622                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_CExCLE")
    4623                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4624                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4625              $C$DW$444       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$37)
    4627                      .dwattr $C$DW$444, DW_AT_name("CExNUM")
    4628                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_CExNUM")
    4629                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4630                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4631                      .dwendtag $C$DW$T$38
    4632              
    4633              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncBank")
    4634                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$38)
    4635                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4636              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    4637                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$71)
    4638                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    4639              
    4640              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4641                      .dwattr $C$DW$T$39, DW_AT_name("CSL_NandAsyncCfg")
    4642                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    4643              $C$DW$445       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
    4645                      .dwattr $C$DW$445, DW_AT_name("selectStrobe")
    4646                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_selectStrobe")
    4647                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4648                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$446       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    4651                      .dwattr $C$DW$446, DW_AT_name("ewMode")
    4652                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_ewMode")
    4653                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4654                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$447       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  125

    4656                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    4657                      .dwattr $C$DW$447, DW_AT_name("w_setup")
    4658                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_w_setup")
    4659                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4660                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4661              $C$DW$448       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    4663                      .dwattr $C$DW$448, DW_AT_name("w_strobe")
    4664                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_w_strobe")
    4665                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4666                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4667              $C$DW$449       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
    4669                      .dwattr $C$DW$449, DW_AT_name("w_hold")
    4670                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_w_hold")
    4671                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4672                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4673              $C$DW$450       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
    4675                      .dwattr $C$DW$450, DW_AT_name("r_setup")
    4676                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_r_setup")
    4677                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4678                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4679              $C$DW$451       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    4681                      .dwattr $C$DW$451, DW_AT_name("r_strobe")
    4682                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_r_strobe")
    4683                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4684                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4685              $C$DW$452       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    4687                      .dwattr $C$DW$452, DW_AT_name("r_hold")
    4688                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_r_hold")
    4689                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4690                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4691              $C$DW$453       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
    4693                      .dwattr $C$DW$453, DW_AT_name("turnAround")
    4694                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_turnAround")
    4695                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4696                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4697              $C$DW$454       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    4699                      .dwattr $C$DW$454, DW_AT_name("aSize")
    4700                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_aSize")
    4701                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4702                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4703                      .dwendtag $C$DW$T$39
    4704              
    4705              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncCfg")
    4706                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$39)
    4707                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4708              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    4709                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4710                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  126

    4711              
    4712              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4713                      .dwattr $C$DW$T$44, DW_AT_name("CSL_NandAsyncWaitCfg")
    4714                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    4715              $C$DW$455       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$41)
    4717                      .dwattr $C$DW$455, DW_AT_name("waitPol")
    4718                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_waitPol")
    4719                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4720                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4721              $C$DW$456       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$43)
    4723                      .dwattr $C$DW$456, DW_AT_name("nandPort")
    4724                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_nandPort")
    4725                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4726                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4727              $C$DW$457       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4729                      .dwattr $C$DW$457, DW_AT_name("waitCycles")
    4730                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_waitCycles")
    4731                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4732                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4733                      .dwendtag $C$DW$T$44
    4734              
    4735              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncWaitCfg")
    4736                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$44)
    4737                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4738              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4739                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4740                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    4741              
    4742              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4743                      .dwattr $C$DW$T$61, DW_AT_name("CSL_NandConfig")
    4744                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x0c)
    4745              $C$DW$458       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$35)
    4747                      .dwattr $C$DW$458, DW_AT_name("nandWidth")
    4748                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_nandWidth")
    4749                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$459       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$46)
    4753                      .dwattr $C$DW$459, DW_AT_name("nandPageSize")
    4754                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_nandPageSize")
    4755                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4756                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4757              $C$DW$460       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$48)
    4759                      .dwattr $C$DW$460, DW_AT_name("nandBankNo")
    4760                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_nandBankNo")
    4761                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4762                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$461       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$50)
    4765                      .dwattr $C$DW$461, DW_AT_name("emifAccess")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  127

    4766                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_emifAccess")
    4767                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4768                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$462       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$52)
    4771                      .dwattr $C$DW$462, DW_AT_name("nandOpMode")
    4772                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_nandOpMode")
    4773                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4774                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$463       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    4777                      .dwattr $C$DW$463, DW_AT_name("nandType")
    4778                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_nandType")
    4779                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4780                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$464       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$56)
    4783                      .dwattr $C$DW$464, DW_AT_name("chipSelect")
    4784                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_chipSelect")
    4785                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4786                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4787              $C$DW$465       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$58)
    4789                      .dwattr $C$DW$465, DW_AT_name("asyncWaitCfg")
    4790                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_asyncWaitCfg")
    4791                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4792                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4793              $C$DW$466       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$60)
    4795                      .dwattr $C$DW$466, DW_AT_name("asyncCfg")
    4796                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_asyncCfg")
    4797                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4798                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4799                      .dwendtag $C$DW$T$61
    4800              
    4801              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandConfig")
    4802                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$61)
    4803                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    4804              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4805                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    4806                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    4807              
    4808              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4809                      .dwattr $C$DW$T$73, DW_AT_name("CSL_NandObj")
    4810                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x14)
    4811              $C$DW$467       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$65)
    4813                      .dwattr $C$DW$467, DW_AT_name("regs")
    4814                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_regs")
    4815                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$468       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$69)
    4819                      .dwattr $C$DW$468, DW_AT_name("sysCtrlRegs")
    4820                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_sysCtrlRegs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand_intr_example.asm                                            PAGE  128

    4821                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4822                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4823              $C$DW$469       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    4825                      .dwattr $C$DW$469, DW_AT_name("instId")
    4826                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_instId")
    4827                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4828                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4829              $C$DW$470       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$35)
    4831                      .dwattr $C$DW$470, DW_AT_name("nandWidth")
    4832                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_nandWidth")
    4833                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4834                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4835              $C$DW$471       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$70)
    4837                      .dwattr $C$DW$471, DW_AT_name("intrNumNand")
    4838                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_intrNumNand")
    4839                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4840                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$472       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$71)
    4843                      .dwattr $C$DW$472, DW_AT_name("bank")
    4844                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_bank")
    4845                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4846                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$473       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$46)
    4849                      .dwattr $C$DW$473, DW_AT_name("nandPageSize")
