TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE    1

    3005              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:43 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   45

    1558              
    1559              $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    1560                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1561              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
    1562              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
    1563              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
    1564              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
    1565              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    1566                      .dwendtag $C$DW$T$53
    1567              
    1568              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    1569                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1570                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1571              
    1572              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    1573                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1574              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    1575              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    1576              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    1577              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    1578              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    1579              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    1580              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    1581              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    1582              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    1583              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    1584              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    1585              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    1586              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    1587              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    1588              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    1589              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    1590              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    1591              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    1592              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    1593              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    1594              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    1595              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    1596                      .dwendtag $C$DW$T$55
    1597              
    1598              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    1599                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1600                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1601              
    1602              $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    1603                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    1604              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
    1605              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
    1606              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
    1607                      .dwendtag $C$DW$T$66
    1608              
    1609              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
    1610                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1611                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1612              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   46

    1613              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1614                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
    1615              $C$DW$179       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1617                      .dwattr $C$DW$179, DW_AT_name("THR")
    1618                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_THR")
    1619                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$180       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1623                      .dwattr $C$DW$180, DW_AT_name("RSVD0")
    1624                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD0")
    1625                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$181       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1629                      .dwattr $C$DW$181, DW_AT_name("IER")
    1630                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_IER")
    1631                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1632                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$182       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1635                      .dwattr $C$DW$182, DW_AT_name("RSVD1")
    1636                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD1")
    1637                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1638                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$183       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1641                      .dwattr $C$DW$183, DW_AT_name("FCR")
    1642                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_FCR")
    1643                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1644                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$184       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1647                      .dwattr $C$DW$184, DW_AT_name("RSVD2")
    1648                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_RSVD2")
    1649                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1650                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$185       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1653                      .dwattr $C$DW$185, DW_AT_name("LCR")
    1654                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_LCR")
    1655                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1656                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$186       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1659                      .dwattr $C$DW$186, DW_AT_name("RSVD3")
    1660                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RSVD3")
    1661                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1662                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$187       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    1665                      .dwattr $C$DW$187, DW_AT_name("MCR")
    1666                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_MCR")
    1667                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   47

    1668                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$188       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1671                      .dwattr $C$DW$188, DW_AT_name("RSVD4")
    1672                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD4")
    1673                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1674                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$189       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1677                      .dwattr $C$DW$189, DW_AT_name("LSR")
    1678                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_LSR")
    1679                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1680                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$190       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1683                      .dwattr $C$DW$190, DW_AT_name("RSVD5")
    1684                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_RSVD5")
    1685                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1686                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$191       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1689                      .dwattr $C$DW$191, DW_AT_name("SCR")
    1690                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SCR")
    1691                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1692                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$192       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1695                      .dwattr $C$DW$192, DW_AT_name("RSVD6")
    1696                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_RSVD6")
    1697                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1698                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$193       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1701                      .dwattr $C$DW$193, DW_AT_name("DLL")
    1702                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DLL")
    1703                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1704                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$194       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    1707                      .dwattr $C$DW$194, DW_AT_name("RSVD7")
    1708                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD7")
    1709                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1710                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$195       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1713                      .dwattr $C$DW$195, DW_AT_name("DLH")
    1714                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DLH")
    1715                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1716                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$196       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    1719                      .dwattr $C$DW$196, DW_AT_name("RSVD8")
    1720                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSVD8")
    1721                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1722                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   48

    1723              $C$DW$197       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1725                      .dwattr $C$DW$197, DW_AT_name("PWREMU_MGMT")
    1726                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PWREMU_MGMT")
    1727                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1728                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1729                      .dwendtag $C$DW$T$23
    1730              
    1731              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
    1732                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    1733                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1734              $C$DW$198       .dwtag  DW_TAG_TI_far_type
    1735                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$58)
    1736              $C$DW$199       .dwtag  DW_TAG_TI_ioport_type
    1737                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$198)
    1738              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1739                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$199)
    1740              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1741                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1742                      .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    1743              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
    1744                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1745                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1746              
    1747              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1748                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    1749              $C$DW$200       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1751                      .dwattr $C$DW$200, DW_AT_name("EBSR")
    1752                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EBSR")
    1753                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$201       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1757                      .dwattr $C$DW$201, DW_AT_name("RSVD0")
    1758                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD0")
    1759                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1760                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$202       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1763                      .dwattr $C$DW$202, DW_AT_name("PCGCR1")
    1764                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCGCR1")
    1765                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1766                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$203       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    1769                      .dwattr $C$DW$203, DW_AT_name("PCGCR2")
    1770                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCGCR2")
    1771                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1772                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$204       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$204, DW_AT_name("PSRCR")
    1776                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PSRCR")
    1777                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   49

    1778                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$205       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    1781                      .dwattr $C$DW$205, DW_AT_name("PRCR")
    1782                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PRCR")
    1783                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1784                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$206       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    1787                      .dwattr $C$DW$206, DW_AT_name("RSVD1")
    1788                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD1")
    1789                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1790                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$207       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$207, DW_AT_name("TIAFR")
    1794                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_TIAFR")
    1795                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1796                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$208       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    1799                      .dwattr $C$DW$208, DW_AT_name("RSVD2")
    1800                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD2")
    1801                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1802                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$209       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    1805                      .dwattr $C$DW$209, DW_AT_name("ODSCR")
    1806                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ODSCR")
    1807                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1808                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$210       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    1811                      .dwattr $C$DW$210, DW_AT_name("PDINHIBR1")
    1812                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PDINHIBR1")
    1813                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1814                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$211       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$211, DW_AT_name("PDINHIBR2")
    1818                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PDINHIBR2")
    1819                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1820                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$212       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    1823                      .dwattr $C$DW$212, DW_AT_name("PDINHIBR3")
    1824                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PDINHIBR3")
    1825                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1826                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$213       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    1829                      .dwattr $C$DW$213, DW_AT_name("DMA0CESR1")
    1830                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DMA0CESR1")
    1831                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1832                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   50

    1833              $C$DW$214       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    1835                      .dwattr $C$DW$214, DW_AT_name("DMA0CESR2")
    1836                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMA0CESR2")
    1837                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1838                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$215       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    1841                      .dwattr $C$DW$215, DW_AT_name("DMA1CESR1")
    1842                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMA1CESR1")
    1843                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1844                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$216       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    1847                      .dwattr $C$DW$216, DW_AT_name("DMA1CESR2")
    1848                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DMA1CESR2")
    1849                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1850                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$217       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    1853                      .dwattr $C$DW$217, DW_AT_name("SDRAMCCR")
    1854                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_SDRAMCCR")
    1855                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1856                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$218       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    1859                      .dwattr $C$DW$218, DW_AT_name("CCR2")
    1860                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CCR2")
    1861                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1862                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$219       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    1865                      .dwattr $C$DW$219, DW_AT_name("CGCR1")
    1866                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_CGCR1")
    1867                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1868                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$220       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    1871                      .dwattr $C$DW$220, DW_AT_name("CGICR")
    1872                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_CGICR")
    1873                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1874                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$221       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    1877                      .dwattr $C$DW$221, DW_AT_name("CGCR2")
    1878                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_CGCR2")
    1879                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1880                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$222       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    1883                      .dwattr $C$DW$222, DW_AT_name("CGOCR")
    1884                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_CGOCR")
    1885                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1886                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$223       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   51

    1888                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    1889                      .dwattr $C$DW$223, DW_AT_name("CCSSR")
    1890                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_CCSSR")
    1891                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1892                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$224       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    1895                      .dwattr $C$DW$224, DW_AT_name("RSVD3")
    1896                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD3")
    1897                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1898                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$225       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    1901                      .dwattr $C$DW$225, DW_AT_name("ECDR")
    1902                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_ECDR")
    1903                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1904                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$226       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    1907                      .dwattr $C$DW$226, DW_AT_name("RSVD4")
    1908                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD4")
    1909                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1910                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$227       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    1913                      .dwattr $C$DW$227, DW_AT_name("RAMSLPMDCNTLR1")
    1914                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1915                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1916                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$228       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    1919                      .dwattr $C$DW$228, DW_AT_name("RSVD5")
    1920                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD5")
    1921                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1922                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$229       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    1925                      .dwattr $C$DW$229, DW_AT_name("RAMSLPMDCNTLR2")
    1926                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1927                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1928                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$230       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    1931                      .dwattr $C$DW$230, DW_AT_name("RAMSLPMDCNTLR3")
    1932                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1933                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1934                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$231       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    1937                      .dwattr $C$DW$231, DW_AT_name("RAMSLPMDCNTLR4")
    1938                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1939                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1940                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$232       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   52

    1943                      .dwattr $C$DW$232, DW_AT_name("RAMSLPMDCNTLR5")
    1944                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1945                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1946                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$233       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$25)
    1949                      .dwattr $C$DW$233, DW_AT_name("RSVD6")
    1950                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RSVD6")
    1951                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1952                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$234       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    1955                      .dwattr $C$DW$234, DW_AT_name("DMAIFR")
    1956                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMAIFR")
    1957                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1958                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$235       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    1961                      .dwattr $C$DW$235, DW_AT_name("DMAIER")
    1962                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMAIER")
    1963                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1964                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$236       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    1967                      .dwattr $C$DW$236, DW_AT_name("USBSCR")
    1968                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_USBSCR")
    1969                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1970                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$237       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    1973                      .dwattr $C$DW$237, DW_AT_name("ESCR")
    1974                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ESCR")
    1975                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1976                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$238       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$25)
    1979                      .dwattr $C$DW$238, DW_AT_name("RSVD7")
    1980                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSVD7")
    1981                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1982                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$239       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1985                      .dwattr $C$DW$239, DW_AT_name("DMA2CESR1")
    1986                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DMA2CESR1")
    1987                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1988                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$240       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    1991                      .dwattr $C$DW$240, DW_AT_name("DMA2CESR2")
    1992                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DMA2CESR2")
    1993                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1994                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$241       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    1997                      .dwattr $C$DW$241, DW_AT_name("DMA3CESR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   53

    1998                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMA3CESR1")
    1999                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2000                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$242       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2003                      .dwattr $C$DW$242, DW_AT_name("DMA3CESR2")
    2004                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMA3CESR2")
    2005                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2006                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$243       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2009                      .dwattr $C$DW$243, DW_AT_name("CLKSTOP")
    2010                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CLKSTOP")
    2011                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2012                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$244       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$22)
    2015                      .dwattr $C$DW$244, DW_AT_name("RSVD8")
    2016                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD8")
    2017                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2018                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$245       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2021                      .dwattr $C$DW$245, DW_AT_name("DIEIDR0")
    2022                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DIEIDR0")
    2023                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2024                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$246       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2027                      .dwattr $C$DW$246, DW_AT_name("DIEIDR1")
    2028                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DIEIDR1")
    2029                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2030                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$247       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2033                      .dwattr $C$DW$247, DW_AT_name("DIEIDR2")
    2034                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DIEIDR2")
    2035                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2036                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$248       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2039                      .dwattr $C$DW$248, DW_AT_name("DIEIDR3")
    2040                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DIEIDR3")
    2041                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2042                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2043              $C$DW$249       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2045                      .dwattr $C$DW$249, DW_AT_name("DIEIDR4")
    2046                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DIEIDR4")
    2047                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2048                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$250       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2051                      .dwattr $C$DW$250, DW_AT_name("DIEIDR5")
    2052                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DIEIDR5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   54

    2053                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2054                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$251       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2057                      .dwattr $C$DW$251, DW_AT_name("DIEIDR6")
    2058                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DIEIDR6")
    2059                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2060                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$252       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2063                      .dwattr $C$DW$252, DW_AT_name("DIEIDR7")
    2064                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DIEIDR7")
    2065                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2066                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2067                      .dwendtag $C$DW$T$26
    2068              
    2069              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2070                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
    2071                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2072              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    2073                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$62)
    2074              $C$DW$254       .dwtag  DW_TAG_TI_ioport_type
    2075                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$253)
    2076              $C$DW$T$63      .dwtag  DW_TAG_volatile_type
    2077                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$254)
    2078              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2079                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2080                      .dwattr $C$DW$T$64, DW_AT_address_class(0x10)
    2081              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2082                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2083                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2084              
    2085              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2086                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2087              $C$DW$255       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    2089                      .dwattr $C$DW$255, DW_AT_name("clkInput")
    2090                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_clkInput")
    2091                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2093              $C$DW$256       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    2095                      .dwattr $C$DW$256, DW_AT_name("baud")
    2096                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_baud")
    2097                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2098                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2099              $C$DW$257       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2101                      .dwattr $C$DW$257, DW_AT_name("wordLength")
    2102                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_wordLength")
    2103                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2104                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2105              $C$DW$258       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2107                      .dwattr $C$DW$258, DW_AT_name("stopBits")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   55

    2108                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_stopBits")
    2109                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2110                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2111              $C$DW$259       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$259, DW_AT_name("parity")
    2114                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_parity")
    2115                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2116                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$260       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$260, DW_AT_name("fifoControl")
    2120                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_fifoControl")
    2121                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2122                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2123              $C$DW$261       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2125                      .dwattr $C$DW$261, DW_AT_name("loopBackEnable")
    2126                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_loopBackEnable")
    2127                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2128                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$262       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$262, DW_AT_name("afeEnable")
    2132                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_afeEnable")
    2133                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2134                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$263       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$263, DW_AT_name("rtsEnable")
    2138                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rtsEnable")
    2139                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2140                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2141                      .dwendtag $C$DW$T$28
    2142              
    2143              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartSetup")
    2144                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$28)
    2145                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2146              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2147                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2148                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    2149              
    2150              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2151                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x66)
    2152              $C$DW$264       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2154                      .dwattr $C$DW$264, DW_AT_name("DMACH0SSAL")
    2155                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2156                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$265       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2160                      .dwattr $C$DW$265, DW_AT_name("DMACH0SSAU")
    2161                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2162                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   56

    2163                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$266       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2166                      .dwattr $C$DW$266, DW_AT_name("DMACH0DSAL")
    2167                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2168                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2169                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$267       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2172                      .dwattr $C$DW$267, DW_AT_name("DMACH0DSAU")
    2173                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_DMACH0DSAU")
    2174                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2175                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$268       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2178                      .dwattr $C$DW$268, DW_AT_name("DMACH0TCR1")
    2179                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2180                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2181                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$269       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2184                      .dwattr $C$DW$269, DW_AT_name("DMACH0TCR2")
    2185                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2186                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2187                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$270       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$29)
    2190                      .dwattr $C$DW$270, DW_AT_name("RSVD0")
    2191                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_RSVD0")
    2192                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2193                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$271       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2196                      .dwattr $C$DW$271, DW_AT_name("DMACH1SSAL")
    2197                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2198                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2199                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$272       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2202                      .dwattr $C$DW$272, DW_AT_name("DMACH1SSAU")
    2203                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2204                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2205                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$273       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2208                      .dwattr $C$DW$273, DW_AT_name("DMACH1DSAL")
    2209                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_DMACH1DSAL")
    2210                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2211                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$274       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2214                      .dwattr $C$DW$274, DW_AT_name("DMACH1DSAU")
    2215                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_DMACH1DSAU")
    2216                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2217                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   57

    2218              $C$DW$275       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2220                      .dwattr $C$DW$275, DW_AT_name("DMACH1TCR1")
    2221                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_DMACH1TCR1")
    2222                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2223                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$276       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2226                      .dwattr $C$DW$276, DW_AT_name("DMACH1TCR2")
    2227                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_DMACH1TCR2")
    2228                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2229                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$277       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    2232                      .dwattr $C$DW$277, DW_AT_name("RSVD1")
    2233                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_RSVD1")
    2234                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2235                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$278       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2238                      .dwattr $C$DW$278, DW_AT_name("DMACH2SSAL")
    2239                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2240                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2241                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$279       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2244                      .dwattr $C$DW$279, DW_AT_name("DMACH2SSAU")
    2245                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DMACH2SSAU")
    2246                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2247                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$280       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2250                      .dwattr $C$DW$280, DW_AT_name("DMACH2DSAL")
    2251                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2252                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2253                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$281       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2256                      .dwattr $C$DW$281, DW_AT_name("DMACH2DSAU")
    2257                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2258                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2259                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$282       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2262                      .dwattr $C$DW$282, DW_AT_name("DMACH2TCR1")
    2263                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2264                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2265                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$283       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2268                      .dwattr $C$DW$283, DW_AT_name("DMACH2TCR2")
    2269                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2270                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2271                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$284       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   58

    2273                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    2274                      .dwattr $C$DW$284, DW_AT_name("RSVD2")
    2275                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RSVD2")
    2276                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2277                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$285       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    2280                      .dwattr $C$DW$285, DW_AT_name("DMACH3SSAL")
    2281                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2282                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2283                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2284              $C$DW$286       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2286                      .dwattr $C$DW$286, DW_AT_name("DMACH3SSAU")
    2287                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2288                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2289                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2290              $C$DW$287       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    2292                      .dwattr $C$DW$287, DW_AT_name("DMACH3DSAL")
    2293                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2294                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2295                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$288       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2298                      .dwattr $C$DW$288, DW_AT_name("DMACH3DSAU")
    2299                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2300                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2301                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$289       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2304                      .dwattr $C$DW$289, DW_AT_name("DMACH3TCR1")
    2305                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2306                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2307                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2308              $C$DW$290       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2310                      .dwattr $C$DW$290, DW_AT_name("DMACH3TCR2")
    2311                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2312                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2313                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2314                      .dwendtag $C$DW$T$30
    2315              
    2316              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2317                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2318                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2319              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    2320                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$31)
    2321              $C$DW$292       .dwtag  DW_TAG_TI_ioport_type
    2322                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$291)
    2323              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    2324                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$292)
    2325              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2326                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2327                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   59

    2328              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2329                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2330                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2331              
    2332              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2333                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x09)
    2334              $C$DW$293       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$34)
    2336                      .dwattr $C$DW$293, DW_AT_name("dmaRegs")
    2337                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_dmaRegs")
    2338                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$294       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$36)
    2342                      .dwattr $C$DW$294, DW_AT_name("chanNum")
    2343                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_chanNum")
    2344                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2345                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$295       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$38)
    2348                      .dwattr $C$DW$295, DW_AT_name("dmaInstNum")
    2349                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_dmaInstNum")
    2350                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2351                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$296       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$39)
    2354                      .dwattr $C$DW$296, DW_AT_name("isChanFree")
    2355                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_isChanFree")
    2356                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2357                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$297       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$41)
    2360                      .dwattr $C$DW$297, DW_AT_name("chanDir")
    2361                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_chanDir")
    2362                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2363                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$298       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$43)
    2366                      .dwattr $C$DW$298, DW_AT_name("trigger")
    2367                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_trigger")
    2368                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2369                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$299       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$45)
    2372                      .dwattr $C$DW$299, DW_AT_name("trfType")
    2373                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_trfType")
    2374                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2375                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$300       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$47)
    2378                      .dwattr $C$DW$300, DW_AT_name("dmaInt")
    2379                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_dmaInt")
    2380                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2381                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$301       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   60

    2383                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$39)
    2384                      .dwattr $C$DW$301, DW_AT_name("pingPongEnabled")
    2385                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_pingPongEnabled")
    2386                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2387                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2388                      .dwendtag $C$DW$T$48
    2389              
    2390              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    2391                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$48)
    2392                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2393              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2394                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2395                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    2396              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    2397                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2398                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2399              
    2400              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2401                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x0e)
    2402              $C$DW$302       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$50)
    2404                      .dwattr $C$DW$302, DW_AT_name("pingPongMode")
    2405                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_pingPongMode")
    2406                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2408              $C$DW$303       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$52)
    2410                      .dwattr $C$DW$303, DW_AT_name("autoMode")
    2411                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_autoMode")
    2412                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2413                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$304       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$54)
    2416                      .dwattr $C$DW$304, DW_AT_name("burstLen")
    2417                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_burstLen")
    2418                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2419                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2420              $C$DW$305       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$43)
    2422                      .dwattr $C$DW$305, DW_AT_name("trigger")
    2423                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_trigger")
    2424                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2425                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$306       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$56)
    2428                      .dwattr $C$DW$306, DW_AT_name("dmaEvt")
    2429                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_dmaEvt")
    2430                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2431                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$307       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$47)
    2434                      .dwattr $C$DW$307, DW_AT_name("dmaInt")
    2435                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_dmaInt")
    2436                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2437                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   61

    2438              $C$DW$308       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$41)
    2440                      .dwattr $C$DW$308, DW_AT_name("chanDir")
    2441                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_chanDir")
    2442                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2443                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2444              $C$DW$309       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$45)
    2446                      .dwattr $C$DW$309, DW_AT_name("trfType")
    2447                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_trfType")
    2448                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2449                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2450              $C$DW$310       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$310, DW_AT_name("dataLen")
    2453                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_dataLen")
    2454                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2455                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$311       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    2458                      .dwattr $C$DW$311, DW_AT_name("srcAddr")
    2459                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_srcAddr")
    2460                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2461                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$312       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    2464                      .dwattr $C$DW$312, DW_AT_name("destAddr")
    2465                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_destAddr")
    2466                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2467                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2468                      .dwendtag $C$DW$T$57
    2469              
    2470              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2471                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$57)
    2472                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2473              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2474                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2475                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    2476              
    2477              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    2478                      .dwattr $C$DW$T$69, DW_AT_name("CSL_UartObj")
    2479                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x14)
    2480              $C$DW$313       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    2482                      .dwattr $C$DW$313, DW_AT_name("insId")
    2483                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_insId")
    2484                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2485                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2486              $C$DW$314       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$61)
    2488                      .dwattr $C$DW$314, DW_AT_name("uartRegs")
    2489                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_uartRegs")
    2490                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2491                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2492              $C$DW$315       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   62

    2493                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$65)
    2494                      .dwattr $C$DW$315, DW_AT_name("sysAddr")
    2495                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_sysAddr")
    2496                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2497                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$316       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$67)
    2500                      .dwattr $C$DW$316, DW_AT_name("opmode")
    2501                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_opmode")
    2502                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2503                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$317       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    2506                      .dwattr $C$DW$317, DW_AT_name("trigLevel")
    2507                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_trigLevel")
    2508                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2509                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$318       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$68)
    2512                      .dwattr $C$DW$318, DW_AT_name("UART_isrDispatchTable")
    2513                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
    2514                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2515                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2516                      .dwendtag $C$DW$T$69
    2517              
    2518              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
    2519                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$69)
    2520                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2521              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    2522                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    2523                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    2524              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
    2525                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2526                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2527              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2528                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2529                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2530                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2531              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2532                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2533                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2534                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2535              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2536                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2537                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2538                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2539              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2540                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2541                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2542                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2543              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2544                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2545                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2546                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2547              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:44 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart_dma_example.asm                                             PAGE   63

    2548                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2549                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2550              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2551                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2552                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2553              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2554                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2555                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    2556              $C$DW$319       .dwtag  DW_TAG_TI_far_type
    2557                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$75)
    2558              $C$DW$T$104     .dwtag  DW_TAG_volatile_type
    2559                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$319)
    2560              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2561                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2562                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2563                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2564              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2565                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
