TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE    1

    2264              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:40 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1274              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN3"), DW_AT_const_value(0x03)
    1275              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN4"), DW_AT_const_value(0x04)
    1276              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN5"), DW_AT_const_value(0x05)
    1277              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN6"), DW_AT_const_value(0x06)
    1278              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN7"), DW_AT_const_value(0x07)
    1279              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN8"), DW_AT_const_value(0x08)
    1280              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN9"), DW_AT_const_value(0x09)
    1281              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN10"), DW_AT_const_value(0x0a)
    1282              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN11"), DW_AT_const_value(0x0b)
    1283              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN12"), DW_AT_const_value(0x0c)
    1284              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN13"), DW_AT_const_value(0x0d)
    1285              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN14"), DW_AT_const_value(0x0e)
    1286              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN15"), DW_AT_const_value(0x0f)
    1287              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN16"), DW_AT_const_value(0x10)
    1288              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN17"), DW_AT_const_value(0x11)
    1289              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN18"), DW_AT_const_value(0x12)
    1290              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN19"), DW_AT_const_value(0x13)
    1291              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN20"), DW_AT_const_value(0x14)
    1292              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN21"), DW_AT_const_value(0x15)
    1293              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN22"), DW_AT_const_value(0x16)
    1294              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN23"), DW_AT_const_value(0x17)
    1295              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN24"), DW_AT_const_value(0x18)
    1296              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN25"), DW_AT_const_value(0x19)
    1297              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN26"), DW_AT_const_value(0x1a)
    1298              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN27"), DW_AT_const_value(0x1b)
    1299              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN28"), DW_AT_const_value(0x1c)
    1300              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN29"), DW_AT_const_value(0x1d)
    1301              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN30"), DW_AT_const_value(0x1e)
    1302              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN31"), DW_AT_const_value(0x1f)
    1303                      .dwendtag $C$DW$T$29
    1304              
    1305              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinNum")
    1306                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1307                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1308              
    1309              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1310                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   38

    1311              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_INPUT"), DW_AT_const_value(0x00)
    1312              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_OUTPUT"), DW_AT_const_value(0x01)
    1313                      .dwendtag $C$DW$T$31
    1314              
    1315              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioDirection")
    1316                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1317                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1318              
    1319              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1320                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1321              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_RISING_EDGE"), DW_AT_const_value(0x00)
    1322              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_FALLING_EDGE"), DW_AT_const_value(0x01)
    1323              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_CLEAR_EDGE"), DW_AT_const_value(0x02)
    1324                      .dwendtag $C$DW$T$33
    1325              
    1326              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioTriggerType")
    1327                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1328                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1329              
    1330              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1331                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x12)
    1332              $C$DW$137       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1334                      .dwattr $C$DW$137, DW_AT_name("RSVD0")
    1335                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_RSVD0")
    1336                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$138       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1340                      .dwattr $C$DW$138, DW_AT_name("IODIR1")
    1341                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_IODIR1")
    1342                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1343                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1344              $C$DW$139       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1346                      .dwattr $C$DW$139, DW_AT_name("IODIR2")
    1347                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_IODIR2")
    1348                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1349                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$140       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1352                      .dwattr $C$DW$140, DW_AT_name("IOINDATA1")
    1353                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_IOINDATA1")
    1354                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1355                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$141       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1358                      .dwattr $C$DW$141, DW_AT_name("IOINDATA2")
    1359                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IOINDATA2")
    1360                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1361                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$142       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1364                      .dwattr $C$DW$142, DW_AT_name("IOOUTDATA1")
    1365                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IOOUTDATA1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   39

    1366                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1367                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$143       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1370                      .dwattr $C$DW$143, DW_AT_name("IOOUTDATA2")
    1371                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IOOUTDATA2")
    1372                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1373                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$144       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1376                      .dwattr $C$DW$144, DW_AT_name("IOINTEDG1")
    1377                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_IOINTEDG1")
    1378                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1379                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1380              $C$DW$145       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1382                      .dwattr $C$DW$145, DW_AT_name("IOINTEDG2")
    1383                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_IOINTEDG2")
    1384                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1385                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1386              $C$DW$146       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1388                      .dwattr $C$DW$146, DW_AT_name("IOINTEN1")
    1389                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_IOINTEN1")
    1390                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1391                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$147       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1394                      .dwattr $C$DW$147, DW_AT_name("IOINTEN2")
    1395                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_IOINTEN2")
    1396                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1397                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1398              $C$DW$148       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1400                      .dwattr $C$DW$148, DW_AT_name("IOINTFLG1")
    1401                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_IOINTFLG1")
    1402                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1403                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$149       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1406                      .dwattr $C$DW$149, DW_AT_name("IOINTFLG2")
    1407                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_IOINTFLG2")
    1408                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1409                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1410                      .dwendtag $C$DW$T$22
    1411              
    1412              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    1413                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1414                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1415              $C$DW$150       .dwtag  DW_TAG_TI_far_type
    1416                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
    1417              $C$DW$151       .dwtag  DW_TAG_TI_ioport_type
    1418                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$150)
    1419              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1420                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$151)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   40

    1421              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1422                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1423                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    1424              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    1425                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1426                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1427              
    1428              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1429                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1430              $C$DW$152       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$26)
    1432                      .dwattr $C$DW$152, DW_AT_name("baseAddr")
    1433                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_baseAddr")
    1434                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$153       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    1438                      .dwattr $C$DW$153, DW_AT_name("numPins")
    1439                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_numPins")
    1440                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1441                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1442                      .dwendtag $C$DW$T$28
    1443              
    1444              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioObj")
    1445                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
    1446                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1447              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    1448                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1449                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    1450              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1451                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1452                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1453              
    1454              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1455                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x03)
    1456              $C$DW$154       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$30)
    1458                      .dwattr $C$DW$154, DW_AT_name("pinNum")
    1459                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_pinNum")
    1460                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$155       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
    1464                      .dwattr $C$DW$155, DW_AT_name("direction")
    1465                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_direction")
    1466                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1467                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$156       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$34)
    1470                      .dwattr $C$DW$156, DW_AT_name("trigger")
    1471                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_trigger")
    1472                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1473                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1474                      .dwendtag $C$DW$T$35
    1475              
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   41

    1476              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinConfig")
    1477                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$35)
    1478                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1479              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    1480                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1481                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    1482              
    1483              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1484                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x48)
    1485              $C$DW$157       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1487                      .dwattr $C$DW$157, DW_AT_name("EBSR")
    1488                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_EBSR")
    1489                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$158       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1493                      .dwattr $C$DW$158, DW_AT_name("RSVD0")
    1494                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_RSVD0")
    1495                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1496                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$159       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1499                      .dwattr $C$DW$159, DW_AT_name("PCGCR1")
    1500                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCGCR1")
    1501                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1502                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$160       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1505                      .dwattr $C$DW$160, DW_AT_name("PCGCR2")
    1506                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCGCR2")
    1507                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1508                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$161       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1511                      .dwattr $C$DW$161, DW_AT_name("PSRCR")
    1512                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PSRCR")
    1513                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1514                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$162       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1517                      .dwattr $C$DW$162, DW_AT_name("PRCR")
    1518                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PRCR")
    1519                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1520                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$163       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$36)
    1523                      .dwattr $C$DW$163, DW_AT_name("RSVD1")
    1524                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RSVD1")
    1525                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1526                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$164       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    1529                      .dwattr $C$DW$164, DW_AT_name("TIAFR")
    1530                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_TIAFR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   42

    1531                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1532                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$165       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1535                      .dwattr $C$DW$165, DW_AT_name("RSVD2")
    1536                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD2")
    1537                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1538                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$166       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1541                      .dwattr $C$DW$166, DW_AT_name("ODSCR")
    1542                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ODSCR")
    1543                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1544                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$167       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1547                      .dwattr $C$DW$167, DW_AT_name("PDINHIBR1")
    1548                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PDINHIBR1")
    1549                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1550                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1551              $C$DW$168       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1553                      .dwattr $C$DW$168, DW_AT_name("PDINHIBR2")
    1554                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PDINHIBR2")
    1555                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1556                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$169       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1559                      .dwattr $C$DW$169, DW_AT_name("PDINHIBR3")
    1560                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PDINHIBR3")
    1561                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1562                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$170       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1565                      .dwattr $C$DW$170, DW_AT_name("DMA0CESR1")
    1566                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DMA0CESR1")
    1567                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1568                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$171       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1571                      .dwattr $C$DW$171, DW_AT_name("DMA0CESR2")
    1572                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_DMA0CESR2")
    1573                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1574                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1575              $C$DW$172       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1577                      .dwattr $C$DW$172, DW_AT_name("DMA1CESR1")
    1578                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DMA1CESR1")
    1579                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1580                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$173       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1583                      .dwattr $C$DW$173, DW_AT_name("DMA1CESR2")
    1584                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DMA1CESR2")
    1585                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   43

    1586                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$174       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1589                      .dwattr $C$DW$174, DW_AT_name("SDRAMCCR")
    1590                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SDRAMCCR")
    1591                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1592                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1593              $C$DW$175       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1595                      .dwattr $C$DW$175, DW_AT_name("CCR2")
    1596                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_CCR2")
    1597                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1598                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$176       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1601                      .dwattr $C$DW$176, DW_AT_name("CGCR1")
    1602                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_CGCR1")
    1603                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1604                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$177       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1607                      .dwattr $C$DW$177, DW_AT_name("CGICR")
    1608                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_CGICR")
    1609                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1610                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$178       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1613                      .dwattr $C$DW$178, DW_AT_name("CGCR2")
    1614                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_CGCR2")
    1615                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1616                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1617              $C$DW$179       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1619                      .dwattr $C$DW$179, DW_AT_name("CGOCR")
    1620                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_CGOCR")
    1621                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1622                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$180       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1625                      .dwattr $C$DW$180, DW_AT_name("CCSSR")
    1626                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CCSSR")
    1627                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1628                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$181       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1631                      .dwattr $C$DW$181, DW_AT_name("RSVD3")
    1632                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RSVD3")
    1633                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1634                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$182       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1637                      .dwattr $C$DW$182, DW_AT_name("ECDR")
    1638                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ECDR")
    1639                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1640                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   44

    1641              $C$DW$183       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1643                      .dwattr $C$DW$183, DW_AT_name("RSVD4")
    1644                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RSVD4")
    1645                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1646                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$184       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1649                      .dwattr $C$DW$184, DW_AT_name("RAMSLPMDCNTLR1")
    1650                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1651                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1652                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$185       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1655                      .dwattr $C$DW$185, DW_AT_name("RSVD5")
    1656                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_RSVD5")
    1657                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1658                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$186       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1661                      .dwattr $C$DW$186, DW_AT_name("RAMSLPMDCNTLR2")
    1662                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1663                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1664                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$187       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    1667                      .dwattr $C$DW$187, DW_AT_name("RAMSLPMDCNTLR3")
    1668                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1669                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1670                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$188       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1673                      .dwattr $C$DW$188, DW_AT_name("RAMSLPMDCNTLR4")
    1674                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1675                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1676                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$189       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1679                      .dwattr $C$DW$189, DW_AT_name("RAMSLPMDCNTLR5")
    1680                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1681                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1682                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$190       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$37)
    1685                      .dwattr $C$DW$190, DW_AT_name("RSVD6")
    1686                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_RSVD6")
    1687                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1688                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$191       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1691                      .dwattr $C$DW$191, DW_AT_name("DMAIFR")
    1692                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DMAIFR")
    1693                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1694                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$192       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   45

    1696                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1697                      .dwattr $C$DW$192, DW_AT_name("DMAIER")
    1698                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DMAIER")
    1699                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1700                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$193       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1703                      .dwattr $C$DW$193, DW_AT_name("USBSCR")
    1704                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_USBSCR")
    1705                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1706                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$194       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    1709                      .dwattr $C$DW$194, DW_AT_name("ESCR")
    1710                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ESCR")
    1711                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1712                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$195       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$37)
    1715                      .dwattr $C$DW$195, DW_AT_name("RSVD7")
    1716                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD7")
    1717                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1718                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$196       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1721                      .dwattr $C$DW$196, DW_AT_name("DMA2CESR1")
    1722                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DMA2CESR1")
    1723                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1724                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$197       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    1727                      .dwattr $C$DW$197, DW_AT_name("DMA2CESR2")
    1728                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_DMA2CESR2")
    1729                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1730                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$198       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    1733                      .dwattr $C$DW$198, DW_AT_name("DMA3CESR1")
    1734                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DMA3CESR1")
    1735                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1736                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$199       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1739                      .dwattr $C$DW$199, DW_AT_name("DMA3CESR2")
    1740                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DMA3CESR2")
    1741                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1742                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$200       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    1745                      .dwattr $C$DW$200, DW_AT_name("CLKSTOP")
    1746                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CLKSTOP")
    1747                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1748                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$201       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   46

    1751                      .dwattr $C$DW$201, DW_AT_name("RSVD8")
    1752                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD8")
    1753                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1754                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$202       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1757                      .dwattr $C$DW$202, DW_AT_name("DIEIDR0")
    1758                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DIEIDR0")
    1759                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1760                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$203       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    1763                      .dwattr $C$DW$203, DW_AT_name("DIEIDR1")
    1764                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_DIEIDR1")
    1765                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1766                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$204       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    1769                      .dwattr $C$DW$204, DW_AT_name("DIEIDR2")
    1770                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_DIEIDR2")
    1771                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1772                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$205       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$205, DW_AT_name("DIEIDR3")
    1776                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_DIEIDR3")
    1777                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1778                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$206       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    1781                      .dwattr $C$DW$206, DW_AT_name("DIEIDR4")
    1782                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DIEIDR4")
    1783                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1784                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$207       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    1787                      .dwattr $C$DW$207, DW_AT_name("DIEIDR5")
    1788                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DIEIDR5")
    1789                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1790                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$208       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$208, DW_AT_name("DIEIDR6")
    1794                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DIEIDR6")
    1795                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1796                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$209       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    1799                      .dwattr $C$DW$209, DW_AT_name("DIEIDR7")
    1800                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DIEIDR7")
    1801                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1802                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1803                      .dwendtag $C$DW$T$39
    1804              
    1805              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
gpio_Input_Pin_Example.asm                                           PAGE   47

    1806                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    1807                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1808              $C$DW$210       .dwtag  DW_TAG_TI_far_type
    1809                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$50)
    1810              $C$DW$211       .dwtag  DW_TAG_TI_ioport_type
    1811                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$210)
    1812              $C$DW$T$51      .dwtag  DW_TAG_volatile_type
    1813                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$211)
    1814              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1815                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1816                      .dwattr $C$DW$T$52, DW_AT_address_class(0x10)
    1817              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1818                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1819                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1820              
    1821              $C$DW$T$54      .dwtag  DW_TAG_subroutine_type
    1822                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1823              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1824                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1825                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    1826              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    1827                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1828                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1829              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1830                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1831                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1832                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1833              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1834                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1835                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1836                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1837              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1838                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1839                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1840                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1841              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    1842                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    1843                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1844              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1845                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1846                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1847                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1848              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1849                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1850                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1851                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1852              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1853                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
