TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE    1

    3139              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:09:22 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1705              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1706                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1707              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1708              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   46

    1709              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1710              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1711              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1712                      .dwendtag $C$DW$T$32
    1713              
    1714              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1715                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1716                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1717              
    1718              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1719                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1720              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1721              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1722                      .dwendtag $C$DW$T$38
    1723              
    1724              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1725                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1726                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1727              
    1728              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1729                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1730              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1731              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1732              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1733              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1734              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1735                      .dwendtag $C$DW$T$41
    1736              
    1737              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1738                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1739                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1740              
    1741              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1742                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1743              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1744              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1745                      .dwendtag $C$DW$T$43
    1746              
    1747              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1748                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1749                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1750              
    1751              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1752                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1753              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1754              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1755                      .dwendtag $C$DW$T$45
    1756              
    1757              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1758                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1759                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1760              
    1761              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1762                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1763              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   47

    1764              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1765                      .dwendtag $C$DW$T$47
    1766              
    1767              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1768                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1769                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1770              
    1771              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1772                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1773              $C$DW$167       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$167, DW_AT_name("LCDREVMIN")
    1776                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LCDREVMIN")
    1777                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$168       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1781                      .dwattr $C$DW$168, DW_AT_name("LCDREVMAJ")
    1782                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1783                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1784                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$169       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1787                      .dwattr $C$DW$169, DW_AT_name("RSVD0")
    1788                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RSVD0")
    1789                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1790                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$170       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$170, DW_AT_name("LCDCR")
    1794                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LCDCR")
    1795                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1796                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$171       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1799                      .dwattr $C$DW$171, DW_AT_name("RSVD1")
    1800                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD1")
    1801                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1802                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$172       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1805                      .dwattr $C$DW$172, DW_AT_name("LCDSR")
    1806                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LCDSR")
    1807                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1808                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$173       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    1811                      .dwattr $C$DW$173, DW_AT_name("RSVD2")
    1812                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD2")
    1813                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1814                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$174       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$174, DW_AT_name("LCDLIDDCR")
    1818                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_LCDLIDDCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   48

    1819                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1820                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$175       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1823                      .dwattr $C$DW$175, DW_AT_name("RSVD3")
    1824                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD3")
    1825                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1826                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$176       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1829                      .dwattr $C$DW$176, DW_AT_name("LCDLIDDCS0CONFIG0")
    1830                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1831                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1832                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$177       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1835                      .dwattr $C$DW$177, DW_AT_name("LCDLIDDCS0CONFIG1")
    1836                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1837                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1838                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$178       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1841                      .dwattr $C$DW$178, DW_AT_name("RSVD4")
    1842                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD4")
    1843                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1844                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$179       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1847                      .dwattr $C$DW$179, DW_AT_name("LCDLIDDCS0ADDR")
    1848                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1849                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1850                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$180       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    1853                      .dwattr $C$DW$180, DW_AT_name("RSVD5")
    1854                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD5")
    1855                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1856                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$181       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    1859                      .dwattr $C$DW$181, DW_AT_name("LCDLIDDCS0DATA")
    1860                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1861                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1862                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$182       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    1865                      .dwattr $C$DW$182, DW_AT_name("RSVD6")
    1866                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD6")
    1867                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1868                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$183       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1871                      .dwattr $C$DW$183, DW_AT_name("LCDLIDDCS1CONFIG0")
    1872                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1873                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   49

    1874                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$184       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1877                      .dwattr $C$DW$184, DW_AT_name("LCDLIDDCS1CONFIG1")
    1878                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    1879                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1880                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$185       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    1883                      .dwattr $C$DW$185, DW_AT_name("RSVD7")
    1884                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_RSVD7")
    1885                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1886                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$186       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    1889                      .dwattr $C$DW$186, DW_AT_name("LCDLIDDCS1ADDR")
    1890                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1891                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1892                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$187       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    1895                      .dwattr $C$DW$187, DW_AT_name("RSVD8")
    1896                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_RSVD8")
    1897                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1898                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$188       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    1901                      .dwattr $C$DW$188, DW_AT_name("LCDLIDDCS1DATA")
    1902                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1903                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1904                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$189       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    1907                      .dwattr $C$DW$189, DW_AT_name("RSVD9")
    1908                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RSVD9")
    1909                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1910                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$190       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1913                      .dwattr $C$DW$190, DW_AT_name("LCDDMACR")
    1914                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_LCDDMACR")
    1915                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1916                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$191       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    1919                      .dwattr $C$DW$191, DW_AT_name("RSVD10")
    1920                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD10")
    1921                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1922                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$192       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1925                      .dwattr $C$DW$192, DW_AT_name("LCDDMAFB0BAR0")
    1926                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1927                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1928                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   50

    1929              $C$DW$193       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1931                      .dwattr $C$DW$193, DW_AT_name("LCDDMAFB0BAR1")
    1932                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1933                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1934                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$194       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    1937                      .dwattr $C$DW$194, DW_AT_name("RSVD11")
    1938                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD11")
    1939                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1940                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$195       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    1943                      .dwattr $C$DW$195, DW_AT_name("LCDDMAFB0CAR0")
    1944                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1945                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1946                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$196       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1949                      .dwattr $C$DW$196, DW_AT_name("LCDDMAFB0CAR1")
    1950                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1951                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1952                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$197       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    1955                      .dwattr $C$DW$197, DW_AT_name("RSVD12")
    1956                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RSVD12")
    1957                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1958                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$198       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    1961                      .dwattr $C$DW$198, DW_AT_name("LCDDMAFB1BAR0")
    1962                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    1963                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1964                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$199       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    1967                      .dwattr $C$DW$199, DW_AT_name("LCDDMAFB1BAR1")
    1968                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1969                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1970                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$200       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    1973                      .dwattr $C$DW$200, DW_AT_name("RSVD13")
    1974                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD13")
    1975                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1976                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$201       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1979                      .dwattr $C$DW$201, DW_AT_name("LCDDMAFB1CAR0")
    1980                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1981                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1982                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$202       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   51

    1984                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1985                      .dwattr $C$DW$202, DW_AT_name("LCDDMAFB1CAR1")
    1986                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1987                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1988                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1989                      .dwendtag $C$DW$T$24
    1990              
    1991              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1992                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$24)
    1993                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1994              $C$DW$203       .dwtag  DW_TAG_TI_far_type
    1995                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$56)
    1996              $C$DW$204       .dwtag  DW_TAG_TI_ioport_type
    1997                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$203)
    1998              $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1999                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$204)
    2000              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2001                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2002                      .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    2003              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    2004                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2005                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2006              
    2007              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2008                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2009              $C$DW$205       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2011                      .dwattr $C$DW$205, DW_AT_name("clkDiv")
    2012                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_clkDiv")
    2013                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$206       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$26)
    2017                      .dwattr $C$DW$206, DW_AT_name("fdoneIntEn")
    2018                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_fdoneIntEn")
    2019                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2020                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$207       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$28)
    2023                      .dwattr $C$DW$207, DW_AT_name("dmaCs0Cs1")
    2024                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    2025                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2026                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$208       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$30)
    2029                      .dwattr $C$DW$208, DW_AT_name("dmaEnable")
    2030                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_dmaEnable")
    2031                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2032                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$209       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    2035                      .dwattr $C$DW$209, DW_AT_name("polControl")
    2036                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_polControl")
    2037                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2038                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   52

    2039              $C$DW$210       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$33)
    2041                      .dwattr $C$DW$210, DW_AT_name("modeSel")
    2042                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_modeSel")
    2043                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2044                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2045                      .dwendtag $C$DW$T$34
    2046              
    2047              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    2048                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    2049                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2050              
    2051              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2052                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    2053              $C$DW$211       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2055                      .dwattr $C$DW$211, DW_AT_name("wSu")
    2056                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_wSu")
    2057                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$212       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$212, DW_AT_name("wStrobe")
    2062                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_wStrobe")
    2063                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2064                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$213       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2067                      .dwattr $C$DW$213, DW_AT_name("wHold")
    2068                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_wHold")
    2069                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2070                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$214       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2073                      .dwattr $C$DW$214, DW_AT_name("rSu")
    2074                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rSu")
    2075                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2076                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$215       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$215, DW_AT_name("rStrobe")
    2080                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rStrobe")
    2081                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2082                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$216       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$216, DW_AT_name("rHold")
    2086                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rHold")
    2087                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2088                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$217       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$217, DW_AT_name("ta")
    2092                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ta")
    2093                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   53

    2094                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2095                      .dwendtag $C$DW$T$35
    2096              
    2097              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    2098                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    2099                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2100              
    2101              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2102                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    2103              $C$DW$218       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$3)
    2105                      .dwattr $C$DW$218, DW_AT_name("extendSetup")
    2106                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_extendSetup")
    2107                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2109              $C$DW$219       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$36)
    2111                      .dwattr $C$DW$219, DW_AT_name("config")
    2112                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_config")
    2113                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2114                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$220       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$37)
    2117                      .dwattr $C$DW$220, DW_AT_name("timingCs0")
    2118                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_timingCs0")
    2119                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2120                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$221       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$39)
    2123                      .dwattr $C$DW$221, DW_AT_name("useCs1")
    2124                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_useCs1")
    2125                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2126                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$222       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$37)
    2129                      .dwattr $C$DW$222, DW_AT_name("timingCs1")
    2130                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_timingCs1")
    2131                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2132                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2133                      .dwendtag $C$DW$T$40
    2134              
    2135              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    2136                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$40)
    2137                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2138              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2139                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2140                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    2141              
    2142              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2143                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2144              $C$DW$223       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$42)
    2146                      .dwattr $C$DW$223, DW_AT_name("burstSize")
    2147                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_burstSize")
    2148                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   54

    2149                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$224       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$44)
    2152                      .dwattr $C$DW$224, DW_AT_name("eofIntEn")
    2153                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_eofIntEn")
    2154                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2155                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$225       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$46)
    2158                      .dwattr $C$DW$225, DW_AT_name("bigEndian")
    2159                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_bigEndian")
    2160                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2161                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2162              $C$DW$226       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$48)
    2164                      .dwattr $C$DW$226, DW_AT_name("frameMode")
    2165                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_frameMode")
    2166                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2167                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$227       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$49)
    2170                      .dwattr $C$DW$227, DW_AT_name("fb0Base")
    2171                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_fb0Base")
    2172                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2173                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$228       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$49)
    2176                      .dwattr $C$DW$228, DW_AT_name("fb0Ceil")
    2177                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_fb0Ceil")
    2178                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2179                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$229       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$49)
    2182                      .dwattr $C$DW$229, DW_AT_name("fb1Base")
    2183                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_fb1Base")
    2184                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2185                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$230       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$49)
    2188                      .dwattr $C$DW$230, DW_AT_name("fb1Ceil")
    2189                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_fb1Ceil")
    2190                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2191                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2192                      .dwendtag $C$DW$T$50
    2193              
    2194              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    2195                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$50)
    2196                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2197              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2198                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2199                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    2200              
    2201              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2202                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    2203              $C$DW$231       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   55

    2204                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2205                      .dwattr $C$DW$231, DW_AT_name("EBSR")
    2206                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_EBSR")
    2207                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$232       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2211                      .dwattr $C$DW$232, DW_AT_name("RSVD0")
    2212                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RSVD0")
    2213                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2214                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$233       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2217                      .dwattr $C$DW$233, DW_AT_name("PCGCR1")
    2218                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_PCGCR1")
    2219                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2220                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$234       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2223                      .dwattr $C$DW$234, DW_AT_name("PCGCR2")
    2224                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_PCGCR2")
    2225                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2226                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$235       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2229                      .dwattr $C$DW$235, DW_AT_name("PSRCR")
    2230                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_PSRCR")
    2231                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2232                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2233              $C$DW$236       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2235                      .dwattr $C$DW$236, DW_AT_name("PRCR")
    2236                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_PRCR")
    2237                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2238                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2239              $C$DW$237       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$51)
    2241                      .dwattr $C$DW$237, DW_AT_name("RSVD1")
    2242                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_RSVD1")
    2243                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2244                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2245              $C$DW$238       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2247                      .dwattr $C$DW$238, DW_AT_name("TIAFR")
    2248                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_TIAFR")
    2249                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2250                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2251              $C$DW$239       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2253                      .dwattr $C$DW$239, DW_AT_name("RSVD2")
    2254                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_RSVD2")
    2255                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2256                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2257              $C$DW$240       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   56

    2259                      .dwattr $C$DW$240, DW_AT_name("ODSCR")
    2260                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_ODSCR")
    2261                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2262                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$241       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2265                      .dwattr $C$DW$241, DW_AT_name("PDINHIBR1")
    2266                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PDINHIBR1")
    2267                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2268                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2269              $C$DW$242       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2271                      .dwattr $C$DW$242, DW_AT_name("PDINHIBR2")
    2272                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PDINHIBR2")
    2273                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2274                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2275              $C$DW$243       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2277                      .dwattr $C$DW$243, DW_AT_name("PDINHIBR3")
    2278                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PDINHIBR3")
    2279                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2280                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2281              $C$DW$244       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2283                      .dwattr $C$DW$244, DW_AT_name("DMA0CESR1")
    2284                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DMA0CESR1")
    2285                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2286                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2287              $C$DW$245       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2289                      .dwattr $C$DW$245, DW_AT_name("DMA0CESR2")
    2290                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DMA0CESR2")
    2291                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2292                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2293              $C$DW$246       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2295                      .dwattr $C$DW$246, DW_AT_name("DMA1CESR1")
    2296                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DMA1CESR1")
    2297                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2298                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2299              $C$DW$247       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2301                      .dwattr $C$DW$247, DW_AT_name("DMA1CESR2")
    2302                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DMA1CESR2")
    2303                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2304                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2305              $C$DW$248       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2307                      .dwattr $C$DW$248, DW_AT_name("SDRAMCCR")
    2308                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_SDRAMCCR")
    2309                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2310                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2311              $C$DW$249       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2313                      .dwattr $C$DW$249, DW_AT_name("CCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   57

    2314                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_CCR2")
    2315                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2316                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$250       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2319                      .dwattr $C$DW$250, DW_AT_name("CGCR1")
    2320                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_CGCR1")
    2321                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2322                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2323              $C$DW$251       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2325                      .dwattr $C$DW$251, DW_AT_name("CGICR")
    2326                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_CGICR")
    2327                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2328                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$252       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2331                      .dwattr $C$DW$252, DW_AT_name("CGCR2")
    2332                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_CGCR2")
    2333                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2334                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$253       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2337                      .dwattr $C$DW$253, DW_AT_name("CGOCR")
    2338                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_CGOCR")
    2339                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2340                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$254       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2343                      .dwattr $C$DW$254, DW_AT_name("CCSSR")
    2344                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_CCSSR")
    2345                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2346                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2347              $C$DW$255       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2349                      .dwattr $C$DW$255, DW_AT_name("RSVD3")
    2350                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RSVD3")
    2351                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2352                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2353              $C$DW$256       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2355                      .dwattr $C$DW$256, DW_AT_name("ECDR")
    2356                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_ECDR")
    2357                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2358                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$257       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2361                      .dwattr $C$DW$257, DW_AT_name("RSVD4")
    2362                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_RSVD4")
    2363                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2364                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2365              $C$DW$258       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2367                      .dwattr $C$DW$258, DW_AT_name("RAMSLPMDCNTLR1")
    2368                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   58

    2369                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2370                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2371              $C$DW$259       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2373                      .dwattr $C$DW$259, DW_AT_name("RSVD5")
    2374                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RSVD5")
    2375                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2376                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2377              $C$DW$260       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2379                      .dwattr $C$DW$260, DW_AT_name("RAMSLPMDCNTLR2")
    2380                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2381                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2382                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2383              $C$DW$261       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2385                      .dwattr $C$DW$261, DW_AT_name("RAMSLPMDCNTLR3")
    2386                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2387                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2388                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2389              $C$DW$262       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2391                      .dwattr $C$DW$262, DW_AT_name("RAMSLPMDCNTLR4")
    2392                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2393                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2394                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$263       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2397                      .dwattr $C$DW$263, DW_AT_name("RAMSLPMDCNTLR5")
    2398                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2399                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2400                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2401              $C$DW$264       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    2403                      .dwattr $C$DW$264, DW_AT_name("RSVD6")
    2404                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_RSVD6")
    2405                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2406                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2407              $C$DW$265       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2409                      .dwattr $C$DW$265, DW_AT_name("DMAIFR")
    2410                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_DMAIFR")
    2411                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2412                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2413              $C$DW$266       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2415                      .dwattr $C$DW$266, DW_AT_name("DMAIER")
    2416                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_DMAIER")
    2417                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2418                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2419              $C$DW$267       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2421                      .dwattr $C$DW$267, DW_AT_name("USBSCR")
    2422                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_USBSCR")
    2423                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   59

    2424                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2425              $C$DW$268       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2427                      .dwattr $C$DW$268, DW_AT_name("ESCR")
    2428                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_ESCR")
    2429                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2430                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2431              $C$DW$269       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    2433                      .dwattr $C$DW$269, DW_AT_name("RSVD7")
    2434                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_RSVD7")
    2435                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2436                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2437              $C$DW$270       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    2439                      .dwattr $C$DW$270, DW_AT_name("DMA2CESR1")
    2440                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_DMA2CESR1")
    2441                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2442                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2443              $C$DW$271       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2445                      .dwattr $C$DW$271, DW_AT_name("DMA2CESR2")
    2446                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_DMA2CESR2")
    2447                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2448                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2449              $C$DW$272       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2451                      .dwattr $C$DW$272, DW_AT_name("DMA3CESR1")
    2452                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_DMA3CESR1")
    2453                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2454                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2455              $C$DW$273       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2457                      .dwattr $C$DW$273, DW_AT_name("DMA3CESR2")
    2458                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_DMA3CESR2")
    2459                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2460                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2461              $C$DW$274       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2463                      .dwattr $C$DW$274, DW_AT_name("CLKSTOP")
    2464                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_CLKSTOP")
    2465                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2466                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2467              $C$DW$275       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$52)
    2469                      .dwattr $C$DW$275, DW_AT_name("RSVD8")
    2470                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_RSVD8")
    2471                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2472                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2473              $C$DW$276       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2475                      .dwattr $C$DW$276, DW_AT_name("DIEIDR0")
    2476                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_DIEIDR0")
    2477                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2478                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   60

    2479              $C$DW$277       .dwtag  DW_TAG_member
    2480                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2481                      .dwattr $C$DW$277, DW_AT_name("DIEIDR1")
    2482                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_DIEIDR1")
    2483                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2484                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2485              $C$DW$278       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2487                      .dwattr $C$DW$278, DW_AT_name("DIEIDR2")
    2488                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_DIEIDR2")
    2489                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2490                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2491              $C$DW$279       .dwtag  DW_TAG_member
    2492                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2493                      .dwattr $C$DW$279, DW_AT_name("DIEIDR3")
    2494                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DIEIDR3")
    2495                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2496                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2497              $C$DW$280       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2499                      .dwattr $C$DW$280, DW_AT_name("DIEIDR4")
    2500                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_DIEIDR4")
    2501                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2502                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2503              $C$DW$281       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2505                      .dwattr $C$DW$281, DW_AT_name("DIEIDR5")
    2506                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DIEIDR5")
    2507                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2508                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2509              $C$DW$282       .dwtag  DW_TAG_member
    2510                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2511                      .dwattr $C$DW$282, DW_AT_name("DIEIDR6")
    2512                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_DIEIDR6")
    2513                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2514                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2515              $C$DW$283       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2517                      .dwattr $C$DW$283, DW_AT_name("DIEIDR7")
    2518                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_DIEIDR7")
    2519                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2520                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2521                      .dwendtag $C$DW$T$53
    2522              
    2523              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2524                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$53)
    2525                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2526              $C$DW$284       .dwtag  DW_TAG_TI_far_type
    2527                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$67)
    2528              $C$DW$285       .dwtag  DW_TAG_TI_ioport_type
    2529                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$284)
    2530              $C$DW$T$68      .dwtag  DW_TAG_volatile_type
    2531                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$285)
    2532              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2533                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   61

    2534                      .dwattr $C$DW$T$69, DW_AT_address_class(0x10)
    2535              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2536                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2537                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2538              
    2539              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2540                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
    2541              $C$DW$286       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$54)
    2543                      .dwattr $C$DW$286, DW_AT_name("RSVD0")
    2544                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_RSVD0")
    2545                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$287       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    2549                      .dwattr $C$DW$287, DW_AT_name("IODIR1")
    2550                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_IODIR1")
    2551                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2552                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$288       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    2555                      .dwattr $C$DW$288, DW_AT_name("IODIR2")
    2556                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_IODIR2")
    2557                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2558                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$289       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    2561                      .dwattr $C$DW$289, DW_AT_name("IOINDATA1")
    2562                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_IOINDATA1")
    2563                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2564                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$290       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    2567                      .dwattr $C$DW$290, DW_AT_name("IOINDATA2")
    2568                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_IOINDATA2")
    2569                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2570                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$291       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    2573                      .dwattr $C$DW$291, DW_AT_name("IOOUTDATA1")
    2574                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_IOOUTDATA1")
    2575                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2576                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2577              $C$DW$292       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    2579                      .dwattr $C$DW$292, DW_AT_name("IOOUTDATA2")
    2580                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_IOOUTDATA2")
    2581                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2582                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$293       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    2585                      .dwattr $C$DW$293, DW_AT_name("IOINTEDG1")
    2586                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_IOINTEDG1")
    2587                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2588                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   62

    2589              $C$DW$294       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2591                      .dwattr $C$DW$294, DW_AT_name("IOINTEDG2")
    2592                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_IOINTEDG2")
    2593                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2594                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$295       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    2597                      .dwattr $C$DW$295, DW_AT_name("IOINTEN1")
    2598                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_IOINTEN1")
    2599                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2600                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$296       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    2603                      .dwattr $C$DW$296, DW_AT_name("IOINTEN2")
    2604                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_IOINTEN2")
    2605                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2606                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2607              $C$DW$297       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2609                      .dwattr $C$DW$297, DW_AT_name("IOINTFLG1")
    2610                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_IOINTFLG1")
    2611                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2612                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$298       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    2615                      .dwattr $C$DW$298, DW_AT_name("IOINTFLG2")
    2616                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_IOINTFLG2")
    2617                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2618                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2619                      .dwendtag $C$DW$T$55
    2620              
    2621              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    2622                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$55)
    2623                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2624              $C$DW$299       .dwtag  DW_TAG_TI_far_type
    2625                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$71)
    2626              $C$DW$300       .dwtag  DW_TAG_TI_ioport_type
    2627                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$299)
    2628              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2629                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$300)
    2630              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2631                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2632                      .dwattr $C$DW$T$73, DW_AT_address_class(0x10)
    2633              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    2634                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2635                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2636              
    2637              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2638                      .dwattr $C$DW$T$62, DW_AT_name("CSL_LcdcObj")
    2639                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2640              $C$DW$301       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$59)
    2642                      .dwattr $C$DW$301, DW_AT_name("regs")
    2643                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_regs")
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   63

    2644                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$302       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$61)
    2648                      .dwattr $C$DW$302, DW_AT_name("perNum")
    2649                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_perNum")
    2650                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2651                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2652                      .dwendtag $C$DW$T$62
    2653              
    2654              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2655                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$62)
    2656                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2657              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2658                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2659                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    2660              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2661                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2662                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2663              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2664                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2665              
    2666              $C$DW$T$92      .dwtag  DW_TAG_subroutine_type
    2667                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2668              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    2669                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2670                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    2671              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2672                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2673                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2674              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2675                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2676                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2677                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2678              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2679                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2680                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2681                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2682              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2683                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2684                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2685                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2686              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2687                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2688                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2689                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2690              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2691                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2692                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2693                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2694              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2695                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2696                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2697              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2698                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:09:23 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc_65kColorModeExample.asm                                     PAGE   64

    2699                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2700              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2701                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$60)
