TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE    1

    2142              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 29 23:08:46 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   49

    1474                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1475              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    1476              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    1477              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    1478              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    1479              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    1480              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    1481              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    1482                      .dwendtag $C$DW$T$37
    1483              
    1484              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    1485                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1486                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1487              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1488                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1489                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    1490              
    1491              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    1492                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1493              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
    1494              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    1495                      .dwendtag $C$DW$T$40
    1496              
    1497              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    1498                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1499                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1500              
    1501              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    1502                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1503              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    1504              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    1505              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    1506              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    1507              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    1508              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    1509              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    1510                      .dwendtag $C$DW$T$42
    1511              
    1512              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    1513                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1514                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1515              
    1516              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    1517                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1518              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_0"), DW_AT_const_value(0x00)
    1519              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_1"), DW_AT_const_value(0x01)
    1520              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_2"), DW_AT_const_value(0x02)
    1521              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_3"), DW_AT_const_value(0x03)
    1522                      .dwendtag $C$DW$T$44
    1523              
    1524              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarGPOPinSel")
    1525                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1526                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1527              
    1528              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   50

    1529                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1530              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_IN"), DW_AT_const_value(0x00)
    1531              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_OUT"), DW_AT_const_value(0x01)
    1532                      .dwendtag $C$DW$T$46
    1533              
    1534              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarGPODir")
    1535                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1536                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1537              
    1538              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1539                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    1540              $C$DW$165       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1542                      .dwattr $C$DW$165, DW_AT_name("RSVD0")
    1543                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD0")
    1544                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$166       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1548                      .dwattr $C$DW$166, DW_AT_name("USBLDOCNTL")
    1549                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_USBLDOCNTL")
    1550                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1551                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$167       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    1554                      .dwattr $C$DW$167, DW_AT_name("RSVD1")
    1555                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_RSVD1")
    1556                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1557                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$168       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1560                      .dwattr $C$DW$168, DW_AT_name("SARCTRL")
    1561                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_SARCTRL")
    1562                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1563                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$169       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1566                      .dwattr $C$DW$169, DW_AT_name("RSVD2")
    1567                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RSVD2")
    1568                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1569                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$170       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1572                      .dwattr $C$DW$170, DW_AT_name("SARDATA")
    1573                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SARDATA")
    1574                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1575                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$171       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1578                      .dwattr $C$DW$171, DW_AT_name("RSVD3")
    1579                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD3")
    1580                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1581                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$172       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   51

    1584                      .dwattr $C$DW$172, DW_AT_name("SARCLKCTRL")
    1585                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SARCLKCTRL")
    1586                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1587                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$173       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1590                      .dwattr $C$DW$173, DW_AT_name("RSVD4")
    1591                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD4")
    1592                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1593                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$174       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1596                      .dwattr $C$DW$174, DW_AT_name("SARPINCTRL")
    1597                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SARPINCTRL")
    1598                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1599                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$175       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1602                      .dwattr $C$DW$175, DW_AT_name("RSVD5")
    1603                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD5")
    1604                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1605                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$176       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1608                      .dwattr $C$DW$176, DW_AT_name("SARGPOCTRL")
    1609                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SARGPOCTRL")
    1610                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1611                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1612                      .dwendtag $C$DW$T$23
    1613              
    1614              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    1615                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1616                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1617              $C$DW$177       .dwtag  DW_TAG_TI_far_type
    1618                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$24)
    1619              $C$DW$178       .dwtag  DW_TAG_TI_ioport_type
    1620                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$177)
    1621              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1622                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$178)
    1623              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1624                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1625                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1626              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    1627                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1628                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1629              
    1630              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1631                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    1632              $C$DW$179       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    1634                      .dwattr $C$DW$179, DW_AT_name("baseAddr")
    1635                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_baseAddr")
    1636                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$180       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   52

    1639                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$180, DW_AT_name("chanNo")
    1641                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_chanNo")
    1642                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1643                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$181       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$181, DW_AT_name("status")
    1647                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_status")
    1648                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1649                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1650                      .dwendtag $C$DW$T$28
    1651              
    1652              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
    1653                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$28)
    1654                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1655              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    1656                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1657                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    1658              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    1659                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1660                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1661              
    1662              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1663                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1664              $C$DW$182       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1666                      .dwattr $C$DW$182, DW_AT_name("SARCTRL")
    1667                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SARCTRL")
    1668                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$183       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1672                      .dwattr $C$DW$183, DW_AT_name("SARCLKCTRL")
    1673                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SARCLKCTRL")
    1674                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1675                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1676              $C$DW$184       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    1678                      .dwattr $C$DW$184, DW_AT_name("SARPINCTRL")
    1679                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SARPINCTRL")
    1680                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1681                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1682              $C$DW$185       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    1684                      .dwattr $C$DW$185, DW_AT_name("SARGPOCTRL")
    1685                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SARGPOCTRL")
    1686                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1687                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1688                      .dwendtag $C$DW$T$29
    1689              
    1690              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChConfig")
    1691                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    1692                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1693              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   53

    1694                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1695                      .dwattr $C$DW$T$52, DW_AT_address_class(0x17)
    1696              
    1697              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1698                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1699              $C$DW$186       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$186, DW_AT_name("SysClkDiv")
    1702                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_SysClkDiv")
    1703                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$187       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1707                      .dwattr $C$DW$187, DW_AT_name("OpMode")
    1708                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_OpMode")
    1709                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1710                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$188       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$33)
    1713                      .dwattr $C$DW$188, DW_AT_name("MultiCh")
    1714                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_MultiCh")
    1715                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1716                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$189       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$35)
    1719                      .dwattr $C$DW$189, DW_AT_name("RefVoltage")
    1720                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RefVoltage")
    1721                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1722                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1723                      .dwendtag $C$DW$T$36
    1724              
    1725              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    1726                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$36)
    1727                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1728              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1729                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1730                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1731              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1732                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1733                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1734                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1735              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1736                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1737                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1738                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1739              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1740                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1741                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1742                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1743              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1744                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1745                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1746                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1747              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1748                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Sat Sep 29 23:08:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar_PollExample.asm                                              PAGE   54

    1749                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1750                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1751              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1752                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$8)
    1753                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1754              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1755                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1756                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1757              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    1758                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$57)
    1759                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    1760              $C$DW$190       .dwtag  DW_TAG_TI_far_type
    1761                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$56)
    1762              $C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1763                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$190)
    1764              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1765                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1766                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1767                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1768              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1769                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1770                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1771              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    1772                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
